var citylist= [
	{
		"text": "北京",
		"value": "100000",
		"children": [
			{
				"text": "北京市",
				"value": "100000",
				"children": [
					{
						"text": "东城区",
						"value": "100010"
					},
					{
						"text": "西城区",
						"value": "100032"
					},
					{
						"text": "朝阳区",
						"value": "100020"
					},
					{
						"text": "丰台区",
						"value": "100071"
					},
					{
						"text": "石景山区",
						"value": "100043"
					},
					{
						"text": "海淀区",
						"value": "100089"
					},
					{
						"text": "门头沟区",
						"value": "102300"
					},
					{
						"text": "房山区",
						"value": "102488"
					},
					{
						"text": "通州区",
						"value": "101149"
					},
					{
						"text": "顺义区",
						"value": "101300"
					},
					{
						"text": "昌平区",
						"value": "102200"
					},
					{
						"text": "大兴区",
						"value": "102600"
					},
					{
						"text": "怀柔区",
						"value": "101400"
					},
					{
						"text": "平谷区",
						"value": "101200"
					},
					{
						"text": "密云县",
						"value": "101500"
					},
					{
						"text": "延庆县",
						"value": "102100"
					}
				]
			}
		]
	},
	{
		"text": "天津",
		"value": "300000",
		"children": [
			{
				"text": "天津市",
				"value": "300000",
				"children": [
					{
						"text": "和平区",
						"value": "300041"
					},
					{
						"text": "河东区",
						"value": "300171"
					},
					{
						"text": "河西区",
						"value": "300202"
					},
					{
						"text": "南开区",
						"value": "300110"
					},
					{
						"text": "河北区",
						"value": "300143"
					},
					{
						"text": "红桥区",
						"value": "300131"
					},
					{
						"text": "东丽区",
						"value": "300300"
					},
					{
						"text": "西青区",
						"value": "300380"
					},
					{
						"text": "津南区",
						"value": "300350"
					},
					{
						"text": "北辰区",
						"value": "300400"
					},
					{
						"text": "武清区",
						"value": "301700"
					},
					{
						"text": "宝坻区",
						"value": "301800"
					},
					{
						"text": "滨海新区",
						"value": "300451"
					},
					{
						"text": "宁河县",
						"value": "301500"
					},
					{
						"text": "静海县",
						"value": "301600"
					},
					{
						"text": "蓟县",
						"value": "301900"
					}
				]
			}
		]
	},
	{
		"text": "河北省",
		"value": "050011",
		"children": [
			{
				"text": "石家庄市",
				"value": "050011",
				"children": [
					{
						"text": "长安区",
						"value": "050011"
					},
					{
						"text": "桥西区",
						"value": "050091"
					},
					{
						"text": "新华区",
						"value": "050051"
					},
					{
						"text": "井陉矿区",
						"value": "050100"
					},
					{
						"text": "裕华区",
						"value": "050031"
					},
					{
						"text": "藁城区",
						"value": "052160"
					},
					{
						"text": "鹿泉区",
						"value": "050200"
					},
					{
						"text": "栾城区",
						"value": "051430"
					},
					{
						"text": "井陉县",
						"value": "050300"
					},
					{
						"text": "正定县",
						"value": "050800"
					},
					{
						"text": "行唐县",
						"value": "050600"
					},
					{
						"text": "灵寿县",
						"value": "050500"
					},
					{
						"text": "高邑县",
						"value": "051330"
					},
					{
						"text": "深泽县",
						"value": "052560"
					},
					{
						"text": "赞皇县",
						"value": "051230"
					},
					{
						"text": "无极县",
						"value": "052460"
					},
					{
						"text": "平山县",
						"value": "050400"
					},
					{
						"text": "元氏县",
						"value": "051130"
					},
					{
						"text": "赵县",
						"value": "051530"
					},
					{
						"text": "辛集市",
						"value": "052360"
					},
					{
						"text": "晋州市",
						"value": "052260"
					},
					{
						"text": "新乐市",
						"value": "050700"
					}
				]
			},
			{
				"text": "唐山市",
				"value": "063000",
				"children": [
					{
						"text": "路南区",
						"value": "063000"
					},
					{
						"text": "路北区",
						"value": "063000"
					},
					{
						"text": "古冶区",
						"value": "063100"
					},
					{
						"text": "开平区",
						"value": "063021"
					},
					{
						"text": "丰南区",
						"value": "063300"
					},
					{
						"text": "丰润区",
						"value": "064000"
					},
					{
						"text": "曹妃甸区",
						"value": "063200"
					},
					{
						"text": "滦县",
						"value": "063700"
					},
					{
						"text": "滦南县",
						"value": "063500"
					},
					{
						"text": "乐亭县",
						"value": "063600"
					},
					{
						"text": "迁西县",
						"value": "064300"
					},
					{
						"text": "玉田县",
						"value": "064100"
					},
					{
						"text": "遵化市",
						"value": "064200"
					},
					{
						"text": "迁安市",
						"value": "064400"
					}
				]
			},
			{
				"text": "秦皇岛市",
				"value": "066000",
				"children": [
					{
						"text": "海港区",
						"value": "066000"
					},
					{
						"text": "山海关区",
						"value": "066200"
					},
					{
						"text": "北戴河区",
						"value": "066100"
					},
					{
						"text": "青龙满族自治县",
						"value": "066500"
					},
					{
						"text": "昌黎县",
						"value": "066600"
					},
					{
						"text": "抚宁县",
						"value": "066300"
					},
					{
						"text": "卢龙县",
						"value": "066400"
					}
				]
			},
			{
				"text": "邯郸市",
				"value": "056002",
				"children": [
					{
						"text": "邯山区",
						"value": "056001"
					},
					{
						"text": "丛台区",
						"value": "056002"
					},
					{
						"text": "复兴区",
						"value": "056003"
					},
					{
						"text": "峰峰矿区",
						"value": "056200"
					},
					{
						"text": "邯郸县",
						"value": "056101"
					},
					{
						"text": "临漳县",
						"value": "056600"
					},
					{
						"text": "成安县",
						"value": "056700"
					},
					{
						"text": "大名县",
						"value": "056900"
					},
					{
						"text": "涉县",
						"value": "056400"
					},
					{
						"text": "磁县",
						"value": "056500"
					},
					{
						"text": "肥乡县",
						"value": "057550"
					},
					{
						"text": "永年县",
						"value": "057150"
					},
					{
						"text": "邱县",
						"value": "057450"
					},
					{
						"text": "鸡泽县",
						"value": "057350"
					},
					{
						"text": "广平县",
						"value": "057650"
					},
					{
						"text": "馆陶县",
						"value": "057750"
					},
					{
						"text": "魏县",
						"value": "056800"
					},
					{
						"text": "曲周县",
						"value": "057250"
					},
					{
						"text": "武安市",
						"value": "056300"
					}
				]
			},
			{
				"text": "邢台市",
				"value": "054001",
				"children": [
					{
						"text": "桥东区",
						"value": "054001"
					},
					{
						"text": "桥西区",
						"value": "054000"
					},
					{
						"text": "邢台县",
						"value": "054001"
					},
					{
						"text": "临城县",
						"value": "054300"
					},
					{
						"text": "内丘县",
						"value": "054200"
					},
					{
						"text": "柏乡县",
						"value": "055450"
					},
					{
						"text": "隆尧县",
						"value": "055350"
					},
					{
						"text": "任县",
						"value": "055150"
					},
					{
						"text": "南和县",
						"value": "054400"
					},
					{
						"text": "宁晋县",
						"value": "055550"
					},
					{
						"text": "巨鹿县",
						"value": "055250"
					},
					{
						"text": "新河县",
						"value": "055650"
					},
					{
						"text": "广宗县",
						"value": "054600"
					},
					{
						"text": "平乡县",
						"value": "054500"
					},
					{
						"text": "威县",
						"value": "054700"
					},
					{
						"text": "清河县",
						"value": "054800"
					},
					{
						"text": "临西县",
						"value": "054900"
					},
					{
						"text": "南宫市",
						"value": "055750"
					},
					{
						"text": "沙河市",
						"value": "054100"
					}
				]
			},
			{
				"text": "保定市",
				"value": "071052",
				"children": [
					{
						"text": "新市区",
						"value": "071051"
					},
					{
						"text": "北市区",
						"value": "071000"
					},
					{
						"text": "南市区",
						"value": "071001"
					},
					{
						"text": "满城县",
						"value": "072150"
					},
					{
						"text": "清苑县",
						"value": "071100"
					},
					{
						"text": "涞水县",
						"value": "074100"
					},
					{
						"text": "阜平县",
						"value": "073200"
					},
					{
						"text": "徐水县",
						"value": "072550"
					},
					{
						"text": "定兴县",
						"value": "072650"
					},
					{
						"text": "唐县",
						"value": "072350"
					},
					{
						"text": "高阳县",
						"value": "071500"
					},
					{
						"text": "容城县",
						"value": "071700"
					},
					{
						"text": "涞源县",
						"value": "074300"
					},
					{
						"text": "望都县",
						"value": "072450"
					},
					{
						"text": "安新县",
						"value": "071600"
					},
					{
						"text": "易县",
						"value": "074200"
					},
					{
						"text": "曲阳县",
						"value": "073100"
					},
					{
						"text": "蠡县",
						"value": "071400"
					},
					{
						"text": "顺平县",
						"value": "072250"
					},
					{
						"text": "博野县",
						"value": "071300"
					},
					{
						"text": "雄县",
						"value": "071800"
					},
					{
						"text": "涿州市",
						"value": "072750"
					},
					{
						"text": "定州市",
						"value": "073000"
					},
					{
						"text": "安国市",
						"value": "071200"
					},
					{
						"text": "高碑店市",
						"value": "074000"
					}
				]
			},
			{
				"text": "张家口市",
				"value": "075000",
				"children": [
					{
						"text": "桥东区",
						"value": "075000"
					},
					{
						"text": "桥西区",
						"value": "075061"
					},
					{
						"text": "宣化区",
						"value": "075100"
					},
					{
						"text": "下花园区",
						"value": "075300"
					},
					{
						"text": "宣化县",
						"value": "075100"
					},
					{
						"text": "张北县",
						"value": "076450"
					},
					{
						"text": "康保县",
						"value": "076650"
					},
					{
						"text": "沽源县",
						"value": "076550"
					},
					{
						"text": "尚义县",
						"value": "076750"
					},
					{
						"text": "蔚县",
						"value": "075700"
					},
					{
						"text": "阳原县",
						"value": "075800"
					},
					{
						"text": "怀安县",
						"value": "076150"
					},
					{
						"text": "万全县",
						"value": "076250"
					},
					{
						"text": "怀来县",
						"value": "075400"
					},
					{
						"text": "涿鹿县",
						"value": "075600"
					},
					{
						"text": "赤城县",
						"value": "075500"
					},
					{
						"text": "崇礼县",
						"value": "076350"
					}
				]
			},
			{
				"text": "承德市",
				"value": "067000",
				"children": [
					{
						"text": "双桥区",
						"value": "067000"
					},
					{
						"text": "双滦区",
						"value": "067001"
					},
					{
						"text": "鹰手营子矿区",
						"value": "067200"
					},
					{
						"text": "承德县",
						"value": "067400"
					},
					{
						"text": "兴隆县",
						"value": "067300"
					},
					{
						"text": "平泉县",
						"value": "067500"
					},
					{
						"text": "滦平县",
						"value": "068250"
					},
					{
						"text": "隆化县",
						"value": "068150"
					},
					{
						"text": "丰宁满族自治县",
						"value": "068350"
					},
					{
						"text": "宽城满族自治县",
						"value": "067600"
					},
					{
						"text": "围场满族蒙古族自治县",
						"value": "068450"
					}
				]
			},
			{
				"text": "沧州市",
				"value": "061001",
				"children": [
					{
						"text": "新华区",
						"value": "061000"
					},
					{
						"text": "运河区",
						"value": "061001"
					},
					{
						"text": "沧县",
						"value": "061000"
					},
					{
						"text": "青县",
						"value": "062650"
					},
					{
						"text": "东光县",
						"value": "061600"
					},
					{
						"text": "海兴县",
						"value": "061200"
					},
					{
						"text": "盐山县",
						"value": "061300"
					},
					{
						"text": "肃宁县",
						"value": "062350"
					},
					{
						"text": "南皮县",
						"value": "061500"
					},
					{
						"text": "吴桥县",
						"value": "061800"
					},
					{
						"text": "献县",
						"value": "062250"
					},
					{
						"text": "孟村回族自治县",
						"value": "061400"
					},
					{
						"text": "泊头市",
						"value": "062150"
					},
					{
						"text": "任丘市",
						"value": "062550"
					},
					{
						"text": "黄骅市",
						"value": "061100"
					},
					{
						"text": "河间市",
						"value": "062450"
					}
				]
			},
			{
				"text": "廊坊市",
				"value": "065000",
				"children": [
					{
						"text": "安次区",
						"value": "065000"
					},
					{
						"text": "广阳区",
						"value": "065000"
					},
					{
						"text": "固安县",
						"value": "065500"
					},
					{
						"text": "永清县",
						"value": "065600"
					},
					{
						"text": "香河县",
						"value": "065400"
					},
					{
						"text": "大城县",
						"value": "065900"
					},
					{
						"text": "文安县",
						"value": "065800"
					},
					{
						"text": "大厂回族自治县",
						"value": "065300"
					},
					{
						"text": "霸州市",
						"value": "065700"
					},
					{
						"text": "三河市",
						"value": "065200"
					}
				]
			},
			{
				"text": "衡水市",
				"value": "053000",
				"children": [
					{
						"text": "桃城区",
						"value": "053000"
					},
					{
						"text": "枣强县",
						"value": "053100"
					},
					{
						"text": "武邑县",
						"value": "053400"
					},
					{
						"text": "武强县",
						"value": "053300"
					},
					{
						"text": "饶阳县",
						"value": "053900"
					},
					{
						"text": "安平县",
						"value": "053600"
					},
					{
						"text": "故城县",
						"value": "053800"
					},
					{
						"text": "景县",
						"value": "053500"
					},
					{
						"text": "阜城县",
						"value": "053700"
					},
					{
						"text": "冀州市",
						"value": "053200"
					},
					{
						"text": "深州市",
						"value": "053800"
					}
				]
			}
		]
	},
	{
		"text": "山西省",
		"value": "030000",
		"children": [
			{
				"text": "太原市",
				"value": "030082",
				"children": [
					{
						"text": "小店区",
						"value": "030032"
					},
					{
						"text": "迎泽区",
						"value": "030002"
					},
					{
						"text": "杏花岭区",
						"value": "030009"
					},
					{
						"text": "尖草坪区",
						"value": "030023"
					},
					{
						"text": "万柏林区",
						"value": "030024"
					},
					{
						"text": "晋源区",
						"value": "030025"
					},
					{
						"text": "清徐县",
						"value": "030400"
					},
					{
						"text": "阳曲县",
						"value": "030100"
					},
					{
						"text": "娄烦县",
						"value": "030300"
					},
					{
						"text": "古交市",
						"value": "030200"
					}
				]
			},
			{
				"text": "大同市",
				"value": "037008",
				"children": [
					{
						"text": "城区",
						"value": "037008"
					},
					{
						"text": "矿区",
						"value": "037003"
					},
					{
						"text": "南郊区",
						"value": "037001"
					},
					{
						"text": "新荣区",
						"value": "037002"
					},
					{
						"text": "阳高县",
						"value": "038100"
					},
					{
						"text": "天镇县",
						"value": "038200"
					},
					{
						"text": "广灵县",
						"value": "037500"
					},
					{
						"text": "灵丘县",
						"value": "034400"
					},
					{
						"text": "浑源县",
						"value": "037400"
					},
					{
						"text": "左云县",
						"value": "037100"
					},
					{
						"text": "大同县",
						"value": "037300"
					}
				]
			},
			{
				"text": "阳泉市",
				"value": "045000",
				"children": [
					{
						"text": "城区",
						"value": "045000"
					},
					{
						"text": "矿区",
						"value": "045000"
					},
					{
						"text": "郊区",
						"value": "045011"
					},
					{
						"text": "平定县",
						"value": "045200"
					},
					{
						"text": "盂县",
						"value": "045100"
					}
				]
			},
			{
				"text": "长治市",
				"value": "046000",
				"children": [
					{
						"text": "城区",
						"value": "046011"
					},
					{
						"text": "郊区",
						"value": "046011"
					},
					{
						"text": "长治县",
						"value": "047100"
					},
					{
						"text": "襄垣县",
						"value": "046200"
					},
					{
						"text": "屯留县",
						"value": "046100"
					},
					{
						"text": "平顺县",
						"value": "047400"
					},
					{
						"text": "黎城县",
						"value": "047600"
					},
					{
						"text": "壶关县",
						"value": "047300"
					},
					{
						"text": "长子县",
						"value": "046600"
					},
					{
						"text": "武乡县",
						"value": "046300"
					},
					{
						"text": "沁县",
						"value": "046400"
					},
					{
						"text": "沁源县",
						"value": "046500"
					},
					{
						"text": "潞城市",
						"value": "047500"
					}
				]
			},
			{
				"text": "晋城市",
				"value": "048000",
				"children": [
					{
						"text": "城区",
						"value": "048000"
					},
					{
						"text": "沁水县",
						"value": "048200"
					},
					{
						"text": "阳城县",
						"value": "048100"
					},
					{
						"text": "陵川县",
						"value": "048300"
					},
					{
						"text": "泽州县",
						"value": "048012"
					},
					{
						"text": "高平市",
						"value": "048400"
					}
				]
			},
			{
				"text": "朔州市",
				"value": "038500",
				"children": [
					{
						"text": "朔城区",
						"value": "036000"
					},
					{
						"text": "平鲁区",
						"value": "038600"
					},
					{
						"text": "山阴县",
						"value": "036900"
					},
					{
						"text": "应县",
						"value": "037600"
					},
					{
						"text": "右玉县",
						"value": "037200"
					},
					{
						"text": "怀仁县",
						"value": "038300"
					}
				]
			},
			{
				"text": "晋中市",
				"value": "030600",
				"children": [
					{
						"text": "榆次区",
						"value": "030600"
					},
					{
						"text": "榆社县",
						"value": "031800"
					},
					{
						"text": "左权县",
						"value": "032600"
					},
					{
						"text": "和顺县",
						"value": "032700"
					},
					{
						"text": "昔阳县",
						"value": "045300"
					},
					{
						"text": "寿阳县",
						"value": "045400"
					},
					{
						"text": "太谷县",
						"value": "030800"
					},
					{
						"text": "祁县",
						"value": "030900"
					},
					{
						"text": "平遥县",
						"value": "031100"
					},
					{
						"text": "灵石县",
						"value": "031300"
					},
					{
						"text": "介休市",
						"value": "032000"
					}
				]
			},
			{
				"text": "运城市",
				"value": "044000",
				"children": [
					{
						"text": "盐湖区",
						"value": "044000"
					},
					{
						"text": "临猗县",
						"value": "044100"
					},
					{
						"text": "万荣县",
						"value": "044200"
					},
					{
						"text": "闻喜县",
						"value": "043800"
					},
					{
						"text": "稷山县",
						"value": "043200"
					},
					{
						"text": "新绛县",
						"value": "043100"
					},
					{
						"text": "绛县",
						"value": "043600"
					},
					{
						"text": "垣曲县",
						"value": "043700"
					},
					{
						"text": "夏县",
						"value": "044400"
					},
					{
						"text": "平陆县",
						"value": "044300"
					},
					{
						"text": "芮城县",
						"value": "044600"
					},
					{
						"text": "永济市",
						"value": "044500"
					},
					{
						"text": "河津市",
						"value": "043300"
					}
				]
			},
			{
				"text": "忻州市",
				"value": "034000",
				"children": [
					{
						"text": "忻府区",
						"value": "034000"
					},
					{
						"text": "定襄县",
						"value": "035400"
					},
					{
						"text": "五台县",
						"value": "035500"
					},
					{
						"text": "代县",
						"value": "034200"
					},
					{
						"text": "繁峙县",
						"value": "034300"
					},
					{
						"text": "宁武县",
						"value": "036700"
					},
					{
						"text": "静乐县",
						"value": "035100"
					},
					{
						"text": "神池县",
						"value": "036100"
					},
					{
						"text": "五寨县",
						"value": "036200"
					},
					{
						"text": "岢岚县",
						"value": "036300"
					},
					{
						"text": "河曲县",
						"value": "036500"
					},
					{
						"text": "保德县",
						"value": "036600"
					},
					{
						"text": "偏关县",
						"value": "036400"
					},
					{
						"text": "原平市",
						"value": "034100"
					}
				]
			},
			{
				"text": "临汾市",
				"value": "041000",
				"children": [
					{
						"text": "尧都区",
						"value": "041000"
					},
					{
						"text": "曲沃县",
						"value": "043400"
					},
					{
						"text": "翼城县",
						"value": "043500"
					},
					{
						"text": "襄汾县",
						"value": "041500"
					},
					{
						"text": "洪洞县",
						"value": "041600"
					},
					{
						"text": "古县",
						"value": "042400"
					},
					{
						"text": "安泽县",
						"value": "042500"
					},
					{
						"text": "浮山县",
						"value": "042600"
					},
					{
						"text": "吉县",
						"value": "042200"
					},
					{
						"text": "乡宁县",
						"value": "042100"
					},
					{
						"text": "大宁县",
						"value": "042300"
					},
					{
						"text": "隰县",
						"value": "041300"
					},
					{
						"text": "永和县",
						"value": "041400"
					},
					{
						"text": "蒲县",
						"value": "041200"
					},
					{
						"text": "汾西县",
						"value": "031500"
					},
					{
						"text": "侯马市",
						"value": "043000"
					},
					{
						"text": "霍州市",
						"value": "031400"
					}
				]
			},
			{
				"text": "吕梁市",
				"value": "033000",
				"children": [
					{
						"text": "离石区",
						"value": "033000"
					},
					{
						"text": "文水县",
						"value": "032100"
					},
					{
						"text": "交城县",
						"value": "030500"
					},
					{
						"text": "兴县",
						"value": "033600"
					},
					{
						"text": "临县",
						"value": "033200"
					},
					{
						"text": "柳林县",
						"value": "033300"
					},
					{
						"text": "石楼县",
						"value": "032500"
					},
					{
						"text": "岚县",
						"value": "033500"
					},
					{
						"text": "方山县",
						"value": "033100"
					},
					{
						"text": "中阳县",
						"value": "033400"
					},
					{
						"text": "交口县",
						"value": "032400"
					},
					{
						"text": "孝义市",
						"value": "032300"
					},
					{
						"text": "汾阳市",
						"value": "032200"
					}
				]
			}
		]
	},
	{
		"text": "内蒙古自治区",
		"value": "010000",
		"children": [
			{
				"text": "呼和浩特市",
				"value": "010000",
				"children": [
					{
						"text": "新城区",
						"value": "010050"
					},
					{
						"text": "回民区",
						"value": "010030"
					},
					{
						"text": "玉泉区",
						"value": "010020"
					},
					{
						"text": "赛罕区",
						"value": "010020"
					},
					{
						"text": "土默特左旗",
						"value": "010100"
					},
					{
						"text": "托克托县",
						"value": "010200"
					},
					{
						"text": "和林格尔县",
						"value": "011500"
					},
					{
						"text": "清水河县",
						"value": "011600"
					},
					{
						"text": "武川县",
						"value": "011700"
					}
				]
			},
			{
				"text": "包头市",
				"value": "014025",
				"children": [
					{
						"text": "东河区",
						"value": "014040"
					},
					{
						"text": "昆都仑区",
						"value": "014010"
					},
					{
						"text": "青山区",
						"value": "014030"
					},
					{
						"text": "石拐区",
						"value": "014070"
					},
					{
						"text": "白云鄂博矿区",
						"value": "014080"
					},
					{
						"text": "九原区",
						"value": "014060"
					},
					{
						"text": "土默特右旗",
						"value": "014100"
					},
					{
						"text": "固阳县",
						"value": "014200"
					},
					{
						"text": "达尔罕茂明安联合旗",
						"value": "014500"
					}
				]
			},
			{
				"text": "乌海市",
				"value": "016000",
				"children": [
					{
						"text": "海勃湾区",
						"value": "016000"
					},
					{
						"text": "海南区",
						"value": "016030"
					},
					{
						"text": "乌达区",
						"value": "016040"
					}
				]
			},
			{
				"text": "赤峰市",
				"value": "024000",
				"children": [
					{
						"text": "红山区",
						"value": "024020"
					},
					{
						"text": "元宝山区",
						"value": "024076"
					},
					{
						"text": "松山区",
						"value": "024005"
					},
					{
						"text": "阿鲁科尔沁旗",
						"value": "025550"
					},
					{
						"text": "巴林左旗",
						"value": "025450"
					},
					{
						"text": "巴林右旗",
						"value": "025150"
					},
					{
						"text": "林西县",
						"value": "025250"
					},
					{
						"text": "克什克腾旗",
						"value": "025350"
					},
					{
						"text": "翁牛特旗",
						"value": "024500"
					},
					{
						"text": "喀喇沁旗",
						"value": "024400"
					},
					{
						"text": "宁城县",
						"value": "024200"
					},
					{
						"text": "敖汉旗",
						"value": "024300"
					}
				]
			},
			{
				"text": "通辽市",
				"value": "028000",
				"children": [
					{
						"text": "科尔沁区",
						"value": "028000"
					},
					{
						"text": "科尔沁左翼中旗",
						"value": "029300"
					},
					{
						"text": "科尔沁左翼后旗",
						"value": "028100"
					},
					{
						"text": "开鲁县",
						"value": "028400"
					},
					{
						"text": "库伦旗",
						"value": "028200"
					},
					{
						"text": "奈曼旗",
						"value": "028300"
					},
					{
						"text": "扎鲁特旗",
						"value": "029100"
					},
					{
						"text": "霍林郭勒市",
						"value": "029200"
					}
				]
			},
			{
				"text": "鄂尔多斯市",
				"value": "017004",
				"children": [
					{
						"text": "东胜区",
						"value": "017000"
					},
					{
						"text": "达拉特旗",
						"value": "014300"
					},
					{
						"text": "准格尔旗",
						"value": "017100"
					},
					{
						"text": "鄂托克前旗",
						"value": "016200"
					},
					{
						"text": "鄂托克旗",
						"value": "016100"
					},
					{
						"text": "杭锦旗",
						"value": "017400"
					},
					{
						"text": "乌审旗",
						"value": "017300"
					},
					{
						"text": "伊金霍洛旗",
						"value": "017200"
					}
				]
			},
			{
				"text": "呼伦贝尔市",
				"value": "021008",
				"children": [
					{
						"text": "海拉尔区",
						"value": "021000"
					},
					{
						"text": "扎赉诺尔区",
						"value": "021410"
					},
					{
						"text": "阿荣旗",
						"value": "162750"
					},
					{
						"text": "莫力达瓦达斡尔族自治旗",
						"value": "162850"
					},
					{
						"text": "鄂伦春自治旗",
						"value": "165450"
					},
					{
						"text": "鄂温克族自治旗",
						"value": "021100"
					},
					{
						"text": "陈巴尔虎旗",
						"value": "021500"
					},
					{
						"text": "新巴尔虎左旗",
						"value": "021200"
					},
					{
						"text": "新巴尔虎右旗",
						"value": "021300"
					},
					{
						"text": "满洲里市",
						"value": "021400"
					},
					{
						"text": "牙克石市",
						"value": "022150"
					},
					{
						"text": "扎兰屯市",
						"value": "162650"
					},
					{
						"text": "额尔古纳市",
						"value": "022250"
					},
					{
						"text": "根河市",
						"value": "022350"
					}
				]
			},
			{
				"text": "巴彦淖尔市",
				"value": "015001",
				"children": [
					{
						"text": "临河区",
						"value": "015001"
					},
					{
						"text": "五原县",
						"value": "015100"
					},
					{
						"text": "磴口县",
						"value": "015200"
					},
					{
						"text": "乌拉特前旗",
						"value": "014400"
					},
					{
						"text": "乌拉特中旗",
						"value": "015300"
					},
					{
						"text": "乌拉特后旗",
						"value": "015500"
					},
					{
						"text": "杭锦后旗",
						"value": "015400"
					}
				]
			},
			{
				"text": "乌兰察布市",
				"value": "012000",
				"children": [
					{
						"text": "集宁区",
						"value": "012000"
					},
					{
						"text": "卓资县",
						"value": "012300"
					},
					{
						"text": "化德县",
						"value": "013350"
					},
					{
						"text": "商都县",
						"value": "013450"
					},
					{
						"text": "兴和县",
						"value": "013650"
					},
					{
						"text": "凉城县",
						"value": "013750"
					},
					{
						"text": "察哈尔右翼前旗",
						"value": "012200"
					},
					{
						"text": "察哈尔右翼中旗",
						"value": "013550"
					},
					{
						"text": "察哈尔右翼后旗",
						"value": "012400"
					},
					{
						"text": "四子王旗",
						"value": "011800"
					},
					{
						"text": "丰镇市",
						"value": "012100"
					}
				]
			},
			{
				"text": "兴安盟",
				"value": "137401",
				"children": [
					{
						"text": "乌兰浩特市",
						"value": "137401"
					},
					{
						"text": "阿尔山市",
						"value": "137800"
					},
					{
						"text": "科尔沁右翼前旗",
						"value": "137423"
					},
					{
						"text": "科尔沁右翼中旗",
						"value": "029400"
					},
					{
						"text": "扎赉特旗",
						"value": "137600"
					},
					{
						"text": "突泉县",
						"value": "137500"
					}
				]
			},
			{
				"text": "锡林郭勒盟",
				"value": "026000",
				"children": [
					{
						"text": "二连浩特市",
						"value": "011100"
					},
					{
						"text": "锡林浩特市",
						"value": "026021"
					},
					{
						"text": "阿巴嘎旗",
						"value": "011400"
					},
					{
						"text": "苏尼特左旗",
						"value": "011300"
					},
					{
						"text": "苏尼特右旗",
						"value": "011200"
					},
					{
						"text": "东乌珠穆沁旗",
						"value": "026300"
					},
					{
						"text": "西乌珠穆沁旗",
						"value": "026200"
					},
					{
						"text": "太仆寺旗",
						"value": "027000"
					},
					{
						"text": "镶黄旗",
						"value": "013250"
					},
					{
						"text": "正镶白旗",
						"value": "013800"
					},
					{
						"text": "正蓝旗",
						"value": "027200"
					},
					{
						"text": "多伦县",
						"value": "027300"
					}
				]
			},
			{
				"text": "阿拉善盟",
				"value": "750306",
				"children": [
					{
						"text": "阿拉善左旗",
						"value": "750306"
					},
					{
						"text": "阿拉善右旗",
						"value": "737300"
					},
					{
						"text": "额济纳旗",
						"value": "735400"
					}
				]
			}
		]
	},
	{
		"text": "辽宁省",
		"value": "110000",
		"children": [
			{
				"text": "沈阳市",
				"value": "110013",
				"children": [
					{
						"text": "和平区",
						"value": "110001"
					},
					{
						"text": "沈河区",
						"value": "110011"
					},
					{
						"text": "大东区",
						"value": "110041"
					},
					{
						"text": "皇姑区",
						"value": "110031"
					},
					{
						"text": "铁西区",
						"value": "110021"
					},
					{
						"text": "苏家屯区",
						"value": "110101"
					},
					{
						"text": "浑南区",
						"value": "110015"
					},
					{
						"text": "沈北新区",
						"value": "110121"
					},
					{
						"text": "于洪区",
						"value": "110141"
					},
					{
						"text": "辽中县",
						"value": "110200"
					},
					{
						"text": "康平县",
						"value": "110500"
					},
					{
						"text": "法库县",
						"value": "110400"
					},
					{
						"text": "新民市",
						"value": "110300"
					}
				]
			},
			{
				"text": "大连市",
				"value": "116011",
				"children": [
					{
						"text": "中山区",
						"value": "116001"
					},
					{
						"text": "西岗区",
						"value": "116011"
					},
					{
						"text": "沙河口区",
						"value": "116021"
					},
					{
						"text": "甘井子区",
						"value": "116033"
					},
					{
						"text": "旅顺口区",
						"value": "116041"
					},
					{
						"text": "金州区",
						"value": "116100"
					},
					{
						"text": "长海县",
						"value": "116500"
					},
					{
						"text": "瓦房店市",
						"value": "116300"
					},
					{
						"text": "普兰店市",
						"value": "116200"
					},
					{
						"text": "庄河市",
						"value": "116400"
					}
				]
			},
			{
				"text": "鞍山市",
				"value": "114001",
				"children": [
					{
						"text": "铁东区",
						"value": "114001"
					},
					{
						"text": "铁西区",
						"value": "114013"
					},
					{
						"text": "立山区",
						"value": "114031"
					},
					{
						"text": "千山区",
						"value": "114041"
					},
					{
						"text": "台安县",
						"value": "114100"
					},
					{
						"text": "岫岩满族自治县",
						"value": "114300"
					},
					{
						"text": "海城市",
						"value": "114200"
					}
				]
			},
			{
				"text": "抚顺市",
				"value": "113008",
				"children": [
					{
						"text": "新抚区",
						"value": "113008"
					},
					{
						"text": "东洲区",
						"value": "113003"
					},
					{
						"text": "望花区",
						"value": "113001"
					},
					{
						"text": "顺城区",
						"value": "113006"
					},
					{
						"text": "抚顺县",
						"value": "113006"
					},
					{
						"text": "新宾满族自治县",
						"value": "113200"
					},
					{
						"text": "清原满族自治县",
						"value": "113300"
					}
				]
			},
			{
				"text": "本溪市",
				"value": "117000",
				"children": [
					{
						"text": "平山区",
						"value": "117000"
					},
					{
						"text": "溪湖区",
						"value": "117002"
					},
					{
						"text": "明山区",
						"value": "117021"
					},
					{
						"text": "南芬区",
						"value": "117014"
					},
					{
						"text": "本溪满族自治县",
						"value": "117100"
					},
					{
						"text": "桓仁满族自治县",
						"value": "117200"
					}
				]
			},
			{
				"text": "丹东市",
				"value": "118000",
				"children": [
					{
						"text": "元宝区",
						"value": "118000"
					},
					{
						"text": "振兴区",
						"value": "118002"
					},
					{
						"text": "振安区",
						"value": "118001"
					},
					{
						"text": "宽甸满族自治县",
						"value": "118200"
					},
					{
						"text": "东港市",
						"value": "118300"
					},
					{
						"text": "凤城市",
						"value": "118100"
					}
				]
			},
			{
				"text": "锦州市",
				"value": "121000",
				"children": [
					{
						"text": "古塔区",
						"value": "121001"
					},
					{
						"text": "凌河区",
						"value": "121000"
					},
					{
						"text": "太和区",
						"value": "121011"
					},
					{
						"text": "黑山县",
						"value": "121400"
					},
					{
						"text": "义县",
						"value": "121100"
					},
					{
						"text": "凌海市",
						"value": "121200"
					},
					{
						"text": "北镇市",
						"value": "121300"
					}
				]
			},
			{
				"text": "营口市",
				"value": "115003",
				"children": [
					{
						"text": "站前区",
						"value": "115002"
					},
					{
						"text": "西市区",
						"value": "115004"
					},
					{
						"text": "鲅鱼圈区",
						"value": "115007"
					},
					{
						"text": "老边区",
						"value": "115005"
					},
					{
						"text": "盖州市",
						"value": "115200"
					},
					{
						"text": "大石桥市",
						"value": "115100"
					}
				]
			},
			{
				"text": "阜新市",
				"value": "123000",
				"children": [
					{
						"text": "海州区",
						"value": "123000"
					},
					{
						"text": "新邱区",
						"value": "123005"
					},
					{
						"text": "太平区",
						"value": "123003"
					},
					{
						"text": "清河门区",
						"value": "123006"
					},
					{
						"text": "细河区",
						"value": "123000"
					},
					{
						"text": "阜新蒙古族自治县",
						"value": "123100"
					},
					{
						"text": "彰武县",
						"value": "123200"
					}
				]
			},
			{
				"text": "辽阳市",
				"value": "111000",
				"children": [
					{
						"text": "白塔区",
						"value": "111000"
					},
					{
						"text": "文圣区",
						"value": "111000"
					},
					{
						"text": "宏伟区",
						"value": "111003"
					},
					{
						"text": "弓长岭区",
						"value": "111008"
					},
					{
						"text": "太子河区",
						"value": "111000"
					},
					{
						"text": "辽阳县",
						"value": "111200"
					},
					{
						"text": "灯塔市",
						"value": "111300"
					}
				]
			},
			{
				"text": "盘锦市",
				"value": "124010",
				"children": [
					{
						"text": "双台子区",
						"value": "124000"
					},
					{
						"text": "兴隆台区",
						"value": "124010"
					},
					{
						"text": "大洼县",
						"value": "124200"
					},
					{
						"text": "盘山县",
						"value": "124000"
					}
				]
			},
			{
				"text": "铁岭市",
				"value": "112000",
				"children": [
					{
						"text": "银州区",
						"value": "112000"
					},
					{
						"text": "清河区",
						"value": "112003"
					},
					{
						"text": "铁岭县",
						"value": "112000"
					},
					{
						"text": "西丰县",
						"value": "112400"
					},
					{
						"text": "昌图县",
						"value": "112500"
					},
					{
						"text": "调兵山市",
						"value": "112700"
					},
					{
						"text": "开原市",
						"value": "112300"
					}
				]
			},
			{
				"text": "朝阳市",
				"value": "122000",
				"children": [
					{
						"text": "双塔区",
						"value": "122000"
					},
					{
						"text": "龙城区",
						"value": "122000"
					},
					{
						"text": "朝阳县",
						"value": "122000"
					},
					{
						"text": "建平县",
						"value": "122400"
					},
					{
						"text": "喀喇沁左翼蒙古族自治县",
						"value": "122300"
					},
					{
						"text": "北票市",
						"value": "122100"
					},
					{
						"text": "凌源市",
						"value": "122500"
					}
				]
			},
			{
				"text": "葫芦岛市",
				"value": "125000",
				"children": [
					{
						"text": "连山区",
						"value": "125001"
					},
					{
						"text": "龙港区",
						"value": "125003"
					},
					{
						"text": "南票区",
						"value": "125027"
					},
					{
						"text": "绥中县",
						"value": "125200"
					},
					{
						"text": "建昌县",
						"value": "125300"
					},
					{
						"text": "兴城市",
						"value": "125100"
					}
				]
			},
			{
				"text": "金普新区",
				"value": "116100",
				"children": [
					{
						"text": "金州新区",
						"value": "116100"
					},
					{
						"text": "普湾新区",
						"value": "116200"
					},
					{
						"text": "保税区",
						"value": "116100"
					}
				]
			}
		]
	},
	{
		"text": "吉林省",
		"value": "130000",
		"children": [
			{
				"text": "长春市",
				"value": "130022",
				"children": [
					{
						"text": "南关区",
						"value": "130022"
					},
					{
						"text": "宽城区",
						"value": "130051"
					},
					{
						"text": "朝阳区",
						"value": "130012"
					},
					{
						"text": "二道区",
						"value": "130031"
					},
					{
						"text": "绿园区",
						"value": "130062"
					},
					{
						"text": "双阳区",
						"value": "130600"
					},
					{
						"text": "九台区",
						"value": "130500"
					},
					{
						"text": "农安县",
						"value": "130200"
					},
					{
						"text": "榆树市",
						"value": "130400"
					},
					{
						"text": "德惠市",
						"value": "130300"
					}
				]
			},
			{
				"text": "吉林市",
				"value": "132011",
				"children": [
					{
						"text": "昌邑区",
						"value": "132002"
					},
					{
						"text": "龙潭区",
						"value": "132021"
					},
					{
						"text": "船营区",
						"value": "132011"
					},
					{
						"text": "丰满区",
						"value": "132013"
					},
					{
						"text": "永吉县",
						"value": "132200"
					},
					{
						"text": "蛟河市",
						"value": "132500"
					},
					{
						"text": "桦甸市",
						"value": "132400"
					},
					{
						"text": "舒兰市",
						"value": "132600"
					},
					{
						"text": "磐石市",
						"value": "132300"
					}
				]
			},
			{
				"text": "四平市",
				"value": "136000",
				"children": [
					{
						"text": "铁西区",
						"value": "136000"
					},
					{
						"text": "铁东区",
						"value": "136001"
					},
					{
						"text": "梨树县",
						"value": "136500"
					},
					{
						"text": "伊通满族自治县",
						"value": "130700"
					},
					{
						"text": "公主岭市",
						"value": "136100"
					},
					{
						"text": "双辽市",
						"value": "136400"
					}
				]
			},
			{
				"text": "辽源市",
				"value": "136200",
				"children": [
					{
						"text": "龙山区",
						"value": "136200"
					},
					{
						"text": "西安区",
						"value": "136201"
					},
					{
						"text": "东丰县",
						"value": "136300"
					},
					{
						"text": "东辽县",
						"value": "136600"
					}
				]
			},
			{
				"text": "通化市",
				"value": "134001",
				"children": [
					{
						"text": "东昌区",
						"value": "134001"
					},
					{
						"text": "二道江区",
						"value": "134003"
					},
					{
						"text": "通化县",
						"value": "134100"
					},
					{
						"text": "辉南县",
						"value": "135100"
					},
					{
						"text": "柳河县",
						"value": "135300"
					},
					{
						"text": "梅河口市",
						"value": "135000"
					},
					{
						"text": "集安市",
						"value": "134200"
					}
				]
			},
			{
				"text": "白山市",
				"value": "134300",
				"children": [
					{
						"text": "浑江区",
						"value": "134300"
					},
					{
						"text": "江源区",
						"value": "134700"
					},
					{
						"text": "抚松县",
						"value": "134500"
					},
					{
						"text": "靖宇县",
						"value": "135200"
					},
					{
						"text": "长白朝鲜族自治县",
						"value": "134400"
					},
					{
						"text": "临江市",
						"value": "134600"
					}
				]
			},
			{
				"text": "松原市",
				"value": "138000",
				"children": [
					{
						"text": "宁江区",
						"value": "138000"
					},
					{
						"text": "前郭尔罗斯蒙古族自治县",
						"value": "138000"
					},
					{
						"text": "长岭县",
						"value": "131500"
					},
					{
						"text": "乾安县",
						"value": "131400"
					},
					{
						"text": "扶余市",
						"value": "131200"
					}
				]
			},
			{
				"text": "白城市",
				"value": "137000",
				"children": [
					{
						"text": "洮北区",
						"value": "137000"
					},
					{
						"text": "镇赉县",
						"value": "137300"
					},
					{
						"text": "通榆县",
						"value": "137200"
					},
					{
						"text": "洮南市",
						"value": "137100"
					},
					{
						"text": "大安市",
						"value": "131300"
					}
				]
			},
			{
				"text": "延边朝鲜族自治州",
				"value": "133000",
				"children": [
					{
						"text": "延吉市",
						"value": "133000"
					},
					{
						"text": "图们市",
						"value": "133100"
					},
					{
						"text": "敦化市",
						"value": "133700"
					},
					{
						"text": "珲春市",
						"value": "133300"
					},
					{
						"text": "龙井市",
						"value": "133400"
					},
					{
						"text": "和龙市",
						"value": "133500"
					},
					{
						"text": "汪清县",
						"value": "133200"
					},
					{
						"text": "安图县",
						"value": "133600"
					}
				]
			}
		]
	},
	{
		"text": "黑龙江省",
		"value": "150000",
		"children": [
			{
				"text": "哈尔滨市",
				"value": "150010",
				"children": [
					{
						"text": "道里区",
						"value": "150010"
					},
					{
						"text": "南岗区",
						"value": "150006"
					},
					{
						"text": "道外区",
						"value": "150020"
					},
					{
						"text": "平房区",
						"value": "150060"
					},
					{
						"text": "松北区",
						"value": "150028"
					},
					{
						"text": "香坊区",
						"value": "150036"
					},
					{
						"text": "呼兰区",
						"value": "150500"
					},
					{
						"text": "阿城区",
						"value": "150300"
					},
					{
						"text": "双城区",
						"value": "150100"
					},
					{
						"text": "依兰县",
						"value": "154800"
					},
					{
						"text": "方正县",
						"value": "150800"
					},
					{
						"text": "宾县",
						"value": "150400"
					},
					{
						"text": "巴彦县",
						"value": "151800"
					},
					{
						"text": "木兰县",
						"value": "151900"
					},
					{
						"text": "通河县",
						"value": "150900"
					},
					{
						"text": "延寿县",
						"value": "150700"
					},
					{
						"text": "尚志市",
						"value": "150600"
					},
					{
						"text": "五常市",
						"value": "150200"
					}
				]
			},
			{
				"text": "齐齐哈尔市",
				"value": "161005",
				"children": [
					{
						"text": "龙沙区",
						"value": "161000"
					},
					{
						"text": "建华区",
						"value": "161006"
					},
					{
						"text": "铁锋区",
						"value": "161000"
					},
					{
						"text": "昂昂溪区",
						"value": "161031"
					},
					{
						"text": "富拉尔基区",
						"value": "161041"
					},
					{
						"text": "碾子山区",
						"value": "161046"
					},
					{
						"text": "梅里斯达斡尔族区",
						"value": "161021"
					},
					{
						"text": "龙江县",
						"value": "161100"
					},
					{
						"text": "依安县",
						"value": "161500"
					},
					{
						"text": "泰来县",
						"value": "162400"
					},
					{
						"text": "甘南县",
						"value": "162100"
					},
					{
						"text": "富裕县",
						"value": "161200"
					},
					{
						"text": "克山县",
						"value": "161600"
					},
					{
						"text": "克东县",
						"value": "164800"
					},
					{
						"text": "拜泉县",
						"value": "164700"
					},
					{
						"text": "讷河市",
						"value": "161300"
					}
				]
			},
			{
				"text": "鸡西市",
				"value": "158100",
				"children": [
					{
						"text": "鸡冠区",
						"value": "158100"
					},
					{
						"text": "恒山区",
						"value": "158130"
					},
					{
						"text": "滴道区",
						"value": "158150"
					},
					{
						"text": "梨树区",
						"value": "158160"
					},
					{
						"text": "城子河区",
						"value": "158170"
					},
					{
						"text": "麻山区",
						"value": "158180"
					},
					{
						"text": "鸡东县",
						"value": "158200"
					},
					{
						"text": "虎林市",
						"value": "158400"
					},
					{
						"text": "密山市",
						"value": "158300"
					}
				]
			},
			{
				"text": "鹤岗市",
				"value": "154100",
				"children": [
					{
						"text": "向阳区",
						"value": "154100"
					},
					{
						"text": "工农区",
						"value": "154101"
					},
					{
						"text": "南山区",
						"value": "154104"
					},
					{
						"text": "兴安区",
						"value": "154102"
					},
					{
						"text": "东山区",
						"value": "154106"
					},
					{
						"text": "兴山区",
						"value": "154105"
					},
					{
						"text": "萝北县",
						"value": "154200"
					},
					{
						"text": "绥滨县",
						"value": "156200"
					}
				]
			},
			{
				"text": "双鸭山市",
				"value": "155100",
				"children": [
					{
						"text": "尖山区",
						"value": "155100"
					},
					{
						"text": "岭东区",
						"value": "155120"
					},
					{
						"text": "四方台区",
						"value": "155130"
					},
					{
						"text": "宝山区",
						"value": "155131"
					},
					{
						"text": "集贤县",
						"value": "155900"
					},
					{
						"text": "友谊县",
						"value": "155800"
					},
					{
						"text": "宝清县",
						"value": "155600"
					},
					{
						"text": "饶河县",
						"value": "155700"
					}
				]
			},
			{
				"text": "大庆市",
				"value": "163000",
				"children": [
					{
						"text": "萨尔图区",
						"value": "163001"
					},
					{
						"text": "龙凤区",
						"value": "163711"
					},
					{
						"text": "让胡路区",
						"value": "163712"
					},
					{
						"text": "红岗区",
						"value": "163511"
					},
					{
						"text": "大同区",
						"value": "163515"
					},
					{
						"text": "肇州县",
						"value": "166400"
					},
					{
						"text": "肇源县",
						"value": "166500"
					},
					{
						"text": "林甸县",
						"value": "166300"
					},
					{
						"text": "杜尔伯特蒙古族自治县",
						"value": "166200"
					}
				]
			},
			{
				"text": "伊春市",
				"value": "153000",
				"children": [
					{
						"text": "伊春区",
						"value": "153000"
					},
					{
						"text": "南岔区",
						"value": "153100"
					},
					{
						"text": "友好区",
						"value": "153031"
					},
					{
						"text": "西林区",
						"value": "153025"
					},
					{
						"text": "翠峦区",
						"value": "153013"
					},
					{
						"text": "新青区",
						"value": "153036"
					},
					{
						"text": "美溪区",
						"value": "153021"
					},
					{
						"text": "金山屯区",
						"value": "153026"
					},
					{
						"text": "五营区",
						"value": "153033"
					},
					{
						"text": "乌马河区",
						"value": "153011"
					},
					{
						"text": "汤旺河区",
						"value": "153037"
					},
					{
						"text": "带岭区",
						"value": "153106"
					},
					{
						"text": "乌伊岭区",
						"value": "153038"
					},
					{
						"text": "红星区",
						"value": "153035"
					},
					{
						"text": "上甘岭区",
						"value": "153032"
					},
					{
						"text": "嘉荫县",
						"value": "153200"
					},
					{
						"text": "铁力市",
						"value": "152500"
					}
				]
			},
			{
				"text": "佳木斯市",
				"value": "154002",
				"children": [
					{
						"text": "向阳区",
						"value": "154002"
					},
					{
						"text": "前进区",
						"value": "154002"
					},
					{
						"text": "东风区",
						"value": "154005"
					},
					{
						"text": "郊区",
						"value": "154004"
					},
					{
						"text": "桦南县",
						"value": "154400"
					},
					{
						"text": "桦川县",
						"value": "154300"
					},
					{
						"text": "汤原县",
						"value": "154700"
					},
					{
						"text": "抚远县",
						"value": "156500"
					},
					{
						"text": "同江市",
						"value": "156400"
					},
					{
						"text": "富锦市",
						"value": "156100"
					}
				]
			},
			{
				"text": "七台河市",
				"value": "154600",
				"children": [
					{
						"text": "新兴区",
						"value": "154604"
					},
					{
						"text": "桃山区",
						"value": "154600"
					},
					{
						"text": "茄子河区",
						"value": "154622"
					},
					{
						"text": "勃利县",
						"value": "154500"
					}
				]
			},
			{
				"text": "牡丹江市",
				"value": "157000",
				"children": [
					{
						"text": "东安区",
						"value": "157000"
					},
					{
						"text": "阳明区",
						"value": "157013"
					},
					{
						"text": "爱民区",
						"value": "157009"
					},
					{
						"text": "西安区",
						"value": "157000"
					},
					{
						"text": "东宁县",
						"value": "157200"
					},
					{
						"text": "林口县",
						"value": "157600"
					},
					{
						"text": "绥芬河市",
						"value": "157300"
					},
					{
						"text": "海林市",
						"value": "157100"
					},
					{
						"text": "宁安市",
						"value": "157400"
					},
					{
						"text": "穆棱市",
						"value": "157500"
					}
				]
			},
			{
				"text": "黑河市",
				"value": "164300",
				"children": [
					{
						"text": "爱辉区",
						"value": "164300"
					},
					{
						"text": "嫩江县",
						"value": "161400"
					},
					{
						"text": "逊克县",
						"value": "164400"
					},
					{
						"text": "孙吴县",
						"value": "164200"
					},
					{
						"text": "北安市",
						"value": "164000"
					},
					{
						"text": "五大连池市",
						"value": "164100"
					}
				]
			},
			{
				"text": "绥化市",
				"value": "152000",
				"children": [
					{
						"text": "北林区",
						"value": "152000"
					},
					{
						"text": "望奎县",
						"value": "152100"
					},
					{
						"text": "兰西县",
						"value": "151500"
					},
					{
						"text": "青冈县",
						"value": "151600"
					},
					{
						"text": "庆安县",
						"value": "152400"
					},
					{
						"text": "明水县",
						"value": "151700"
					},
					{
						"text": "绥棱县",
						"value": "152200"
					},
					{
						"text": "安达市",
						"value": "151400"
					},
					{
						"text": "肇东市",
						"value": "151100"
					},
					{
						"text": "海伦市",
						"value": "152300"
					}
				]
			},
			{
				"text": "大兴安岭地区",
				"value": "165000",
				"children": [
					{
						"text": "加格达奇区",
						"value": "165000"
					},
					{
						"text": "新林区",
						"value": "165000"
					},
					{
						"text": "松岭区",
						"value": "165000"
					},
					{
						"text": "呼中区",
						"value": "165000"
					},
					{
						"text": "呼玛县",
						"value": "165100"
					},
					{
						"text": "塔河县",
						"value": "165200"
					},
					{
						"text": "漠河县",
						"value": "165300"
					}
				]
			}
		]
	},
	{
		"text": "上海",
		"value": "200000",
		"children": [
			{
				"text": "上海市",
				"value": "200000",
				"children": [
					{
						"text": "黄浦区",
						"value": "200001"
					},
					{
						"text": "徐汇区",
						"value": "200030"
					},
					{
						"text": "长宁区",
						"value": "200050"
					},
					{
						"text": "静安区",
						"value": "200040"
					},
					{
						"text": "普陀区",
						"value": "200333"
					},
					{
						"text": "闸北区",
						"value": "200070"
					},
					{
						"text": "虹口区",
						"value": "200086"
					},
					{
						"text": "杨浦区",
						"value": "200082"
					},
					{
						"text": "闵行区",
						"value": "201100"
					},
					{
						"text": "宝山区",
						"value": "201900"
					},
					{
						"text": "嘉定区",
						"value": "201800"
					},
					{
						"text": "浦东新区",
						"value": "200135"
					},
					{
						"text": "金山区",
						"value": "200540"
					},
					{
						"text": "松江区",
						"value": "201600"
					},
					{
						"text": "青浦区",
						"value": "201700"
					},
					{
						"text": "奉贤区",
						"value": "201400"
					},
					{
						"text": "崇明县",
						"value": "202150"
					}
				]
			}
		]
	},
	{
		"text": "江苏省",
		"value": "210000",
		"children": [
			{
				"text": "南京市",
				"value": "210008",
				"children": [
					{
						"text": "玄武区",
						"value": "210018"
					},
					{
						"text": "秦淮区",
						"value": "210001"
					},
					{
						"text": "建邺区",
						"value": "210004"
					},
					{
						"text": "鼓楼区",
						"value": "210009"
					},
					{
						"text": "浦口区",
						"value": "211800"
					},
					{
						"text": "栖霞区",
						"value": "210046"
					},
					{
						"text": "雨花台区",
						"value": "210012"
					},
					{
						"text": "江宁区",
						"value": "211100"
					},
					{
						"text": "六合区",
						"value": "211500"
					},
					{
						"text": "溧水区",
						"value": "211200"
					},
					{
						"text": "高淳区",
						"value": "211300"
					}
				]
			},
			{
				"text": "无锡市",
				"value": "214000",
				"children": [
					{
						"text": "崇安区",
						"value": "214001"
					},
					{
						"text": "南长区",
						"value": "214021"
					},
					{
						"text": "北塘区",
						"value": "214044"
					},
					{
						"text": "锡山区",
						"value": "214101"
					},
					{
						"text": "惠山区",
						"value": "214174"
					},
					{
						"text": "滨湖区",
						"value": "214123"
					},
					{
						"text": "江阴市",
						"value": "214431"
					},
					{
						"text": "宜兴市",
						"value": "214200"
					}
				]
			},
			{
				"text": "徐州市",
				"value": "221003",
				"children": [
					{
						"text": "鼓楼区",
						"value": "221005"
					},
					{
						"text": "云龙区",
						"value": "221007"
					},
					{
						"text": "贾汪区",
						"value": "221003"
					},
					{
						"text": "泉山区",
						"value": "221006"
					},
					{
						"text": "铜山区",
						"value": "221106"
					},
					{
						"text": "丰县",
						"value": "221700"
					},
					{
						"text": "沛县",
						"value": "221600"
					},
					{
						"text": "睢宁县",
						"value": "221200"
					},
					{
						"text": "新沂市",
						"value": "221400"
					},
					{
						"text": "邳州市",
						"value": "221300"
					}
				]
			},
			{
				"text": "常州市",
				"value": "213000",
				"children": [
					{
						"text": "天宁区",
						"value": "213000"
					},
					{
						"text": "钟楼区",
						"value": "213023"
					},
					{
						"text": "戚墅堰区",
						"value": "213025"
					},
					{
						"text": "新北区",
						"value": "213022"
					},
					{
						"text": "武进区",
						"value": "213100"
					},
					{
						"text": "溧阳市",
						"value": "213300"
					},
					{
						"text": "金坛市",
						"value": "213200"
					}
				]
			},
			{
				"text": "苏州市",
				"value": "215002",
				"children": [
					{
						"text": "虎丘区",
						"value": "215004"
					},
					{
						"text": "吴中区",
						"value": "215128"
					},
					{
						"text": "相城区",
						"value": "215131"
					},
					{
						"text": "姑苏区",
						"value": "215031"
					},
					{
						"text": "吴江区",
						"value": "215200"
					},
					{
						"text": "常熟市",
						"value": "215500"
					},
					{
						"text": "张家港市",
						"value": "215600"
					},
					{
						"text": "昆山市",
						"value": "215300"
					},
					{
						"text": "太仓市",
						"value": "215400"
					}
				]
			},
			{
				"text": "南通市",
				"value": "226001",
				"children": [
					{
						"text": "崇川区",
						"value": "226001"
					},
					{
						"text": "港闸区",
						"value": "226001"
					},
					{
						"text": "通州区",
						"value": "226300"
					},
					{
						"text": "海安县",
						"value": "226600"
					},
					{
						"text": "如东县",
						"value": "226400"
					},
					{
						"text": "启东市",
						"value": "226200"
					},
					{
						"text": "如皋市",
						"value": "226500"
					},
					{
						"text": "海门市",
						"value": "226100"
					}
				]
			},
			{
				"text": "连云港市",
				"value": "222002",
				"children": [
					{
						"text": "连云区",
						"value": "222042"
					},
					{
						"text": "海州区",
						"value": "222003"
					},
					{
						"text": "赣榆区",
						"value": "222100"
					},
					{
						"text": "东海县",
						"value": "222300"
					},
					{
						"text": "灌云县",
						"value": "222200"
					},
					{
						"text": "灌南县",
						"value": "222500"
					}
				]
			},
			{
				"text": "淮安市",
				"value": "223001",
				"children": [
					{
						"text": "清河区",
						"value": "223001"
					},
					{
						"text": "淮安区",
						"value": "223200"
					},
					{
						"text": "淮阴区",
						"value": "223300"
					},
					{
						"text": "清浦区",
						"value": "223002"
					},
					{
						"text": "涟水县",
						"value": "223400"
					},
					{
						"text": "洪泽县",
						"value": "223100"
					},
					{
						"text": "盱眙县",
						"value": "211700"
					},
					{
						"text": "金湖县",
						"value": "211600"
					}
				]
			},
			{
				"text": "盐城市",
				"value": "224005",
				"children": [
					{
						"text": "亭湖区",
						"value": "224005"
					},
					{
						"text": "盐都区",
						"value": "224055"
					},
					{
						"text": "响水县",
						"value": "224600"
					},
					{
						"text": "滨海县",
						"value": "224500"
					},
					{
						"text": "阜宁县",
						"value": "224400"
					},
					{
						"text": "射阳县",
						"value": "224300"
					},
					{
						"text": "建湖县",
						"value": "224700"
					},
					{
						"text": "东台市",
						"value": "224200"
					},
					{
						"text": "大丰市",
						"value": "224100"
					}
				]
			},
			{
				"text": "扬州市",
				"value": "225002",
				"children": [
					{
						"text": "广陵区",
						"value": "225002"
					},
					{
						"text": "邗江区",
						"value": "225002"
					},
					{
						"text": "江都区",
						"value": "225200"
					},
					{
						"text": "宝应县",
						"value": "225800"
					},
					{
						"text": "仪征市",
						"value": "211400"
					},
					{
						"text": "高邮市",
						"value": "225600"
					}
				]
			},
			{
				"text": "镇江市",
				"value": "212004",
				"children": [
					{
						"text": "京口区",
						"value": "212003"
					},
					{
						"text": "润州区",
						"value": "212005"
					},
					{
						"text": "丹徒区",
						"value": "212028"
					},
					{
						"text": "丹阳市",
						"value": "212300"
					},
					{
						"text": "扬中市",
						"value": "212200"
					},
					{
						"text": "句容市",
						"value": "212400"
					}
				]
			},
			{
				"text": "泰州市",
				"value": "225300",
				"children": [
					{
						"text": "海陵区",
						"value": "225300"
					},
					{
						"text": "高港区",
						"value": "225321"
					},
					{
						"text": "姜堰区",
						"value": "225500"
					},
					{
						"text": "兴化市",
						"value": "225700"
					},
					{
						"text": "靖江市",
						"value": "214500"
					},
					{
						"text": "泰兴市",
						"value": "225400"
					}
				]
			},
			{
				"text": "宿迁市",
				"value": "223800",
				"children": [
					{
						"text": "宿城区",
						"value": "223800"
					},
					{
						"text": "宿豫区",
						"value": "223800"
					},
					{
						"text": "沭阳县",
						"value": "223600"
					},
					{
						"text": "泗阳县",
						"value": "223700"
					},
					{
						"text": "泗洪县",
						"value": "223900"
					}
				]
			}
		]
	},
	{
		"text": "浙江省",
		"value": "310000",
		"children": [
			{
				"text": "杭州市",
				"value": "310026",
				"children": [
					{
						"text": "上城区",
						"value": "310002"
					},
					{
						"text": "下城区",
						"value": "310006"
					},
					{
						"text": "江干区",
						"value": "310016"
					},
					{
						"text": "拱墅区",
						"value": "310011"
					},
					{
						"text": "西湖区",
						"value": "310013"
					},
					{
						"text": "滨江区",
						"value": "310051"
					},
					{
						"text": "萧山区",
						"value": "311200"
					},
					{
						"text": "余杭区",
						"value": "311100"
					},
					{
						"text": "桐庐县",
						"value": "311500"
					},
					{
						"text": "淳安县",
						"value": "311700"
					},
					{
						"text": "建德市",
						"value": "311600"
					},
					{
						"text": "富阳区",
						"value": "311400"
					},
					{
						"text": "临安市",
						"value": "311300"
					}
				]
			},
			{
				"text": "宁波市",
				"value": "315000",
				"children": [
					{
						"text": "海曙区",
						"value": "315000"
					},
					{
						"text": "江东区",
						"value": "315040"
					},
					{
						"text": "江北区",
						"value": "315020"
					},
					{
						"text": "北仑区",
						"value": "315800"
					},
					{
						"text": "镇海区",
						"value": "315200"
					},
					{
						"text": "鄞州区",
						"value": "315100"
					},
					{
						"text": "象山县",
						"value": "315700"
					},
					{
						"text": "宁海县",
						"value": "315600"
					},
					{
						"text": "余姚市",
						"value": "315400"
					},
					{
						"text": "慈溪市",
						"value": "315300"
					},
					{
						"text": "奉化市",
						"value": "315500"
					}
				]
			},
			{
				"text": "温州市",
				"value": "325000",
				"children": [
					{
						"text": "鹿城区",
						"value": "325000"
					},
					{
						"text": "龙湾区",
						"value": "325013"
					},
					{
						"text": "瓯海区",
						"value": "325005"
					},
					{
						"text": "洞头县",
						"value": "325700"
					},
					{
						"text": "永嘉县",
						"value": "325100"
					},
					{
						"text": "平阳县",
						"value": "325400"
					},
					{
						"text": "苍南县",
						"value": "325800"
					},
					{
						"text": "文成县",
						"value": "325300"
					},
					{
						"text": "泰顺县",
						"value": "325500"
					},
					{
						"text": "瑞安市",
						"value": "325200"
					},
					{
						"text": "乐清市",
						"value": "325600"
					}
				]
			},
			{
				"text": "嘉兴市",
				"value": "314000",
				"children": [
					{
						"text": "南湖区",
						"value": "314051"
					},
					{
						"text": "秀洲区",
						"value": "314031"
					},
					{
						"text": "嘉善县",
						"value": "314100"
					},
					{
						"text": "海盐县",
						"value": "314300"
					},
					{
						"text": "海宁市",
						"value": "314400"
					},
					{
						"text": "平湖市",
						"value": "314200"
					},
					{
						"text": "桐乡市",
						"value": "314500"
					}
				]
			},
			{
				"text": "湖州市",
				"value": "313000",
				"children": [
					{
						"text": "吴兴区",
						"value": "313000"
					},
					{
						"text": "南浔区",
						"value": "313009"
					},
					{
						"text": "德清县",
						"value": "313200"
					},
					{
						"text": "长兴县",
						"value": "313100"
					},
					{
						"text": "安吉县",
						"value": "313300"
					}
				]
			},
			{
				"text": "绍兴市",
				"value": "312000",
				"children": [
					{
						"text": "越城区",
						"value": "312000"
					},
					{
						"text": "柯桥区",
						"value": "312030"
					},
					{
						"text": "上虞区",
						"value": "312300"
					},
					{
						"text": "新昌县",
						"value": "312500"
					},
					{
						"text": "诸暨市",
						"value": "311800"
					},
					{
						"text": "嵊州市",
						"value": "312400"
					}
				]
			},
			{
				"text": "金华市",
				"value": "321000",
				"children": [
					{
						"text": "婺城区",
						"value": "321000"
					},
					{
						"text": "金东区",
						"value": "321000"
					},
					{
						"text": "武义县",
						"value": "321200"
					},
					{
						"text": "浦江县",
						"value": "322200"
					},
					{
						"text": "磐安县",
						"value": "322300"
					},
					{
						"text": "兰溪市",
						"value": "321100"
					},
					{
						"text": "义乌市",
						"value": "322000"
					},
					{
						"text": "东阳市",
						"value": "322100"
					},
					{
						"text": "永康市",
						"value": "321300"
					}
				]
			},
			{
				"text": "衢州市",
				"value": "324002",
				"children": [
					{
						"text": "柯城区",
						"value": "324100"
					},
					{
						"text": "衢江区",
						"value": "324022"
					},
					{
						"text": "常山县",
						"value": "324200"
					},
					{
						"text": "开化县",
						"value": "324300"
					},
					{
						"text": "龙游县",
						"value": "324400"
					},
					{
						"text": "江山市",
						"value": "324100"
					}
				]
			},
			{
				"text": "舟山市",
				"value": "316000",
				"children": [
					{
						"text": "定海区",
						"value": "316000"
					},
					{
						"text": "普陀区",
						"value": "316100"
					},
					{
						"text": "岱山县",
						"value": "316200"
					},
					{
						"text": "嵊泗县",
						"value": "202450"
					}
				]
			},
			{
				"text": "台州市",
				"value": "318000",
				"children": [
					{
						"text": "椒江区",
						"value": "318000"
					},
					{
						"text": "黄岩区",
						"value": "318020"
					},
					{
						"text": "路桥区",
						"value": "318050"
					},
					{
						"text": "玉环县",
						"value": "317600"
					},
					{
						"text": "三门县",
						"value": "317100"
					},
					{
						"text": "天台县",
						"value": "317200"
					},
					{
						"text": "仙居县",
						"value": "317300"
					},
					{
						"text": "温岭市",
						"value": "317500"
					},
					{
						"text": "临海市",
						"value": "317000"
					}
				]
			},
			{
				"text": "丽水市",
				"value": "323000",
				"children": [
					{
						"text": "莲都区",
						"value": "323000"
					},
					{
						"text": "青田县",
						"value": "323900"
					},
					{
						"text": "缙云县",
						"value": "321400"
					},
					{
						"text": "遂昌县",
						"value": "323300"
					},
					{
						"text": "松阳县",
						"value": "323400"
					},
					{
						"text": "云和县",
						"value": "323600"
					},
					{
						"text": "庆元县",
						"value": "323800"
					},
					{
						"text": "景宁畲族自治县",
						"value": "323500"
					},
					{
						"text": "龙泉市",
						"value": "323700"
					}
				]
			},
			{
				"text": "舟山群岛新区",
				"value": "316000",
				"children": [
					{
						"text": "金塘岛",
						"value": "316000"
					},
					{
						"text": "六横岛",
						"value": "316000"
					},
					{
						"text": "衢山岛",
						"value": "316000"
					},
					{
						"text": "舟山本岛西北部",
						"value": "316000"
					},
					{
						"text": "岱山岛西南部",
						"value": "316000"
					},
					{
						"text": "泗礁岛",
						"value": "316000"
					},
					{
						"text": "朱家尖岛",
						"value": "316000"
					},
					{
						"text": "洋山岛",
						"value": "316000"
					},
					{
						"text": "长涂岛",
						"value": "316000"
					},
					{
						"text": "虾峙岛",
						"value": "316000"
					}
				]
			}
		]
	},
	{
		"text": "安徽省",
		"value": "230000",
		"children": [
			{
				"text": "合肥市",
				"value": "230001",
				"children": [
					{
						"text": "瑶海区",
						"value": "230011"
					},
					{
						"text": "庐阳区",
						"value": "230001"
					},
					{
						"text": "蜀山区",
						"value": "230031"
					},
					{
						"text": "包河区",
						"value": "230041"
					},
					{
						"text": "长丰县",
						"value": "231100"
					},
					{
						"text": "肥东县",
						"value": "231600"
					},
					{
						"text": "肥西县",
						"value": "231200"
					},
					{
						"text": "庐江县",
						"value": "231500"
					},
					{
						"text": "巢湖市",
						"value": "238000"
					}
				]
			},
			{
				"text": "芜湖市",
				"value": "241000",
				"children": [
					{
						"text": "镜湖区",
						"value": "241000"
					},
					{
						"text": "弋江区",
						"value": "241000"
					},
					{
						"text": "鸠江区",
						"value": "241000"
					},
					{
						"text": "三山区",
						"value": "241000"
					},
					{
						"text": "芜湖县",
						"value": "241100"
					},
					{
						"text": "繁昌县",
						"value": "241200"
					},
					{
						"text": "南陵县",
						"value": "242400"
					},
					{
						"text": "无为县",
						"value": "238300"
					}
				]
			},
			{
				"text": "蚌埠市",
				"value": "233000",
				"children": [
					{
						"text": "龙子湖区",
						"value": "233000"
					},
					{
						"text": "蚌山区",
						"value": "233000"
					},
					{
						"text": "禹会区",
						"value": "233010"
					},
					{
						"text": "淮上区",
						"value": "233002"
					},
					{
						"text": "怀远县",
						"value": "233400"
					},
					{
						"text": "五河县",
						"value": "233300"
					},
					{
						"text": "固镇县",
						"value": "233700"
					}
				]
			},
			{
				"text": "淮南市",
				"value": "232001",
				"children": [
					{
						"text": "大通区",
						"value": "232033"
					},
					{
						"text": "田家庵区",
						"value": "232000"
					},
					{
						"text": "谢家集区",
						"value": "232052"
					},
					{
						"text": "八公山区",
						"value": "232072"
					},
					{
						"text": "潘集区",
						"value": "232082"
					},
					{
						"text": "凤台县",
						"value": "232100"
					}
				]
			},
			{
				"text": "马鞍山市",
				"value": "243001",
				"children": [
					{
						"text": "花山区",
						"value": "243000"
					},
					{
						"text": "雨山区",
						"value": "243071"
					},
					{
						"text": "博望区",
						"value": "243131"
					},
					{
						"text": "当涂县",
						"value": "243100"
					},
					{
						"text": "含山县",
						"value": "238100"
					},
					{
						"text": "和县",
						"value": "238200"
					}
				]
			},
			{
				"text": "淮北市",
				"value": "235000",
				"children": [
					{
						"text": "杜集区",
						"value": "235000"
					},
					{
						"text": "相山区",
						"value": "235000"
					},
					{
						"text": "烈山区",
						"value": "235000"
					},
					{
						"text": "濉溪县",
						"value": "235100"
					}
				]
			},
			{
				"text": "铜陵市",
				"value": "244000",
				"children": [
					{
						"text": "铜官山区",
						"value": "244000"
					},
					{
						"text": "狮子山区",
						"value": "244000"
					},
					{
						"text": "郊区",
						"value": "244000"
					},
					{
						"text": "铜陵县",
						"value": "244100"
					}
				]
			},
			{
				"text": "安庆市",
				"value": "246001",
				"children": [
					{
						"text": "迎江区",
						"value": "246001"
					},
					{
						"text": "大观区",
						"value": "246002"
					},
					{
						"text": "宜秀区",
						"value": "246003"
					},
					{
						"text": "怀宁县",
						"value": "246100"
					},
					{
						"text": "枞阳县",
						"value": "246700"
					},
					{
						"text": "潜山县",
						"value": "246300"
					},
					{
						"text": "太湖县",
						"value": "246400"
					},
					{
						"text": "宿松县",
						"value": "246500"
					},
					{
						"text": "望江县",
						"value": "246200"
					},
					{
						"text": "岳西县",
						"value": "246600"
					},
					{
						"text": "桐城市",
						"value": "231400"
					}
				]
			},
			{
				"text": "黄山市",
				"value": "245000",
				"children": [
					{
						"text": "屯溪区",
						"value": "245000"
					},
					{
						"text": "黄山区",
						"value": "242700"
					},
					{
						"text": "徽州区",
						"value": "245061"
					},
					{
						"text": "歙县",
						"value": "245200"
					},
					{
						"text": "休宁县",
						"value": "245400"
					},
					{
						"text": "黟县",
						"value": "245500"
					},
					{
						"text": "祁门县",
						"value": "245600"
					}
				]
			},
			{
				"text": "滁州市",
				"value": "239000",
				"children": [
					{
						"text": "琅琊区",
						"value": "239000"
					},
					{
						"text": "南谯区",
						"value": "239000"
					},
					{
						"text": "来安县",
						"value": "239200"
					},
					{
						"text": "全椒县",
						"value": "239500"
					},
					{
						"text": "定远县",
						"value": "233200"
					},
					{
						"text": "凤阳县",
						"value": "233100"
					},
					{
						"text": "天长市",
						"value": "239300"
					},
					{
						"text": "明光市",
						"value": "239400"
					}
				]
			},
			{
				"text": "阜阳市",
				"value": "236033",
				"children": [
					{
						"text": "颍州区",
						"value": "236001"
					},
					{
						"text": "颍东区",
						"value": "236058"
					},
					{
						"text": "颍泉区",
						"value": "236045"
					},
					{
						"text": "临泉县",
						"value": "236400"
					},
					{
						"text": "太和县",
						"value": "236600"
					},
					{
						"text": "阜南县",
						"value": "236300"
					},
					{
						"text": "颍上县",
						"value": "236200"
					},
					{
						"text": "界首市",
						"value": "236500"
					}
				]
			},
			{
				"text": "宿州市",
				"value": "234000",
				"children": [
					{
						"text": "埇桥区",
						"value": "234000"
					},
					{
						"text": "砀山县",
						"value": "235300"
					},
					{
						"text": "萧县",
						"value": "235200"
					},
					{
						"text": "灵璧县",
						"value": "234200"
					},
					{
						"text": "泗县",
						"value": "234300"
					}
				]
			},
			{
				"text": "六安市",
				"value": "237000",
				"children": [
					{
						"text": "金安区",
						"value": "237005"
					},
					{
						"text": "裕安区",
						"value": "237010"
					},
					{
						"text": "寿县",
						"value": "232200"
					},
					{
						"text": "霍邱县",
						"value": "237400"
					},
					{
						"text": "舒城县",
						"value": "231300"
					},
					{
						"text": "金寨县",
						"value": "237300"
					},
					{
						"text": "霍山县",
						"value": "237200"
					}
				]
			},
			{
				"text": "亳州市",
				"value": "236802",
				"children": [
					{
						"text": "谯城区",
						"value": "236800"
					},
					{
						"text": "涡阳县",
						"value": "233600"
					},
					{
						"text": "蒙城县",
						"value": "233500"
					},
					{
						"text": "利辛县",
						"value": "236700"
					}
				]
			},
			{
				"text": "池州市",
				"value": "247100",
				"children": [
					{
						"text": "贵池区",
						"value": "247100"
					},
					{
						"text": "东至县",
						"value": "247200"
					},
					{
						"text": "石台县",
						"value": "245100"
					},
					{
						"text": "青阳县",
						"value": "242800"
					}
				]
			},
			{
				"text": "宣城市",
				"value": "242000",
				"children": [
					{
						"text": "宣州区",
						"value": "242000"
					},
					{
						"text": "郎溪县",
						"value": "242100"
					},
					{
						"text": "广德县",
						"value": "242200"
					},
					{
						"text": "泾县",
						"value": "242500"
					},
					{
						"text": "绩溪县",
						"value": "245300"
					},
					{
						"text": "旌德县",
						"value": "242600"
					},
					{
						"text": "宁国市",
						"value": "242300"
					}
				]
			}
		]
	},
	{
		"text": "福建省",
		"value": "350000",
		"children": [
			{
				"text": "福州市",
				"value": "350001",
				"children": [
					{
						"text": "鼓楼区",
						"value": "350001"
					},
					{
						"text": "台江区",
						"value": "350004"
					},
					{
						"text": "仓山区",
						"value": "350007"
					},
					{
						"text": "马尾区",
						"value": "350015"
					},
					{
						"text": "晋安区",
						"value": "350011"
					},
					{
						"text": "闽侯县",
						"value": "350100"
					},
					{
						"text": "连江县",
						"value": "350500"
					},
					{
						"text": "罗源县",
						"value": "350600"
					},
					{
						"text": "闽清县",
						"value": "350800"
					},
					{
						"text": "永泰县",
						"value": "350700"
					},
					{
						"text": "平潭县",
						"value": "350400"
					},
					{
						"text": "福清市",
						"value": "350300"
					},
					{
						"text": "长乐市",
						"value": "350200"
					}
				]
			},
			{
				"text": "厦门市",
				"value": "361003",
				"children": [
					{
						"text": "思明区",
						"value": "361001"
					},
					{
						"text": "海沧区",
						"value": "361026"
					},
					{
						"text": "湖里区",
						"value": "361006"
					},
					{
						"text": "集美区",
						"value": "361021"
					},
					{
						"text": "同安区",
						"value": "361100"
					},
					{
						"text": "翔安区",
						"value": "361101"
					}
				]
			},
			{
				"text": "莆田市",
				"value": "351100",
				"children": [
					{
						"text": "城厢区",
						"value": "351100"
					},
					{
						"text": "涵江区",
						"value": "351111"
					},
					{
						"text": "荔城区",
						"value": "351100"
					},
					{
						"text": "秀屿区",
						"value": "351152"
					},
					{
						"text": "仙游县",
						"value": "351200"
					}
				]
			},
			{
				"text": "三明市",
				"value": "365000",
				"children": [
					{
						"text": "梅列区",
						"value": "365000"
					},
					{
						"text": "三元区",
						"value": "365001"
					},
					{
						"text": "明溪县",
						"value": "365200"
					},
					{
						"text": "清流县",
						"value": "365300"
					},
					{
						"text": "宁化县",
						"value": "365400"
					},
					{
						"text": "大田县",
						"value": "366100"
					},
					{
						"text": "尤溪县",
						"value": "365100"
					},
					{
						"text": "沙县",
						"value": "365500"
					},
					{
						"text": "将乐县",
						"value": "353300"
					},
					{
						"text": "泰宁县",
						"value": "354400"
					},
					{
						"text": "建宁县",
						"value": "354500"
					},
					{
						"text": "永安市",
						"value": "366000"
					}
				]
			},
			{
				"text": "泉州市",
				"value": "362000",
				"children": [
					{
						"text": "鲤城区",
						"value": "362000"
					},
					{
						"text": "丰泽区",
						"value": "362000"
					},
					{
						"text": "洛江区",
						"value": "362011"
					},
					{
						"text": "泉港区",
						"value": "362114"
					},
					{
						"text": "惠安县",
						"value": "362100"
					},
					{
						"text": "安溪县",
						"value": "362400"
					},
					{
						"text": "永春县",
						"value": "362600"
					},
					{
						"text": "德化县",
						"value": "362500"
					},
					{
						"text": "金门县",
						"value": ""
					},
					{
						"text": "石狮市",
						"value": "362700"
					},
					{
						"text": "晋江市",
						"value": "362200"
					},
					{
						"text": "南安市",
						"value": "362300"
					}
				]
			},
			{
				"text": "漳州市",
				"value": "363005",
				"children": [
					{
						"text": "芗城区",
						"value": "363000"
					},
					{
						"text": "龙文区",
						"value": "363005"
					},
					{
						"text": "云霄县",
						"value": "363300"
					},
					{
						"text": "漳浦县",
						"value": "363200"
					},
					{
						"text": "诏安县",
						"value": "363500"
					},
					{
						"text": "长泰县",
						"value": "363900"
					},
					{
						"text": "东山县",
						"value": "363400"
					},
					{
						"text": "南靖县",
						"value": "363600"
					},
					{
						"text": "平和县",
						"value": "363700"
					},
					{
						"text": "华安县",
						"value": "363800"
					},
					{
						"text": "龙海市",
						"value": "363100"
					}
				]
			},
			{
				"text": "南平市",
				"value": "353000",
				"children": [
					{
						"text": "延平区",
						"value": "353000"
					},
					{
						"text": "建阳区",
						"value": "354200"
					},
					{
						"text": "顺昌县",
						"value": "353200"
					},
					{
						"text": "浦城县",
						"value": "353400"
					},
					{
						"text": "光泽县",
						"value": "354100"
					},
					{
						"text": "松溪县",
						"value": "353500"
					},
					{
						"text": "政和县",
						"value": "353600"
					},
					{
						"text": "邵武市",
						"value": "354000"
					},
					{
						"text": "武夷山市",
						"value": "354300"
					},
					{
						"text": "建瓯市",
						"value": "353100"
					}
				]
			},
			{
				"text": "龙岩市",
				"value": "364000",
				"children": [
					{
						"text": "新罗区",
						"value": "364000"
					},
					{
						"text": "长汀县",
						"value": "366300"
					},
					{
						"text": "永定区",
						"value": "364100"
					},
					{
						"text": "上杭县",
						"value": "364200"
					},
					{
						"text": "武平县",
						"value": "364300"
					},
					{
						"text": "连城县",
						"value": "366200"
					},
					{
						"text": "漳平市",
						"value": "364400"
					}
				]
			},
			{
				"text": "宁德市",
				"value": "352100",
				"children": [
					{
						"text": "蕉城区",
						"value": "352100"
					},
					{
						"text": "霞浦县",
						"value": "355100"
					},
					{
						"text": "古田县",
						"value": "352200"
					},
					{
						"text": "屏南县",
						"value": "352300"
					},
					{
						"text": "寿宁县",
						"value": "355500"
					},
					{
						"text": "周宁县",
						"value": "355400"
					},
					{
						"text": "柘荣县",
						"value": "355300"
					},
					{
						"text": "福安市",
						"value": "355000"
					},
					{
						"text": "福鼎市",
						"value": "355200"
					}
				]
			}
		]
	},
	{
		"text": "江西省",
		"value": "330000",
		"children": [
			{
				"text": "南昌市",
				"value": "330008",
				"children": [
					{
						"text": "东湖区",
						"value": "330006"
					},
					{
						"text": "西湖区",
						"value": "330009"
					},
					{
						"text": "青云谱区",
						"value": "330001"
					},
					{
						"text": "湾里区",
						"value": "330004"
					},
					{
						"text": "青山湖区",
						"value": "330029"
					},
					{
						"text": "南昌县",
						"value": "330200"
					},
					{
						"text": "新建县",
						"value": "330100"
					},
					{
						"text": "安义县",
						"value": "330500"
					},
					{
						"text": "进贤县",
						"value": "331700"
					}
				]
			},
			{
				"text": "景德镇市",
				"value": "333000",
				"children": [
					{
						"text": "昌江区",
						"value": "333000"
					},
					{
						"text": "珠山区",
						"value": "333000"
					},
					{
						"text": "浮梁县",
						"value": "333400"
					},
					{
						"text": "乐平市",
						"value": "333300"
					}
				]
			},
			{
				"text": "萍乡市",
				"value": "337000",
				"children": [
					{
						"text": "安源区",
						"value": "337000"
					},
					{
						"text": "湘东区",
						"value": "337016"
					},
					{
						"text": "莲花县",
						"value": "337100"
					},
					{
						"text": "上栗县",
						"value": "337009"
					},
					{
						"text": "芦溪县",
						"value": "337053"
					}
				]
			},
			{
				"text": "九江市",
				"value": "332000",
				"children": [
					{
						"text": "庐山区",
						"value": "332005"
					},
					{
						"text": "浔阳区",
						"value": "332000"
					},
					{
						"text": "九江县",
						"value": "332100"
					},
					{
						"text": "武宁县",
						"value": "332300"
					},
					{
						"text": "修水县",
						"value": "332400"
					},
					{
						"text": "永修县",
						"value": "330300"
					},
					{
						"text": "德安县",
						"value": "330400"
					},
					{
						"text": "星子县",
						"value": "332800"
					},
					{
						"text": "都昌县",
						"value": "332600"
					},
					{
						"text": "湖口县",
						"value": "332500"
					},
					{
						"text": "彭泽县",
						"value": "332700"
					},
					{
						"text": "瑞昌市",
						"value": "332200"
					},
					{
						"text": "共青城市",
						"value": "332020"
					}
				]
			},
			{
				"text": "新余市",
				"value": "338025",
				"children": [
					{
						"text": "渝水区",
						"value": "338025"
					},
					{
						"text": "分宜县",
						"value": "336600"
					}
				]
			},
			{
				"text": "鹰潭市",
				"value": "335000",
				"children": [
					{
						"text": "月湖区",
						"value": "335000"
					},
					{
						"text": "余江县",
						"value": "335200"
					},
					{
						"text": "贵溪市",
						"value": "335400"
					}
				]
			},
			{
				"text": "赣州市",
				"value": "341000",
				"children": [
					{
						"text": "章贡区",
						"value": "341000"
					},
					{
						"text": "南康区",
						"value": "341400"
					},
					{
						"text": "赣县",
						"value": "341100"
					},
					{
						"text": "信丰县",
						"value": "341600"
					},
					{
						"text": "大余县",
						"value": "341500"
					},
					{
						"text": "上犹县",
						"value": "341200"
					},
					{
						"text": "崇义县",
						"value": "341300"
					},
					{
						"text": "安远县",
						"value": "342100"
					},
					{
						"text": "龙南县",
						"value": "341700"
					},
					{
						"text": "定南县",
						"value": "341900"
					},
					{
						"text": "全南县",
						"value": "341800"
					},
					{
						"text": "宁都县",
						"value": "342800"
					},
					{
						"text": "于都县",
						"value": "342300"
					},
					{
						"text": "兴国县",
						"value": "342400"
					},
					{
						"text": "会昌县",
						"value": "342600"
					},
					{
						"text": "寻乌县",
						"value": "342200"
					},
					{
						"text": "石城县",
						"value": "342700"
					},
					{
						"text": "瑞金市",
						"value": "342500"
					}
				]
			},
			{
				"text": "吉安市",
				"value": "343000",
				"children": [
					{
						"text": "吉州区",
						"value": "343000"
					},
					{
						"text": "青原区",
						"value": "343009"
					},
					{
						"text": "吉安县",
						"value": "343100"
					},
					{
						"text": "吉水县",
						"value": "331600"
					},
					{
						"text": "峡江县",
						"value": "331409"
					},
					{
						"text": "新干县",
						"value": "331300"
					},
					{
						"text": "永丰县",
						"value": "331500"
					},
					{
						"text": "泰和县",
						"value": "343700"
					},
					{
						"text": "遂川县",
						"value": "343900"
					},
					{
						"text": "万安县",
						"value": "343800"
					},
					{
						"text": "安福县",
						"value": "343200"
					},
					{
						"text": "永新县",
						"value": "343400"
					},
					{
						"text": "井冈山市",
						"value": "343600"
					}
				]
			},
			{
				"text": "宜春市",
				"value": "336000",
				"children": [
					{
						"text": "袁州区",
						"value": "336000"
					},
					{
						"text": "奉新县",
						"value": "330700"
					},
					{
						"text": "万载县",
						"value": "336100"
					},
					{
						"text": "上高县",
						"value": "336400"
					},
					{
						"text": "宜丰县",
						"value": "336300"
					},
					{
						"text": "靖安县",
						"value": "330600"
					},
					{
						"text": "铜鼓县",
						"value": "336200"
					},
					{
						"text": "丰城市",
						"value": "331100"
					},
					{
						"text": "樟树市",
						"value": "331200"
					},
					{
						"text": "高安市",
						"value": "330800"
					}
				]
			},
			{
				"text": "抚州市",
				"value": "344000",
				"children": [
					{
						"text": "临川区",
						"value": "344000"
					},
					{
						"text": "南城县",
						"value": "344700"
					},
					{
						"text": "黎川县",
						"value": "344600"
					},
					{
						"text": "南丰县",
						"value": "344500"
					},
					{
						"text": "崇仁县",
						"value": "344200"
					},
					{
						"text": "乐安县",
						"value": "344300"
					},
					{
						"text": "宜黄县",
						"value": "344400"
					},
					{
						"text": "金溪县",
						"value": "344800"
					},
					{
						"text": "资溪县",
						"value": "335300"
					},
					{
						"text": "东乡县",
						"value": "331800"
					},
					{
						"text": "广昌县",
						"value": "344900"
					}
				]
			},
			{
				"text": "上饶市",
				"value": "334000",
				"children": [
					{
						"text": "信州区",
						"value": "334000"
					},
					{
						"text": "上饶县",
						"value": "334100"
					},
					{
						"text": "广丰县",
						"value": "334600"
					},
					{
						"text": "玉山县",
						"value": "334700"
					},
					{
						"text": "铅山县",
						"value": "334500"
					},
					{
						"text": "横峰县",
						"value": "334300"
					},
					{
						"text": "弋阳县",
						"value": "334400"
					},
					{
						"text": "余干县",
						"value": "335100"
					},
					{
						"text": "鄱阳县",
						"value": "333100"
					},
					{
						"text": "万年县",
						"value": "335500"
					},
					{
						"text": "婺源县",
						"value": "333200"
					},
					{
						"text": "德兴市",
						"value": "334200"
					}
				]
			}
		]
	},
	{
		"text": "山东省",
		"value": "250000",
		"children": [
			{
				"text": "济南市",
				"value": "250001",
				"children": [
					{
						"text": "历下区",
						"value": "250014"
					},
					{
						"text": "市中区",
						"value": "250001"
					},
					{
						"text": "槐荫区",
						"value": "250117"
					},
					{
						"text": "天桥区",
						"value": "250031"
					},
					{
						"text": "历城区",
						"value": "250100"
					},
					{
						"text": "长清区",
						"value": "250300"
					},
					{
						"text": "平阴县",
						"value": "250400"
					},
					{
						"text": "济阳县",
						"value": "251400"
					},
					{
						"text": "商河县",
						"value": "251600"
					},
					{
						"text": "章丘市",
						"value": "250200"
					}
				]
			},
			{
				"text": "青岛市",
				"value": "266001",
				"children": [
					{
						"text": "市南区",
						"value": "266001"
					},
					{
						"text": "市北区",
						"value": "266011"
					},
					{
						"text": "黄岛区",
						"value": "266500"
					},
					{
						"text": "崂山区",
						"value": "266100"
					},
					{
						"text": "李沧区",
						"value": "266021"
					},
					{
						"text": "城阳区",
						"value": "266041"
					},
					{
						"text": "胶州市",
						"value": "266300"
					},
					{
						"text": "即墨市",
						"value": "266200"
					},
					{
						"text": "平度市",
						"value": "266700"
					},
					{
						"text": "莱西市",
						"value": "266600"
					},
					{
						"text": "西海岸新区",
						"value": "266500"
					}
				]
			},
			{
				"text": "淄博市",
				"value": "255039",
				"children": [
					{
						"text": "淄川区",
						"value": "255100"
					},
					{
						"text": "张店区",
						"value": "255022"
					},
					{
						"text": "博山区",
						"value": "255200"
					},
					{
						"text": "临淄区",
						"value": "255400"
					},
					{
						"text": "周村区",
						"value": "255300"
					},
					{
						"text": "桓台县",
						"value": "256400"
					},
					{
						"text": "高青县",
						"value": "256300"
					},
					{
						"text": "沂源县",
						"value": "256100"
					}
				]
			},
			{
				"text": "枣庄市",
				"value": "277101",
				"children": [
					{
						"text": "市中区",
						"value": "277101"
					},
					{
						"text": "薛城区",
						"value": "277000"
					},
					{
						"text": "峄城区",
						"value": "277300"
					},
					{
						"text": "台儿庄区",
						"value": "277400"
					},
					{
						"text": "山亭区",
						"value": "277200"
					},
					{
						"text": "滕州市",
						"value": "277500"
					}
				]
			},
			{
				"text": "东营市",
				"value": "257093",
				"children": [
					{
						"text": "东营区",
						"value": "257029"
					},
					{
						"text": "河口区",
						"value": "257200"
					},
					{
						"text": "垦利县",
						"value": "257500"
					},
					{
						"text": "利津县",
						"value": "257400"
					},
					{
						"text": "广饶县",
						"value": "257300"
					}
				]
			},
			{
				"text": "烟台市",
				"value": "264010",
				"children": [
					{
						"text": "芝罘区",
						"value": "264001"
					},
					{
						"text": "福山区",
						"value": "265500"
					},
					{
						"text": "牟平区",
						"value": "264100"
					},
					{
						"text": "莱山区",
						"value": "264600"
					},
					{
						"text": "长岛县",
						"value": "265800"
					},
					{
						"text": "龙口市",
						"value": "265700"
					},
					{
						"text": "莱阳市",
						"value": "265200"
					},
					{
						"text": "莱州市",
						"value": "261400"
					},
					{
						"text": "蓬莱市",
						"value": "265600"
					},
					{
						"text": "招远市",
						"value": "265400"
					},
					{
						"text": "栖霞市",
						"value": "265300"
					},
					{
						"text": "海阳市",
						"value": "265100"
					}
				]
			},
			{
				"text": "潍坊市",
				"value": "261041",
				"children": [
					{
						"text": "潍城区",
						"value": "261021"
					},
					{
						"text": "寒亭区",
						"value": "261100"
					},
					{
						"text": "坊子区",
						"value": "261200"
					},
					{
						"text": "奎文区",
						"value": "261031"
					},
					{
						"text": "临朐县",
						"value": "262600"
					},
					{
						"text": "昌乐县",
						"value": "262400"
					},
					{
						"text": "青州市",
						"value": "262500"
					},
					{
						"text": "诸城市",
						"value": "262200"
					},
					{
						"text": "寿光市",
						"value": "262700"
					},
					{
						"text": "安丘市",
						"value": "262100"
					},
					{
						"text": "高密市",
						"value": "261500"
					},
					{
						"text": "昌邑市",
						"value": "261300"
					}
				]
			},
			{
				"text": "济宁市",
				"value": "272119",
				"children": [
					{
						"text": "任城区",
						"value": "272113"
					},
					{
						"text": "兖州区",
						"value": "272000"
					},
					{
						"text": "微山县",
						"value": "277600"
					},
					{
						"text": "鱼台县",
						"value": "272300"
					},
					{
						"text": "金乡县",
						"value": "272200"
					},
					{
						"text": "嘉祥县",
						"value": "272400"
					},
					{
						"text": "汶上县",
						"value": "272501"
					},
					{
						"text": "泗水县",
						"value": "273200"
					},
					{
						"text": "梁山县",
						"value": "272600"
					},
					{
						"text": "曲阜市",
						"value": "273100"
					},
					{
						"text": "邹城市",
						"value": "273500"
					}
				]
			},
			{
				"text": "泰安市",
				"value": "271000",
				"children": [
					{
						"text": "泰山区",
						"value": "271000"
					},
					{
						"text": "岱岳区",
						"value": "271000"
					},
					{
						"text": "宁阳县",
						"value": "271400"
					},
					{
						"text": "东平县",
						"value": "271500"
					},
					{
						"text": "新泰市",
						"value": "271200"
					},
					{
						"text": "肥城市",
						"value": "271600"
					}
				]
			},
			{
				"text": "威海市",
				"value": "264200",
				"children": [
					{
						"text": "环翠区",
						"value": "264200"
					},
					{
						"text": "文登区",
						"value": "266440"
					},
					{
						"text": "荣成市",
						"value": "264300"
					},
					{
						"text": "乳山市",
						"value": "264500"
					}
				]
			},
			{
				"text": "日照市",
				"value": "276800",
				"children": [
					{
						"text": "东港区",
						"value": "276800"
					},
					{
						"text": "岚山区",
						"value": "276808"
					},
					{
						"text": "五莲县",
						"value": "262300"
					},
					{
						"text": "莒县",
						"value": "276500"
					}
				]
			},
			{
				"text": "莱芜市",
				"value": "271100",
				"children": [
					{
						"text": "莱城区",
						"value": "271199"
					},
					{
						"text": "钢城区",
						"value": "271100"
					}
				]
			},
			{
				"text": "临沂市",
				"value": "253000",
				"children": [
					{
						"text": "兰山区",
						"value": "276002"
					},
					{
						"text": "罗庄区",
						"value": "276022"
					},
					{
						"text": "河东区",
						"value": "276034"
					},
					{
						"text": "沂南县",
						"value": "276300"
					},
					{
						"text": "郯城县",
						"value": "276100"
					},
					{
						"text": "沂水县",
						"value": "276400"
					},
					{
						"text": "兰陵县",
						"value": "277700"
					},
					{
						"text": "费县",
						"value": "273400"
					},
					{
						"text": "平邑县",
						"value": "273300"
					},
					{
						"text": "莒南县",
						"value": "276600"
					},
					{
						"text": "蒙阴县",
						"value": "276200"
					},
					{
						"text": "临沭县",
						"value": "276700"
					}
				]
			},
			{
				"text": "德州市",
				"value": "253000",
				"children": [
					{
						"text": "德城区",
						"value": "253012"
					},
					{
						"text": "陵城区",
						"value": "253500"
					},
					{
						"text": "宁津县",
						"value": "253400"
					},
					{
						"text": "庆云县",
						"value": "253700"
					},
					{
						"text": "临邑县",
						"value": "251500"
					},
					{
						"text": "齐河县",
						"value": "251100"
					},
					{
						"text": "平原县",
						"value": "253100"
					},
					{
						"text": "夏津县",
						"value": "253200"
					},
					{
						"text": "武城县",
						"value": "253300"
					},
					{
						"text": "乐陵市",
						"value": "253600"
					},
					{
						"text": "禹城市",
						"value": "251200"
					}
				]
			},
			{
				"text": "聊城市",
				"value": "252052",
				"children": [
					{
						"text": "东昌府区",
						"value": "252000"
					},
					{
						"text": "阳谷县",
						"value": "252300"
					},
					{
						"text": "莘县",
						"value": "252400"
					},
					{
						"text": "茌平县",
						"value": "252100"
					},
					{
						"text": "东阿县",
						"value": "252200"
					},
					{
						"text": "冠县",
						"value": "252500"
					},
					{
						"text": "高唐县",
						"value": "252800"
					},
					{
						"text": "临清市",
						"value": "252600"
					}
				]
			},
			{
				"text": "滨州市",
				"value": "256619",
				"children": [
					{
						"text": "滨城区",
						"value": "256613"
					},
					{
						"text": "沾化区",
						"value": "256800"
					},
					{
						"text": "惠民县",
						"value": "251700"
					},
					{
						"text": "阳信县",
						"value": "251800"
					},
					{
						"text": "无棣县",
						"value": "251900"
					},
					{
						"text": "博兴县",
						"value": "256500"
					},
					{
						"text": "邹平县",
						"value": "256200"
					},
					{
						"text": "北海新区",
						"value": "256200"
					}
				]
			},
			{
				"text": "菏泽市",
				"value": "274020",
				"children": [
					{
						"text": "牡丹区",
						"value": "274009"
					},
					{
						"text": "曹县",
						"value": "274400"
					},
					{
						"text": "单县",
						"value": "273700"
					},
					{
						"text": "成武县",
						"value": "274200"
					},
					{
						"text": "巨野县",
						"value": "274900"
					},
					{
						"text": "郓城县",
						"value": "274700"
					},
					{
						"text": "鄄城县",
						"value": "274600"
					},
					{
						"text": "定陶县",
						"value": "274100"
					},
					{
						"text": "东明县",
						"value": "274500"
					}
				]
			}
		]
	},
	{
		"text": "河南省",
		"value": "450000",
		"children": [
			{
				"text": "郑州市",
				"value": "450000",
				"children": [
					{
						"text": "中原区",
						"value": "450007"
					},
					{
						"text": "二七区",
						"value": "450052"
					},
					{
						"text": "管城回族区",
						"value": "450000"
					},
					{
						"text": "金水区",
						"value": "450003"
					},
					{
						"text": "上街区",
						"value": "450041"
					},
					{
						"text": "惠济区",
						"value": "450053"
					},
					{
						"text": "中牟县",
						"value": "451450"
					},
					{
						"text": "巩义市",
						"value": "451200"
					},
					{
						"text": "荥阳市",
						"value": "450100"
					},
					{
						"text": "新密市",
						"value": "452300"
					},
					{
						"text": "新郑市",
						"value": "451100"
					},
					{
						"text": "登封市",
						"value": "452470"
					}
				]
			},
			{
				"text": "开封市",
				"value": "475001",
				"children": [
					{
						"text": "龙亭区",
						"value": "475100"
					},
					{
						"text": "顺河回族区",
						"value": "475000"
					},
					{
						"text": "鼓楼区",
						"value": "475000"
					},
					{
						"text": "禹王台区",
						"value": "475003"
					},
					{
						"text": "祥符区",
						"value": "475100"
					},
					{
						"text": "杞县",
						"value": "475200"
					},
					{
						"text": "通许县",
						"value": "475400"
					},
					{
						"text": "尉氏县",
						"value": "475500"
					},
					{
						"text": "兰考县",
						"value": "475300"
					}
				]
			},
			{
				"text": "洛阳市",
				"value": "471000",
				"children": [
					{
						"text": "老城区",
						"value": "471002"
					},
					{
						"text": "西工区",
						"value": "471000"
					},
					{
						"text": "瀍河回族区",
						"value": "471002"
					},
					{
						"text": "涧西区",
						"value": "471003"
					},
					{
						"text": "吉利区",
						"value": "471012"
					},
					{
						"text": "洛龙区",
						"value": "471000"
					},
					{
						"text": "孟津县",
						"value": "471100"
					},
					{
						"text": "新安县",
						"value": "471800"
					},
					{
						"text": "栾川县",
						"value": "471500"
					},
					{
						"text": "嵩县",
						"value": "471400"
					},
					{
						"text": "汝阳县",
						"value": "471200"
					},
					{
						"text": "宜阳县",
						"value": "471600"
					},
					{
						"text": "洛宁县",
						"value": "471700"
					},
					{
						"text": "伊川县",
						"value": "471300"
					},
					{
						"text": "偃师市",
						"value": "471900"
					}
				]
			},
			{
				"text": "平顶山市",
				"value": "467000",
				"children": [
					{
						"text": "新华区",
						"value": "467002"
					},
					{
						"text": "卫东区",
						"value": "467021"
					},
					{
						"text": "石龙区",
						"value": "467045"
					},
					{
						"text": "湛河区",
						"value": "467000"
					},
					{
						"text": "宝丰县",
						"value": "467400"
					},
					{
						"text": "叶县",
						"value": "467200"
					},
					{
						"text": "鲁山县",
						"value": "467300"
					},
					{
						"text": "郏县",
						"value": "467100"
					},
					{
						"text": "舞钢市",
						"value": "462500"
					},
					{
						"text": "汝州市",
						"value": "467500"
					}
				]
			},
			{
				"text": "安阳市",
				"value": "455000",
				"children": [
					{
						"text": "文峰区",
						"value": "455000"
					},
					{
						"text": "北关区",
						"value": "455001"
					},
					{
						"text": "殷都区",
						"value": "455004"
					},
					{
						"text": "龙安区",
						"value": "455001"
					},
					{
						"text": "安阳县",
						"value": "455000"
					},
					{
						"text": "汤阴县",
						"value": "456150"
					},
					{
						"text": "滑县",
						"value": "456400"
					},
					{
						"text": "内黄县",
						"value": "456350"
					},
					{
						"text": "林州市",
						"value": "456550"
					}
				]
			},
			{
				"text": "鹤壁市",
				"value": "458030",
				"children": [
					{
						"text": "鹤山区",
						"value": "458010"
					},
					{
						"text": "山城区",
						"value": "458000"
					},
					{
						"text": "淇滨区",
						"value": "458000"
					},
					{
						"text": "浚县",
						"value": "456250"
					},
					{
						"text": "淇县",
						"value": "456750"
					}
				]
			},
			{
				"text": "新乡市",
				"value": "453000",
				"children": [
					{
						"text": "红旗区",
						"value": "453000"
					},
					{
						"text": "卫滨区",
						"value": "453000"
					},
					{
						"text": "凤泉区",
						"value": "453011"
					},
					{
						"text": "牧野区",
						"value": "453002"
					},
					{
						"text": "新乡县",
						"value": "453700"
					},
					{
						"text": "获嘉县",
						"value": "453800"
					},
					{
						"text": "原阳县",
						"value": "453500"
					},
					{
						"text": "延津县",
						"value": "453200"
					},
					{
						"text": "封丘县",
						"value": "453300"
					},
					{
						"text": "长垣县",
						"value": "453400"
					},
					{
						"text": "卫辉市",
						"value": "453100"
					},
					{
						"text": "辉县市",
						"value": "453600"
					}
				]
			},
			{
				"text": "焦作市",
				"value": "454002",
				"children": [
					{
						"text": "解放区",
						"value": "454000"
					},
					{
						"text": "中站区",
						"value": "454191"
					},
					{
						"text": "马村区",
						"value": "454171"
					},
					{
						"text": "山阳区",
						"value": "454002"
					},
					{
						"text": "修武县",
						"value": "454350"
					},
					{
						"text": "博爱县",
						"value": "454450"
					},
					{
						"text": "武陟县",
						"value": "454950"
					},
					{
						"text": "温县",
						"value": "454850"
					},
					{
						"text": "沁阳市",
						"value": "454550"
					},
					{
						"text": "孟州市",
						"value": "454750"
					}
				]
			},
			{
				"text": "濮阳市",
				"value": "457000",
				"children": [
					{
						"text": "华龙区",
						"value": "457001"
					},
					{
						"text": "清丰县",
						"value": "457300"
					},
					{
						"text": "南乐县",
						"value": "457400"
					},
					{
						"text": "范县",
						"value": "457500"
					},
					{
						"text": "台前县",
						"value": "457600"
					},
					{
						"text": "濮阳县",
						"value": "457100"
					}
				]
			},
			{
				"text": "许昌市",
				"value": "461000",
				"children": [
					{
						"text": "魏都区",
						"value": "461000"
					},
					{
						"text": "许昌县",
						"value": "461100"
					},
					{
						"text": "鄢陵县",
						"value": "461200"
					},
					{
						"text": "襄城县",
						"value": "461700"
					},
					{
						"text": "禹州市",
						"value": "461670"
					},
					{
						"text": "长葛市",
						"value": "461500"
					}
				]
			},
			{
				"text": "漯河市",
				"value": "462000",
				"children": [
					{
						"text": "源汇区",
						"value": "462000"
					},
					{
						"text": "郾城区",
						"value": "462300"
					},
					{
						"text": "召陵区",
						"value": "462300"
					},
					{
						"text": "舞阳县",
						"value": "462400"
					},
					{
						"text": "临颍县",
						"value": "462600"
					}
				]
			},
			{
				"text": "三门峡市",
				"value": "472000",
				"children": [
					{
						"text": "湖滨区",
						"value": "472000"
					},
					{
						"text": "渑池县",
						"value": "472400"
					},
					{
						"text": "陕县",
						"value": "472100"
					},
					{
						"text": "卢氏县",
						"value": "472200"
					},
					{
						"text": "义马市",
						"value": "472300"
					},
					{
						"text": "灵宝市",
						"value": "472500"
					}
				]
			},
			{
				"text": "南阳市",
				"value": "473002",
				"children": [
					{
						"text": "宛城区",
						"value": "473001"
					},
					{
						"text": "卧龙区",
						"value": "473003"
					},
					{
						"text": "南召县",
						"value": "474650"
					},
					{
						"text": "方城县",
						"value": "473200"
					},
					{
						"text": "西峡县",
						"value": "474550"
					},
					{
						"text": "镇平县",
						"value": "474250"
					},
					{
						"text": "内乡县",
						"value": "474350"
					},
					{
						"text": "淅川县",
						"value": "474450"
					},
					{
						"text": "社旗县",
						"value": "473300"
					},
					{
						"text": "唐河县",
						"value": "473400"
					},
					{
						"text": "新野县",
						"value": "473500"
					},
					{
						"text": "桐柏县",
						"value": "474750"
					},
					{
						"text": "邓州市",
						"value": "474150"
					}
				]
			},
			{
				"text": "商丘市",
				"value": "476000",
				"children": [
					{
						"text": "梁园区",
						"value": "476000"
					},
					{
						"text": "睢阳区",
						"value": "476100"
					},
					{
						"text": "民权县",
						"value": "476800"
					},
					{
						"text": "睢县",
						"value": "476900"
					},
					{
						"text": "宁陵县",
						"value": "476700"
					},
					{
						"text": "柘城县",
						"value": "476200"
					},
					{
						"text": "虞城县",
						"value": "476300"
					},
					{
						"text": "夏邑县",
						"value": "476400"
					},
					{
						"text": "永城市",
						"value": "476600"
					}
				]
			},
			{
				"text": "信阳市",
				"value": "464000",
				"children": [
					{
						"text": "浉河区",
						"value": "464000"
					},
					{
						"text": "平桥区",
						"value": "464100"
					},
					{
						"text": "罗山县",
						"value": "464200"
					},
					{
						"text": "光山县",
						"value": "465450"
					},
					{
						"text": "新县",
						"value": "465550"
					},
					{
						"text": "商城县",
						"value": "465350"
					},
					{
						"text": "固始县",
						"value": "465250"
					},
					{
						"text": "潢川县",
						"value": "465150"
					},
					{
						"text": "淮滨县",
						"value": "464400"
					},
					{
						"text": "息县",
						"value": "464300"
					}
				]
			},
			{
				"text": "周口市",
				"value": "466000",
				"children": [
					{
						"text": "川汇区",
						"value": "466000"
					},
					{
						"text": "扶沟县",
						"value": "461300"
					},
					{
						"text": "西华县",
						"value": "466600"
					},
					{
						"text": "商水县",
						"value": "466100"
					},
					{
						"text": "沈丘县",
						"value": "466300"
					},
					{
						"text": "郸城县",
						"value": "477150"
					},
					{
						"text": "淮阳县",
						"value": "466700"
					},
					{
						"text": "太康县",
						"value": "461400"
					},
					{
						"text": "鹿邑县",
						"value": "477200"
					},
					{
						"text": "项城市",
						"value": "466200"
					}
				]
			},
			{
				"text": "驻马店市",
				"value": "463000",
				"children": [
					{
						"text": "驿城区",
						"value": "463000"
					},
					{
						"text": "西平县",
						"value": "463900"
					},
					{
						"text": "上蔡县",
						"value": "463800"
					},
					{
						"text": "平舆县",
						"value": "463400"
					},
					{
						"text": "正阳县",
						"value": "463600"
					},
					{
						"text": "确山县",
						"value": "463200"
					},
					{
						"text": "泌阳县",
						"value": "463700"
					},
					{
						"text": "汝南县",
						"value": "463300"
					},
					{
						"text": "遂平县",
						"value": "463100"
					},
					{
						"text": "新蔡县",
						"value": "463500"
					}
				]
			},
			{
				"text": "直辖县级",
				"value": "",
				"children": [
					{
						"text": "济源市",
						"value": "454650"
					}
				]
			}
		]
	},
	{
		"text": "湖北省",
		"value": "430000",
		"children": [
			{
				"text": "武汉市",
				"value": "430014",
				"children": [
					{
						"text": "江岸区",
						"value": "430014"
					},
					{
						"text": "江汉区",
						"value": "430021"
					},
					{
						"text": "硚口区",
						"value": "430033"
					},
					{
						"text": "汉阳区",
						"value": "430050"
					},
					{
						"text": "武昌区",
						"value": "430061"
					},
					{
						"text": "青山区",
						"value": "430080"
					},
					{
						"text": "洪山区",
						"value": "430070"
					},
					{
						"text": "东西湖区",
						"value": "430040"
					},
					{
						"text": "汉南区",
						"value": "430090"
					},
					{
						"text": "蔡甸区",
						"value": "430100"
					},
					{
						"text": "江夏区",
						"value": "430200"
					},
					{
						"text": "黄陂区",
						"value": "432200"
					},
					{
						"text": "新洲区",
						"value": "431400"
					}
				]
			},
			{
				"text": "黄石市",
				"value": "435003",
				"children": [
					{
						"text": "黄石港区",
						"value": "435000"
					},
					{
						"text": "西塞山区",
						"value": "435001"
					},
					{
						"text": "下陆区",
						"value": "435005"
					},
					{
						"text": "铁山区",
						"value": "435006"
					},
					{
						"text": "阳新县",
						"value": "435200"
					},
					{
						"text": "大冶市",
						"value": "435100"
					}
				]
			},
			{
				"text": "十堰市",
				"value": "442000",
				"children": [
					{
						"text": "茅箭区",
						"value": "442012"
					},
					{
						"text": "张湾区",
						"value": "442001"
					},
					{
						"text": "郧阳区",
						"value": "442500"
					},
					{
						"text": "郧西县",
						"value": "442600"
					},
					{
						"text": "竹山县",
						"value": "442200"
					},
					{
						"text": "竹溪县",
						"value": "442300"
					},
					{
						"text": "房县",
						"value": "442100"
					},
					{
						"text": "丹江口市",
						"value": "442700"
					}
				]
			},
			{
				"text": "宜昌市",
				"value": "443000",
				"children": [
					{
						"text": "西陵区",
						"value": "443000"
					},
					{
						"text": "伍家岗区",
						"value": "443001"
					},
					{
						"text": "点军区",
						"value": "443006"
					},
					{
						"text": "猇亭区",
						"value": "443007"
					},
					{
						"text": "夷陵区",
						"value": "443100"
					},
					{
						"text": "远安县",
						"value": "444200"
					},
					{
						"text": "兴山县",
						"value": "443711"
					},
					{
						"text": "秭归县",
						"value": "443600"
					},
					{
						"text": "长阳土家族自治县",
						"value": "443500"
					},
					{
						"text": "五峰土家族自治县",
						"value": "443413"
					},
					{
						"text": "宜都市",
						"value": "443300"
					},
					{
						"text": "当阳市",
						"value": "444100"
					},
					{
						"text": "枝江市",
						"value": "443200"
					}
				]
			},
			{
				"text": "襄阳市",
				"value": "441021",
				"children": [
					{
						"text": "襄城区",
						"value": "441021"
					},
					{
						"text": "樊城区",
						"value": "441001"
					},
					{
						"text": "襄州区",
						"value": "441100"
					},
					{
						"text": "南漳县",
						"value": "441500"
					},
					{
						"text": "谷城县",
						"value": "441700"
					},
					{
						"text": "保康县",
						"value": "441600"
					},
					{
						"text": "老河口市",
						"value": "441800"
					},
					{
						"text": "枣阳市",
						"value": "441200"
					},
					{
						"text": "宜城市",
						"value": "441400"
					}
				]
			},
			{
				"text": "鄂州市",
				"value": "436000",
				"children": [
					{
						"text": "梁子湖区",
						"value": "436064"
					},
					{
						"text": "华容区",
						"value": "436030"
					},
					{
						"text": "鄂城区",
						"value": "436000"
					}
				]
			},
			{
				"text": "荆门市",
				"value": "448000",
				"children": [
					{
						"text": "东宝区",
						"value": "448004"
					},
					{
						"text": "掇刀区",
						"value": "448124"
					},
					{
						"text": "京山县",
						"value": "431800"
					},
					{
						"text": "沙洋县",
						"value": "448200"
					},
					{
						"text": "钟祥市",
						"value": "431900"
					}
				]
			},
			{
				"text": "孝感市",
				"value": "432100",
				"children": [
					{
						"text": "孝南区",
						"value": "432100"
					},
					{
						"text": "孝昌县",
						"value": "432900"
					},
					{
						"text": "大悟县",
						"value": "432800"
					},
					{
						"text": "云梦县",
						"value": "432500"
					},
					{
						"text": "应城市",
						"value": "432400"
					},
					{
						"text": "安陆市",
						"value": "432600"
					},
					{
						"text": "汉川市",
						"value": "432300"
					}
				]
			},
			{
				"text": "荆州市",
				"value": "434000",
				"children": [
					{
						"text": "沙市区",
						"value": "434000"
					},
					{
						"text": "荆州区",
						"value": "434020"
					},
					{
						"text": "公安县",
						"value": "434300"
					},
					{
						"text": "监利县",
						"value": "433300"
					},
					{
						"text": "江陵县",
						"value": "434101"
					},
					{
						"text": "石首市",
						"value": "434400"
					},
					{
						"text": "洪湖市",
						"value": "433200"
					},
					{
						"text": "松滋市",
						"value": "434200"
					}
				]
			},
			{
				"text": "黄冈市",
				"value": "438000",
				"children": [
					{
						"text": "黄州区",
						"value": "438000"
					},
					{
						"text": "团风县",
						"value": "438800"
					},
					{
						"text": "红安县",
						"value": "438401"
					},
					{
						"text": "罗田县",
						"value": "438600"
					},
					{
						"text": "英山县",
						"value": "438700"
					},
					{
						"text": "浠水县",
						"value": "438200"
					},
					{
						"text": "蕲春县",
						"value": "435300"
					},
					{
						"text": "黄梅县",
						"value": "435500"
					},
					{
						"text": "麻城市",
						"value": "438300"
					},
					{
						"text": "武穴市",
						"value": "435400"
					}
				]
			},
			{
				"text": "咸宁市",
				"value": "437000",
				"children": [
					{
						"text": "咸安区",
						"value": "437000"
					},
					{
						"text": "嘉鱼县",
						"value": "437200"
					},
					{
						"text": "通城县",
						"value": "437400"
					},
					{
						"text": "崇阳县",
						"value": "437500"
					},
					{
						"text": "通山县",
						"value": "437600"
					},
					{
						"text": "赤壁市",
						"value": "437300"
					}
				]
			},
			{
				"text": "随州市",
				"value": "441300",
				"children": [
					{
						"text": "曾都区",
						"value": "441300"
					},
					{
						"text": "随县",
						"value": "441309"
					},
					{
						"text": "广水市",
						"value": "432700"
					}
				]
			},
			{
				"text": "恩施土家族苗族自治州",
				"value": "445000",
				"children": [
					{
						"text": "恩施市",
						"value": "445000"
					},
					{
						"text": "利川市",
						"value": "445400"
					},
					{
						"text": "建始县",
						"value": "445300"
					},
					{
						"text": "巴东县",
						"value": "444300"
					},
					{
						"text": "宣恩县",
						"value": "445500"
					},
					{
						"text": "咸丰县",
						"value": "445600"
					},
					{
						"text": "来凤县",
						"value": "445700"
					},
					{
						"text": "鹤峰县",
						"value": "445800"
					}
				]
			},
			{
				"text": "直辖县级",
				"value": "",
				"children": [
					{
						"text": "仙桃市",
						"value": "433000"
					},
					{
						"text": "潜江市",
						"value": "433100"
					},
					{
						"text": "天门市",
						"value": "431700"
					},
					{
						"text": "神农架林区",
						"value": "442400"
					}
				]
			}
		]
	},
	{
		"text": "湖南省",
		"value": "410011",
		"children": [
			{
				"text": "长沙市",
				"value": "410005",
				"children": [
					{
						"text": "芙蓉区",
						"value": "410011"
					},
					{
						"text": "天心区",
						"value": "410004"
					},
					{
						"text": "岳麓区",
						"value": "410013"
					},
					{
						"text": "开福区",
						"value": "410008"
					},
					{
						"text": "雨花区",
						"value": "410011"
					},
					{
						"text": "望城区",
						"value": "410200"
					},
					{
						"text": "长沙县",
						"value": "410100"
					},
					{
						"text": "宁乡县",
						"value": "410600"
					},
					{
						"text": "浏阳市",
						"value": "410300"
					}
				]
			},
			{
				"text": "株洲市",
				"value": "412000",
				"children": [
					{
						"text": "荷塘区",
						"value": "412000"
					},
					{
						"text": "芦淞区",
						"value": "412000"
					},
					{
						"text": "石峰区",
						"value": "412005"
					},
					{
						"text": "天元区",
						"value": "412007"
					},
					{
						"text": "株洲县",
						"value": "412100"
					},
					{
						"text": "攸县",
						"value": "412300"
					},
					{
						"text": "茶陵县",
						"value": "412400"
					},
					{
						"text": "炎陵县",
						"value": "412500"
					},
					{
						"text": "醴陵市",
						"value": "412200"
					}
				]
			},
			{
				"text": "湘潭市",
				"value": "411100",
				"children": [
					{
						"text": "雨湖区",
						"value": "411100"
					},
					{
						"text": "岳塘区",
						"value": "411101"
					},
					{
						"text": "湘潭县",
						"value": "411228"
					},
					{
						"text": "湘乡市",
						"value": "411400"
					},
					{
						"text": "韶山市",
						"value": "411300"
					}
				]
			},
			{
				"text": "衡阳市",
				"value": "421001",
				"children": [
					{
						"text": "珠晖区",
						"value": "421002"
					},
					{
						"text": "雁峰区",
						"value": "421001"
					},
					{
						"text": "石鼓区",
						"value": "421005"
					},
					{
						"text": "蒸湘区",
						"value": "421001"
					},
					{
						"text": "南岳区",
						"value": "421900"
					},
					{
						"text": "衡阳县",
						"value": "421200"
					},
					{
						"text": "衡南县",
						"value": "421131"
					},
					{
						"text": "衡山县",
						"value": "421300"
					},
					{
						"text": "衡东县",
						"value": "421400"
					},
					{
						"text": "祁东县",
						"value": "421600"
					},
					{
						"text": "耒阳市",
						"value": "421800"
					},
					{
						"text": "常宁市",
						"value": "421500"
					}
				]
			},
			{
				"text": "邵阳市",
				"value": "422000",
				"children": [
					{
						"text": "双清区",
						"value": "422001"
					},
					{
						"text": "大祥区",
						"value": "422000"
					},
					{
						"text": "北塔区",
						"value": "422007"
					},
					{
						"text": "邵东县",
						"value": "422800"
					},
					{
						"text": "新邵县",
						"value": "422900"
					},
					{
						"text": "邵阳县",
						"value": "422100"
					},
					{
						"text": "隆回县",
						"value": "422200"
					},
					{
						"text": "洞口县",
						"value": "422300"
					},
					{
						"text": "绥宁县",
						"value": "422600"
					},
					{
						"text": "新宁县",
						"value": "422700"
					},
					{
						"text": "城步苗族自治县",
						"value": "422500"
					},
					{
						"text": "武冈市",
						"value": "422400"
					}
				]
			},
			{
				"text": "岳阳市",
				"value": "414000",
				"children": [
					{
						"text": "岳阳楼区",
						"value": "414000"
					},
					{
						"text": "云溪区",
						"value": "414009"
					},
					{
						"text": "君山区",
						"value": "414005"
					},
					{
						"text": "岳阳县",
						"value": "414100"
					},
					{
						"text": "华容县",
						"value": "414200"
					},
					{
						"text": "湘阴县",
						"value": "414600"
					},
					{
						"text": "平江县",
						"value": "414500"
					},
					{
						"text": "汨罗市",
						"value": "414400"
					},
					{
						"text": "临湘市",
						"value": "414300"
					}
				]
			},
			{
				"text": "常德市",
				"value": "415000",
				"children": [
					{
						"text": "武陵区",
						"value": "415000"
					},
					{
						"text": "鼎城区",
						"value": "415101"
					},
					{
						"text": "安乡县",
						"value": "415600"
					},
					{
						"text": "汉寿县",
						"value": "415900"
					},
					{
						"text": "澧县",
						"value": "415500"
					},
					{
						"text": "临澧县",
						"value": "415200"
					},
					{
						"text": "桃源县",
						"value": "415700"
					},
					{
						"text": "石门县",
						"value": "415300"
					},
					{
						"text": "津市市",
						"value": "415400"
					}
				]
			},
			{
				"text": "张家界市",
				"value": "427000",
				"children": [
					{
						"text": "永定区",
						"value": "427000"
					},
					{
						"text": "武陵源区",
						"value": "427400"
					},
					{
						"text": "慈利县",
						"value": "427200"
					},
					{
						"text": "桑植县",
						"value": "427100"
					}
				]
			},
			{
				"text": "益阳市",
				"value": "413000",
				"children": [
					{
						"text": "资阳区",
						"value": "413001"
					},
					{
						"text": "赫山区",
						"value": "413002"
					},
					{
						"text": "南县",
						"value": "413200"
					},
					{
						"text": "桃江县",
						"value": "413400"
					},
					{
						"text": "安化县",
						"value": "413500"
					},
					{
						"text": "沅江市",
						"value": "413100"
					}
				]
			},
			{
				"text": "郴州市",
				"value": "423000",
				"children": [
					{
						"text": "北湖区",
						"value": "423000"
					},
					{
						"text": "苏仙区",
						"value": "423000"
					},
					{
						"text": "桂阳县",
						"value": "424400"
					},
					{
						"text": "宜章县",
						"value": "424200"
					},
					{
						"text": "永兴县",
						"value": "423300"
					},
					{
						"text": "嘉禾县",
						"value": "424500"
					},
					{
						"text": "临武县",
						"value": "424300"
					},
					{
						"text": "汝城县",
						"value": "424100"
					},
					{
						"text": "桂东县",
						"value": "423500"
					},
					{
						"text": "安仁县",
						"value": "423600"
					},
					{
						"text": "资兴市",
						"value": "423400"
					}
				]
			},
			{
				"text": "永州市",
				"value": "425000",
				"children": [
					{
						"text": "零陵区",
						"value": "425100"
					},
					{
						"text": "冷水滩区",
						"value": "425100"
					},
					{
						"text": "祁阳县",
						"value": "426100"
					},
					{
						"text": "东安县",
						"value": "425900"
					},
					{
						"text": "双牌县",
						"value": "425200"
					},
					{
						"text": "道县",
						"value": "425300"
					},
					{
						"text": "江永县",
						"value": "425400"
					},
					{
						"text": "宁远县",
						"value": "425600"
					},
					{
						"text": "蓝山县",
						"value": "425800"
					},
					{
						"text": "新田县",
						"value": "425700"
					},
					{
						"text": "江华瑶族自治县",
						"value": "425500"
					}
				]
			},
			{
				"text": "怀化市",
				"value": "418000",
				"children": [
					{
						"text": "鹤城区",
						"value": "418000"
					},
					{
						"text": "中方县",
						"value": "418005"
					},
					{
						"text": "沅陵县",
						"value": "419600"
					},
					{
						"text": "辰溪县",
						"value": "419500"
					},
					{
						"text": "溆浦县",
						"value": "419300"
					},
					{
						"text": "会同县",
						"value": "418300"
					},
					{
						"text": "麻阳苗族自治县",
						"value": "419400"
					},
					{
						"text": "新晃侗族自治县",
						"value": "419200"
					},
					{
						"text": "芷江侗族自治县",
						"value": "419100"
					},
					{
						"text": "靖州苗族侗族自治县",
						"value": "418400"
					},
					{
						"text": "通道侗族自治县",
						"value": "418500"
					},
					{
						"text": "洪江市",
						"value": "418100"
					}
				]
			},
			{
				"text": "娄底市",
				"value": "417000",
				"children": [
					{
						"text": "娄星区",
						"value": "417000"
					},
					{
						"text": "双峰县",
						"value": "417700"
					},
					{
						"text": "新化县",
						"value": "417600"
					},
					{
						"text": "冷水江市",
						"value": "417500"
					},
					{
						"text": "涟源市",
						"value": "417100"
					}
				]
			},
			{
				"text": "湘西土家族苗族自治州",
				"value": "416000",
				"children": [
					{
						"text": "吉首市",
						"value": "416000"
					},
					{
						"text": "泸溪县",
						"value": "416100"
					},
					{
						"text": "凤凰县",
						"value": "416200"
					},
					{
						"text": "花垣县",
						"value": "416400"
					},
					{
						"text": "保靖县",
						"value": "416500"
					},
					{
						"text": "古丈县",
						"value": "416300"
					},
					{
						"text": "永顺县",
						"value": "416700"
					},
					{
						"text": "龙山县",
						"value": "416800"
					}
				]
			}
		]
	},
	{
		"text": "广东省",
		"value": "510000",
		"children": [
			{
				"text": "广州市",
				"value": "510032",
				"children": [
					{
						"text": "荔湾区",
						"value": "510170"
					},
					{
						"text": "越秀区",
						"value": "510030"
					},
					{
						"text": "海珠区",
						"value": "510300"
					},
					{
						"text": "天河区",
						"value": "510665"
					},
					{
						"text": "白云区",
						"value": "510405"
					},
					{
						"text": "黄埔区",
						"value": "510700"
					},
					{
						"text": "番禺区",
						"value": "511400"
					},
					{
						"text": "花都区",
						"value": "510800"
					},
					{
						"text": "南沙区",
						"value": "511458"
					},
					{
						"text": "从化区",
						"value": "510900"
					},
					{
						"text": "增城区",
						"value": "511300"
					}
				]
			},
			{
				"text": "韶关市",
				"value": "512002",
				"children": [
					{
						"text": "武江区",
						"value": "512026"
					},
					{
						"text": "浈江区",
						"value": "512023"
					},
					{
						"text": "曲江区",
						"value": "512101"
					},
					{
						"text": "始兴县",
						"value": "512500"
					},
					{
						"text": "仁化县",
						"value": "512300"
					},
					{
						"text": "翁源县",
						"value": "512600"
					},
					{
						"text": "乳源瑶族自治县",
						"value": "512700"
					},
					{
						"text": "新丰县",
						"value": "511100"
					},
					{
						"text": "乐昌市",
						"value": "512200"
					},
					{
						"text": "南雄市",
						"value": "512400"
					}
				]
			},
			{
				"text": "深圳市",
				"value": "518035",
				"children": [
					{
						"text": "罗湖区",
						"value": "518021"
					},
					{
						"text": "福田区",
						"value": "518048"
					},
					{
						"text": "南山区",
						"value": "518051"
					},
					{
						"text": "宝安区",
						"value": "518101"
					},
					{
						"text": "龙岗区",
						"value": "518172"
					},
					{
						"text": "盐田区",
						"value": "518081"
					},
					{
						"text": "光明新区",
						"value": "518100"
					},
					{
						"text": "坪山新区",
						"value": "518000"
					},
					{
						"text": "大鹏新区",
						"value": "518000"
					},
					{
						"text": "龙华新区",
						"value": "518100"
					}
				]
			},
			{
				"text": "珠海市",
				"value": "519000",
				"children": [
					{
						"text": "香洲区",
						"value": "519000"
					},
					{
						"text": "斗门区",
						"value": "519110"
					},
					{
						"text": "金湾区",
						"value": "519040"
					}
				]
			},
			{
				"text": "汕头市",
				"value": "515041",
				"children": [
					{
						"text": "龙湖区",
						"value": "515041"
					},
					{
						"text": "金平区",
						"value": "515041"
					},
					{
						"text": "濠江区",
						"value": "515071"
					},
					{
						"text": "潮阳区",
						"value": "515100"
					},
					{
						"text": "潮南区",
						"value": "515144"
					},
					{
						"text": "澄海区",
						"value": "515800"
					},
					{
						"text": "南澳县",
						"value": "515900"
					}
				]
			},
			{
				"text": "佛山市",
				"value": "528000",
				"children": [
					{
						"text": "禅城区",
						"value": "528000"
					},
					{
						"text": "南海区",
						"value": "528251"
					},
					{
						"text": "顺德区",
						"value": "528300"
					},
					{
						"text": "三水区",
						"value": "528133"
					},
					{
						"text": "高明区",
						"value": "528500"
					}
				]
			},
			{
				"text": "江门市",
				"value": "529000",
				"children": [
					{
						"text": "蓬江区",
						"value": "529000"
					},
					{
						"text": "江海区",
						"value": "529040"
					},
					{
						"text": "新会区",
						"value": "529100"
					},
					{
						"text": "台山市",
						"value": "529200"
					},
					{
						"text": "开平市",
						"value": "529337"
					},
					{
						"text": "鹤山市",
						"value": "529700"
					},
					{
						"text": "恩平市",
						"value": "529400"
					}
				]
			},
			{
				"text": "湛江市",
				"value": "524047",
				"children": [
					{
						"text": "赤坎区",
						"value": "524033"
					},
					{
						"text": "霞山区",
						"value": "524011"
					},
					{
						"text": "坡头区",
						"value": "524057"
					},
					{
						"text": "麻章区",
						"value": "524094"
					},
					{
						"text": "遂溪县",
						"value": "524300"
					},
					{
						"text": "徐闻县",
						"value": "524100"
					},
					{
						"text": "廉江市",
						"value": "524400"
					},
					{
						"text": "雷州市",
						"value": "524200"
					},
					{
						"text": "吴川市",
						"value": "524500"
					}
				]
			},
			{
				"text": "茂名市",
				"value": "525000",
				"children": [
					{
						"text": "茂南区",
						"value": "525000"
					},
					{
						"text": "电白区",
						"value": "525400"
					},
					{
						"text": "高州市",
						"value": "525200"
					},
					{
						"text": "化州市",
						"value": "525100"
					},
					{
						"text": "信宜市",
						"value": "525300"
					}
				]
			},
			{
				"text": "肇庆市",
				"value": "526040",
				"children": [
					{
						"text": "端州区",
						"value": "526060"
					},
					{
						"text": "鼎湖区",
						"value": "526070"
					},
					{
						"text": "广宁县",
						"value": "526300"
					},
					{
						"text": "怀集县",
						"value": "526400"
					},
					{
						"text": "封开县",
						"value": "526500"
					},
					{
						"text": "德庆县",
						"value": "526600"
					},
					{
						"text": "高要市",
						"value": "526100"
					},
					{
						"text": "四会市",
						"value": "526200"
					}
				]
			},
			{
				"text": "惠州市",
				"value": "516000",
				"children": [
					{
						"text": "惠城区",
						"value": "516008"
					},
					{
						"text": "惠阳区",
						"value": "516211"
					},
					{
						"text": "博罗县",
						"value": "516100"
					},
					{
						"text": "惠东县",
						"value": "516300"
					},
					{
						"text": "龙门县",
						"value": "516800"
					}
				]
			},
			{
				"text": "梅州市",
				"value": "514021",
				"children": [
					{
						"text": "梅江区",
						"value": "514000"
					},
					{
						"text": "梅县区",
						"value": "514787"
					},
					{
						"text": "大埔县",
						"value": "514200"
					},
					{
						"text": "丰顺县",
						"value": "514300"
					},
					{
						"text": "五华县",
						"value": "514400"
					},
					{
						"text": "平远县",
						"value": "514600"
					},
					{
						"text": "蕉岭县",
						"value": "514100"
					},
					{
						"text": "兴宁市",
						"value": "514500"
					}
				]
			},
			{
				"text": "汕尾市",
				"value": "516600",
				"children": [
					{
						"text": "城区",
						"value": "516600"
					},
					{
						"text": "海丰县",
						"value": "516400"
					},
					{
						"text": "陆河县",
						"value": "516700"
					},
					{
						"text": "陆丰市",
						"value": "516500"
					}
				]
			},
			{
				"text": "河源市",
				"value": "517000",
				"children": [
					{
						"text": "源城区",
						"value": "517000"
					},
					{
						"text": "紫金县",
						"value": "517400"
					},
					{
						"text": "龙川县",
						"value": "517300"
					},
					{
						"text": "连平县",
						"value": "517100"
					},
					{
						"text": "和平县",
						"value": "517200"
					},
					{
						"text": "东源县",
						"value": "517583"
					}
				]
			},
			{
				"text": "阳江市",
				"value": "529500",
				"children": [
					{
						"text": "江城区",
						"value": "529500"
					},
					{
						"text": "阳东区",
						"value": "529900"
					},
					{
						"text": "阳西县",
						"value": "529800"
					},
					{
						"text": "阳春市",
						"value": "529600"
					}
				]
			},
			{
				"text": "清远市",
				"value": "511500",
				"children": [
					{
						"text": "清城区",
						"value": "511515"
					},
					{
						"text": "清新区",
						"value": "511810"
					},
					{
						"text": "佛冈县",
						"value": "511600"
					},
					{
						"text": "阳山县",
						"value": "513100"
					},
					{
						"text": "连山壮族瑶族自治县",
						"value": "513200"
					},
					{
						"text": "连南瑶族自治县",
						"value": "513300"
					},
					{
						"text": "英德市",
						"value": "513000"
					},
					{
						"text": "连州市",
						"value": "513400"
					}
				]
			},
			{
				"text": "东莞市",
				"value": "523888",
				"children": [
					{
						"text": "莞城区",
						"value": "523128"
					},
					{
						"text": "南城区",
						"value": "523617"
					},
					{
						"text": "万江区",
						"value": "523039"
					},
					{
						"text": "石碣镇",
						"value": "523290"
					},
					{
						"text": "石龙镇",
						"value": "523326"
					},
					{
						"text": "茶山镇",
						"value": "523380"
					},
					{
						"text": "石排镇",
						"value": "523346"
					},
					{
						"text": "企石镇",
						"value": "523507"
					},
					{
						"text": "横沥镇",
						"value": "523471"
					},
					{
						"text": "桥头镇",
						"value": "523520"
					},
					{
						"text": "谢岗镇",
						"value": "523592"
					},
					{
						"text": "东坑镇",
						"value": "523451"
					},
					{
						"text": "常平镇",
						"value": "523560"
					},
					{
						"text": "寮步镇",
						"value": "523411"
					},
					{
						"text": "大朗镇",
						"value": "523770"
					},
					{
						"text": "麻涌镇",
						"value": "523143"
					},
					{
						"text": "中堂镇",
						"value": "523233"
					},
					{
						"text": "高埗镇",
						"value": "523282"
					},
					{
						"text": "樟木头镇",
						"value": "523619"
					},
					{
						"text": "大岭山镇",
						"value": "523835"
					},
					{
						"text": "望牛墩镇",
						"value": "523203"
					},
					{
						"text": "黄江镇",
						"value": "523755"
					},
					{
						"text": "洪梅镇",
						"value": "523163"
					},
					{
						"text": "清溪镇",
						"value": "523660"
					},
					{
						"text": "沙田镇",
						"value": "523988"
					},
					{
						"text": "道滘镇",
						"value": "523171"
					},
					{
						"text": "塘厦镇",
						"value": "523713"
					},
					{
						"text": "虎门镇",
						"value": "523932"
					},
					{
						"text": "厚街镇",
						"value": "523960"
					},
					{
						"text": "凤岗镇",
						"value": "523690"
					},
					{
						"text": "长安镇",
						"value": "523850"
					}
				]
			},
			{
				"text": "中山市",
				"value": "528403",
				"children": [
					{
						"text": "石岐区",
						"value": "528400"
					},
					{
						"text": "南区",
						"value": "528400"
					},
					{
						"text": "五桂山区",
						"value": "528458"
					},
					{
						"text": "火炬开发区",
						"value": "528437"
					},
					{
						"text": "黄圃镇",
						"value": "528429"
					},
					{
						"text": "南头镇",
						"value": "528421"
					},
					{
						"text": "东凤镇",
						"value": "528425"
					},
					{
						"text": "阜沙镇",
						"value": "528434"
					},
					{
						"text": "小榄镇",
						"value": "528415"
					},
					{
						"text": "东升镇",
						"value": "528400"
					},
					{
						"text": "古镇镇",
						"value": "528422"
					},
					{
						"text": "横栏镇",
						"value": "528478"
					},
					{
						"text": "三角镇",
						"value": "528422"
					},
					{
						"text": "民众镇",
						"value": "528441"
					},
					{
						"text": "南朗镇",
						"value": "528454"
					},
					{
						"text": "港口镇",
						"value": "528447"
					},
					{
						"text": "大涌镇",
						"value": "528476"
					},
					{
						"text": "沙溪镇",
						"value": "528471"
					},
					{
						"text": "三乡镇",
						"value": "528463"
					},
					{
						"text": "板芙镇",
						"value": "528459"
					},
					{
						"text": "神湾镇",
						"value": "528462"
					},
					{
						"text": "坦洲镇",
						"value": "528467"
					}
				]
			},
			{
				"text": "潮州市",
				"value": "521000",
				"children": [
					{
						"text": "湘桥区",
						"value": "521000"
					},
					{
						"text": "潮安区",
						"value": "515638"
					},
					{
						"text": "饶平县",
						"value": "515700"
					}
				]
			},
			{
				"text": "揭阳市",
				"value": "522000",
				"children": [
					{
						"text": "榕城区",
						"value": "522000"
					},
					{
						"text": "揭东区",
						"value": "515500"
					},
					{
						"text": "揭西县",
						"value": "515400"
					},
					{
						"text": "惠来县",
						"value": "515200"
					},
					{
						"text": "普宁市",
						"value": "515300"
					}
				]
			},
			{
				"text": "云浮市",
				"value": "527300",
				"children": [
					{
						"text": "云城区",
						"value": "527300"
					},
					{
						"text": "云安区",
						"value": "527500"
					},
					{
						"text": "新兴县",
						"value": "527400"
					},
					{
						"text": "郁南县",
						"value": "527100"
					},
					{
						"text": "罗定市",
						"value": "527200"
					}
				]
			}
		]
	},
	{
		"text": "广西壮族自治区",
		"value": "530000",
		"children": [
			{
				"text": "南宁市",
				"value": "530028",
				"children": [
					{
						"text": "兴宁区",
						"value": "530023"
					},
					{
						"text": "青秀区",
						"value": "530213"
					},
					{
						"text": "江南区",
						"value": "530031"
					},
					{
						"text": "西乡塘区",
						"value": "530001"
					},
					{
						"text": "良庆区",
						"value": "530219"
					},
					{
						"text": "邕宁区",
						"value": "530200"
					},
					{
						"text": "武鸣县",
						"value": "530100"
					},
					{
						"text": "隆安县",
						"value": "532700"
					},
					{
						"text": "马山县",
						"value": "530600"
					},
					{
						"text": "上林县",
						"value": "530500"
					},
					{
						"text": "宾阳县",
						"value": "530400"
					},
					{
						"text": "横县",
						"value": "530300"
					},
					{
						"text": "埌东新区",
						"value": "530000"
					}
				]
			},
			{
				"text": "柳州市",
				"value": "545001",
				"children": [
					{
						"text": "城中区",
						"value": "545001"
					},
					{
						"text": "鱼峰区",
						"value": "545005"
					},
					{
						"text": "柳南区",
						"value": "545007"
					},
					{
						"text": "柳北区",
						"value": "545002"
					},
					{
						"text": "柳江县",
						"value": "545100"
					},
					{
						"text": "柳城县",
						"value": "545200"
					},
					{
						"text": "鹿寨县",
						"value": "545600"
					},
					{
						"text": "融安县",
						"value": "545400"
					},
					{
						"text": "融水苗族自治县",
						"value": "545300"
					},
					{
						"text": "三江侗族自治县",
						"value": "545500"
					},
					{
						"text": "柳东新区",
						"value": "545000"
					}
				]
			},
			{
				"text": "桂林市",
				"value": "541100",
				"children": [
					{
						"text": "秀峰区",
						"value": "541001"
					},
					{
						"text": "叠彩区",
						"value": "541001"
					},
					{
						"text": "象山区",
						"value": "541002"
					},
					{
						"text": "七星区",
						"value": "541004"
					},
					{
						"text": "雁山区",
						"value": "541006"
					},
					{
						"text": "临桂区",
						"value": "541100"
					},
					{
						"text": "阳朔县",
						"value": "541900"
					},
					{
						"text": "灵川县",
						"value": "541200"
					},
					{
						"text": "全州县",
						"value": "541503"
					},
					{
						"text": "兴安县",
						"value": "541300"
					},
					{
						"text": "永福县",
						"value": "541800"
					},
					{
						"text": "灌阳县",
						"value": "541600"
					},
					{
						"text": "龙胜各族自治县",
						"value": "541700"
					},
					{
						"text": "资源县",
						"value": "541400"
					},
					{
						"text": "平乐县",
						"value": "542400"
					},
					{
						"text": "荔浦县",
						"value": "546600"
					},
					{
						"text": "恭城瑶族自治县",
						"value": "542500"
					}
				]
			},
			{
				"text": "梧州市",
				"value": "543002",
				"children": [
					{
						"text": "万秀区",
						"value": "543000"
					},
					{
						"text": "长洲区",
						"value": "543003"
					},
					{
						"text": "龙圩区",
						"value": "543002"
					},
					{
						"text": "苍梧县",
						"value": "543100"
					},
					{
						"text": "藤县",
						"value": "543300"
					},
					{
						"text": "蒙山县",
						"value": "546700"
					},
					{
						"text": "岑溪市",
						"value": "543200"
					}
				]
			},
			{
				"text": "北海市",
				"value": "536000",
				"children": [
					{
						"text": "海城区",
						"value": "536000"
					},
					{
						"text": "银海区",
						"value": "536000"
					},
					{
						"text": "铁山港区",
						"value": "536017"
					},
					{
						"text": "合浦县",
						"value": "536100"
					}
				]
			},
			{
				"text": "防城港市",
				"value": "538001",
				"children": [
					{
						"text": "港口区",
						"value": "538001"
					},
					{
						"text": "防城区",
						"value": "538021"
					},
					{
						"text": "上思县",
						"value": "535500"
					},
					{
						"text": "东兴市",
						"value": "538100"
					}
				]
			},
			{
				"text": "钦州市",
				"value": "535099",
				"children": [
					{
						"text": "钦南区",
						"value": "535099"
					},
					{
						"text": "钦北区",
						"value": "535099"
					},
					{
						"text": "灵山县",
						"value": "535099"
					},
					{
						"text": "浦北县",
						"value": "535099"
					}
				]
			},
			{
				"text": "贵港市",
				"value": "537100",
				"children": [
					{
						"text": "港北区",
						"value": "537100"
					},
					{
						"text": "港南区",
						"value": "537100"
					},
					{
						"text": "覃塘区",
						"value": "537121"
					},
					{
						"text": "平南县",
						"value": "537300"
					},
					{
						"text": "桂平市",
						"value": "537200"
					}
				]
			},
			{
				"text": "玉林市",
				"value": "537000",
				"children": [
					{
						"text": "玉州区",
						"value": "537000"
					},
					{
						"text": "福绵区",
						"value": "537023"
					},
					{
						"text": "玉东新区",
						"value": "537000"
					},
					{
						"text": "容县",
						"value": "537500"
					},
					{
						"text": "陆川县",
						"value": "537700"
					},
					{
						"text": "博白县",
						"value": "537600"
					},
					{
						"text": "兴业县",
						"value": "537800"
					},
					{
						"text": "北流市",
						"value": "537400"
					}
				]
			},
			{
				"text": "百色市",
				"value": "533000",
				"children": [
					{
						"text": "右江区",
						"value": "533000"
					},
					{
						"text": "田阳县",
						"value": "533600"
					},
					{
						"text": "田东县",
						"value": "531500"
					},
					{
						"text": "平果县",
						"value": "531400"
					},
					{
						"text": "德保县",
						"value": "533700"
					},
					{
						"text": "靖西县",
						"value": "533800"
					},
					{
						"text": "那坡县",
						"value": "533900"
					},
					{
						"text": "凌云县",
						"value": "533100"
					},
					{
						"text": "乐业县",
						"value": "533200"
					},
					{
						"text": "田林县",
						"value": "533300"
					},
					{
						"text": "西林县",
						"value": "533500"
					},
					{
						"text": "隆林各族自治县",
						"value": "533400"
					}
				]
			},
			{
				"text": "贺州市",
				"value": "542800",
				"children": [
					{
						"text": "八步区",
						"value": "542800"
					},
					{
						"text": "昭平县",
						"value": "546800"
					},
					{
						"text": "钟山县",
						"value": "542600"
					},
					{
						"text": "富川瑶族自治县",
						"value": "542700"
					},
					{
						"text": "平桂管理区",
						"value": "542800"
					}
				]
			},
			{
				"text": "河池市",
				"value": "547000",
				"children": [
					{
						"text": "金城江区",
						"value": "547000"
					},
					{
						"text": "南丹县",
						"value": "547200"
					},
					{
						"text": "天峨县",
						"value": "547300"
					},
					{
						"text": "凤山县",
						"value": "547600"
					},
					{
						"text": "东兰县",
						"value": "547400"
					},
					{
						"text": "罗城仫佬族自治县",
						"value": "546400"
					},
					{
						"text": "环江毛南族自治县",
						"value": "547100"
					},
					{
						"text": "巴马瑶族自治县",
						"value": "547500"
					},
					{
						"text": "都安瑶族自治县",
						"value": "530700"
					},
					{
						"text": "大化瑶族自治县",
						"value": "530800"
					},
					{
						"text": "宜州市",
						"value": "546300"
					}
				]
			},
			{
				"text": "来宾市",
				"value": "546100",
				"children": [
					{
						"text": "兴宾区",
						"value": "546100"
					},
					{
						"text": "忻城县",
						"value": "546200"
					},
					{
						"text": "象州县",
						"value": "545800"
					},
					{
						"text": "武宣县",
						"value": "545900"
					},
					{
						"text": "金秀瑶族自治县",
						"value": "545799"
					},
					{
						"text": "合山市",
						"value": "546500"
					}
				]
			},
			{
				"text": "崇左市",
				"value": "532299",
				"children": [
					{
						"text": "江州区",
						"value": "532299"
					},
					{
						"text": "扶绥县",
						"value": "532199"
					},
					{
						"text": "宁明县",
						"value": "532599"
					},
					{
						"text": "龙州县",
						"value": "532499"
					},
					{
						"text": "大新县",
						"value": "532399"
					},
					{
						"text": "天等县",
						"value": "532899"
					},
					{
						"text": "凭祥市",
						"value": "532699"
					}
				]
			}
		]
	},
	{
		"text": "海南省",
		"value": "570000",
		"children": [
			{
				"text": "海口市",
				"value": "570000",
				"children": [
					{
						"text": "秀英区",
						"value": "570311"
					},
					{
						"text": "龙华区",
						"value": "570145"
					},
					{
						"text": "琼山区",
						"value": "571100"
					},
					{
						"text": "美兰区",
						"value": "570203"
					}
				]
			},
			{
				"text": "三亚市",
				"value": "572000",
				"children": [
					{
						"text": "海棠区",
						"value": "572000"
					},
					{
						"text": "吉阳区",
						"value": "572000"
					},
					{
						"text": "天涯区",
						"value": "572000"
					},
					{
						"text": "崖州区",
						"value": "572000"
					}
				]
			},
			{
				"text": "三沙市",
				"value": "573199",
				"children": [
					{
						"text": "西沙群岛",
						"value": "572000"
					},
					{
						"text": "南沙群岛",
						"value": "573100"
					},
					{
						"text": "中沙群岛",
						"value": "573100"
					}
				]
			},
			{
				"text": "直辖县级",
				"value": "",
				"children": [
					{
						"text": "五指山市",
						"value": "572200"
					},
					{
						"text": "琼海市",
						"value": "571400"
					},
					{
						"text": "儋州市",
						"value": "571700"
					},
					{
						"text": "文昌市",
						"value": "571339"
					},
					{
						"text": "万宁市",
						"value": "571500"
					},
					{
						"text": "东方市",
						"value": "572600"
					},
					{
						"text": "定安县",
						"value": "571200"
					},
					{
						"text": "屯昌县",
						"value": "571600"
					},
					{
						"text": "澄迈县",
						"value": "571900"
					},
					{
						"text": "临高县",
						"value": "571800"
					},
					{
						"text": "白沙黎族自治县",
						"value": "572800"
					},
					{
						"text": "昌江黎族自治县",
						"value": "572700"
					},
					{
						"text": "乐东黎族自治县",
						"value": "572500"
					},
					{
						"text": "陵水黎族自治县",
						"value": "572400"
					},
					{
						"text": "保亭黎族苗族自治县",
						"value": "572300"
					},
					{
						"text": "琼中黎族苗族自治县",
						"value": "572900"
					}
				]
			}
		]
	},
	{
		"text": "重庆",
		"value": "400000",
		"children": [
			{
				"text": "重庆市",
				"value": "400000",
				"children": [
					{
						"text": "万州区",
						"value": "404000"
					},
					{
						"text": "涪陵区",
						"value": "408000"
					},
					{
						"text": "渝中区",
						"value": "400010"
					},
					{
						"text": "大渡口区",
						"value": "400080"
					},
					{
						"text": "江北区",
						"value": "400020"
					},
					{
						"text": "沙坪坝区",
						"value": "400030"
					},
					{
						"text": "九龙坡区",
						"value": "400050"
					},
					{
						"text": "南岸区",
						"value": "400064"
					},
					{
						"text": "北碚区",
						"value": "400700"
					},
					{
						"text": "綦江区",
						"value": "400800"
					},
					{
						"text": "大足区",
						"value": "400900"
					},
					{
						"text": "渝北区",
						"value": "401120"
					},
					{
						"text": "巴南区",
						"value": "401320"
					},
					{
						"text": "黔江区",
						"value": "409700"
					},
					{
						"text": "长寿区",
						"value": "401220"
					},
					{
						"text": "江津区",
						"value": "402260"
					},
					{
						"text": "合川区",
						"value": "401520"
					},
					{
						"text": "永川区",
						"value": "402160"
					},
					{
						"text": "南川区",
						"value": "408400"
					},
					{
						"text": "璧山区",
						"value": "402760"
					},
					{
						"text": "铜梁区",
						"value": "402560"
					},
					{
						"text": "潼南县",
						"value": "402660"
					},
					{
						"text": "荣昌县",
						"value": "402460"
					},
					{
						"text": "梁平县",
						"value": "405200"
					},
					{
						"text": "城口县",
						"value": "405900"
					},
					{
						"text": "丰都县",
						"value": "408200"
					},
					{
						"text": "垫江县",
						"value": "408300"
					},
					{
						"text": "武隆县",
						"value": "408500"
					},
					{
						"text": "忠县",
						"value": "404300"
					},
					{
						"text": "开县",
						"value": "405400"
					},
					{
						"text": "云阳县",
						"value": "404500"
					},
					{
						"text": "奉节县",
						"value": "404600"
					},
					{
						"text": "巫山县",
						"value": "404700"
					},
					{
						"text": "巫溪县",
						"value": "405800"
					},
					{
						"text": "石柱土家族自治县",
						"value": "409100"
					},
					{
						"text": "秀山土家族苗族自治县",
						"value": "409900"
					},
					{
						"text": "酉阳土家族苗族自治县",
						"value": "409800"
					},
					{
						"text": "彭水苗族土家族自治县",
						"value": "409600"
					}
				]
			},
			{
				"text": "两江新区",
				"value": "400000",
				"children": [
					{
						"text": "北部新区",
						"value": "400000"
					},
					{
						"text": "保税港区",
						"value": "400000"
					},
					{
						"text": "工业园区",
						"value": "400000"
					}
				]
			}
		]
	},
	{
		"text": "四川省",
		"value": "610000",
		"children": [
			{
				"text": "成都市",
				"value": "610015",
				"children": [
					{
						"text": "锦江区",
						"value": "610021"
					},
					{
						"text": "青羊区",
						"value": "610031"
					},
					{
						"text": "金牛区",
						"value": "610036"
					},
					{
						"text": "武侯区",
						"value": "610041"
					},
					{
						"text": "成华区",
						"value": "610066"
					},
					{
						"text": "龙泉驿区",
						"value": "610100"
					},
					{
						"text": "青白江区",
						"value": "610300"
					},
					{
						"text": "新都区",
						"value": "610500"
					},
					{
						"text": "温江区",
						"value": "611130"
					},
					{
						"text": "金堂县",
						"value": "610400"
					},
					{
						"text": "双流县",
						"value": "610200"
					},
					{
						"text": "郫县",
						"value": "611730"
					},
					{
						"text": "大邑县",
						"value": "611330"
					},
					{
						"text": "蒲江县",
						"value": "611630"
					},
					{
						"text": "新津县",
						"value": "611430"
					},
					{
						"text": "都江堰市",
						"value": "611830"
					},
					{
						"text": "彭州市",
						"value": "611930"
					},
					{
						"text": "邛崃市",
						"value": "611530"
					},
					{
						"text": "崇州市",
						"value": "611230"
					}
				]
			},
			{
				"text": "自贡市",
				"value": "643000",
				"children": [
					{
						"text": "自流井区",
						"value": "643000"
					},
					{
						"text": "贡井区",
						"value": "643020"
					},
					{
						"text": "大安区",
						"value": "643010"
					},
					{
						"text": "沿滩区",
						"value": "643030"
					},
					{
						"text": "荣县",
						"value": "643100"
					},
					{
						"text": "富顺县",
						"value": "643200"
					}
				]
			},
			{
				"text": "攀枝花市",
				"value": "617000",
				"children": [
					{
						"text": "东区",
						"value": "617067"
					},
					{
						"text": "西区",
						"value": "617068"
					},
					{
						"text": "仁和区",
						"value": "617061"
					},
					{
						"text": "米易县",
						"value": "617200"
					},
					{
						"text": "盐边县",
						"value": "617100"
					}
				]
			},
			{
				"text": "泸州市",
				"value": "646000",
				"children": [
					{
						"text": "江阳区",
						"value": "646000"
					},
					{
						"text": "纳溪区",
						"value": "646300"
					},
					{
						"text": "龙马潭区",
						"value": "646000"
					},
					{
						"text": "泸县",
						"value": "646106"
					},
					{
						"text": "合江县",
						"value": "646200"
					},
					{
						"text": "叙永县",
						"value": "646400"
					},
					{
						"text": "古蔺县",
						"value": "646500"
					}
				]
			},
			{
				"text": "德阳市",
				"value": "618000",
				"children": [
					{
						"text": "旌阳区",
						"value": "618000"
					},
					{
						"text": "中江县",
						"value": "618100"
					},
					{
						"text": "罗江县",
						"value": "618500"
					},
					{
						"text": "广汉市",
						"value": "618300"
					},
					{
						"text": "什邡市",
						"value": "618400"
					},
					{
						"text": "绵竹市",
						"value": "618200"
					}
				]
			},
			{
				"text": "绵阳市",
				"value": "621000",
				"children": [
					{
						"text": "涪城区",
						"value": "621000"
					},
					{
						"text": "游仙区",
						"value": "621022"
					},
					{
						"text": "三台县",
						"value": "621100"
					},
					{
						"text": "盐亭县",
						"value": "621600"
					},
					{
						"text": "安县",
						"value": "622650"
					},
					{
						"text": "梓潼县",
						"value": "622150"
					},
					{
						"text": "北川羌族自治县",
						"value": "622750"
					},
					{
						"text": "平武县",
						"value": "622550"
					},
					{
						"text": "江油市",
						"value": "621700"
					}
				]
			},
			{
				"text": "广元市",
				"value": "628000",
				"children": [
					{
						"text": "利州区",
						"value": "628017"
					},
					{
						"text": "昭化区",
						"value": "628017"
					},
					{
						"text": "朝天区",
						"value": "628017"
					},
					{
						"text": "旺苍县",
						"value": "628200"
					},
					{
						"text": "青川县",
						"value": "628100"
					},
					{
						"text": "剑阁县",
						"value": "628300"
					},
					{
						"text": "苍溪县",
						"value": "628400"
					}
				]
			},
			{
				"text": "遂宁市",
				"value": "629000",
				"children": [
					{
						"text": "船山区",
						"value": "629000"
					},
					{
						"text": "安居区",
						"value": "629000"
					},
					{
						"text": "蓬溪县",
						"value": "629100"
					},
					{
						"text": "射洪县",
						"value": "629200"
					},
					{
						"text": "大英县",
						"value": "629300"
					}
				]
			},
			{
				"text": "内江市",
				"value": "641000",
				"children": [
					{
						"text": "市中区",
						"value": "641000"
					},
					{
						"text": "东兴区",
						"value": "641100"
					},
					{
						"text": "威远县",
						"value": "642450"
					},
					{
						"text": "资中县",
						"value": "641200"
					},
					{
						"text": "隆昌县",
						"value": "642150"
					}
				]
			},
			{
				"text": "乐山市",
				"value": "614000",
				"children": [
					{
						"text": "市中区",
						"value": "614000"
					},
					{
						"text": "沙湾区",
						"value": "614900"
					},
					{
						"text": "五通桥区",
						"value": "614800"
					},
					{
						"text": "金口河区",
						"value": "614700"
					},
					{
						"text": "犍为县",
						"value": "614400"
					},
					{
						"text": "井研县",
						"value": "613100"
					},
					{
						"text": "夹江县",
						"value": "614100"
					},
					{
						"text": "沐川县",
						"value": "614500"
					},
					{
						"text": "峨边彝族自治县",
						"value": "614300"
					},
					{
						"text": "马边彝族自治县",
						"value": "614600"
					},
					{
						"text": "峨眉山市",
						"value": "614200"
					}
				]
			},
			{
				"text": "南充市",
				"value": "637000",
				"children": [
					{
						"text": "顺庆区",
						"value": "637000"
					},
					{
						"text": "高坪区",
						"value": "637100"
					},
					{
						"text": "嘉陵区",
						"value": "637100"
					},
					{
						"text": "南部县",
						"value": "637300"
					},
					{
						"text": "营山县",
						"value": "637700"
					},
					{
						"text": "蓬安县",
						"value": "637800"
					},
					{
						"text": "仪陇县",
						"value": "637600"
					},
					{
						"text": "西充县",
						"value": "637200"
					},
					{
						"text": "阆中市",
						"value": "637400"
					}
				]
			},
			{
				"text": "眉山市",
				"value": "620020",
				"children": [
					{
						"text": "东坡区",
						"value": "620010"
					},
					{
						"text": "彭山区",
						"value": "620860"
					},
					{
						"text": "仁寿县",
						"value": "620500"
					},
					{
						"text": "洪雅县",
						"value": "620360"
					},
					{
						"text": "丹棱县",
						"value": "620200"
					},
					{
						"text": "青神县",
						"value": "620460"
					}
				]
			},
			{
				"text": "宜宾市",
				"value": "644000",
				"children": [
					{
						"text": "翠屏区",
						"value": "644000"
					},
					{
						"text": "南溪区",
						"value": "644100"
					},
					{
						"text": "宜宾县",
						"value": "644600"
					},
					{
						"text": "江安县",
						"value": "644200"
					},
					{
						"text": "长宁县",
						"value": "644300"
					},
					{
						"text": "高县",
						"value": "645150"
					},
					{
						"text": "珙县",
						"value": "644500"
					},
					{
						"text": "筠连县",
						"value": "645250"
					},
					{
						"text": "兴文县",
						"value": "644400"
					},
					{
						"text": "屏山县",
						"value": "645350"
					}
				]
			},
			{
				"text": "广安市",
				"value": "638000",
				"children": [
					{
						"text": "广安区",
						"value": "638000"
					},
					{
						"text": "前锋区",
						"value": "638019"
					},
					{
						"text": "岳池县",
						"value": "638300"
					},
					{
						"text": "武胜县",
						"value": "638400"
					},
					{
						"text": "邻水县",
						"value": "638500"
					},
					{
						"text": "华蓥市",
						"value": "638600"
					}
				]
			},
			{
				"text": "达州市",
				"value": "635000",
				"children": [
					{
						"text": "通川区",
						"value": "635000"
					},
					{
						"text": "达川区",
						"value": "635000"
					},
					{
						"text": "宣汉县",
						"value": "636150"
					},
					{
						"text": "开江县",
						"value": "636250"
					},
					{
						"text": "大竹县",
						"value": "635100"
					},
					{
						"text": "渠县",
						"value": "635200"
					},
					{
						"text": "万源市",
						"value": "636350"
					}
				]
			},
			{
				"text": "雅安市",
				"value": "625000",
				"children": [
					{
						"text": "雨城区",
						"value": "625000"
					},
					{
						"text": "名山区",
						"value": "625100"
					},
					{
						"text": "荥经县",
						"value": "625200"
					},
					{
						"text": "汉源县",
						"value": "625300"
					},
					{
						"text": "石棉县",
						"value": "625400"
					},
					{
						"text": "天全县",
						"value": "625500"
					},
					{
						"text": "芦山县",
						"value": "625600"
					},
					{
						"text": "宝兴县",
						"value": "625700"
					}
				]
			},
			{
				"text": "巴中市",
				"value": "636000",
				"children": [
					{
						"text": "巴州区",
						"value": "636001"
					},
					{
						"text": "恩阳区",
						"value": "636064"
					},
					{
						"text": "通江县",
						"value": "636700"
					},
					{
						"text": "南江县",
						"value": "636600"
					},
					{
						"text": "平昌县",
						"value": "636400"
					}
				]
			},
			{
				"text": "资阳市",
				"value": "641300",
				"children": [
					{
						"text": "雁江区",
						"value": "641300"
					},
					{
						"text": "安岳县",
						"value": "642350"
					},
					{
						"text": "乐至县",
						"value": "641500"
					},
					{
						"text": "简阳市",
						"value": "641400"
					}
				]
			},
			{
				"text": "阿坝藏族羌族自治州",
				"value": "624000",
				"children": [
					{
						"text": "汶川县",
						"value": "623000"
					},
					{
						"text": "理县",
						"value": "623100"
					},
					{
						"text": "茂县",
						"value": "623200"
					},
					{
						"text": "松潘县",
						"value": "623300"
					},
					{
						"text": "九寨沟县",
						"value": "623400"
					},
					{
						"text": "金川县",
						"value": "624100"
					},
					{
						"text": "小金县",
						"value": "624200"
					},
					{
						"text": "黑水县",
						"value": "623500"
					},
					{
						"text": "马尔康县",
						"value": "624000"
					},
					{
						"text": "壤塘县",
						"value": "624300"
					},
					{
						"text": "阿坝县",
						"value": "624600"
					},
					{
						"text": "若尔盖县",
						"value": "624500"
					},
					{
						"text": "红原县",
						"value": "624400"
					}
				]
			},
			{
				"text": "甘孜藏族自治州",
				"value": "626000",
				"children": [
					{
						"text": "康定县",
						"value": "626000"
					},
					{
						"text": "泸定县",
						"value": "626100"
					},
					{
						"text": "丹巴县",
						"value": "626300"
					},
					{
						"text": "九龙县",
						"value": "626200"
					},
					{
						"text": "雅江县",
						"value": "627450"
					},
					{
						"text": "道孚县",
						"value": "626400"
					},
					{
						"text": "炉霍县",
						"value": "626500"
					},
					{
						"text": "甘孜县",
						"value": "626700"
					},
					{
						"text": "新龙县",
						"value": "626800"
					},
					{
						"text": "德格县",
						"value": "627250"
					},
					{
						"text": "白玉县",
						"value": "627150"
					},
					{
						"text": "石渠县",
						"value": "627350"
					},
					{
						"text": "色达县",
						"value": "626600"
					},
					{
						"text": "理塘县",
						"value": "627550"
					},
					{
						"text": "巴塘县",
						"value": "627650"
					},
					{
						"text": "乡城县",
						"value": "627850"
					},
					{
						"text": "稻城县",
						"value": "627750"
					},
					{
						"text": "得荣县",
						"value": "627950"
					}
				]
			},
			{
				"text": "凉山彝族自治州",
				"value": "615000",
				"children": [
					{
						"text": "西昌市",
						"value": "615000"
					},
					{
						"text": "木里藏族自治县",
						"value": "615800"
					},
					{
						"text": "盐源县",
						"value": "615700"
					},
					{
						"text": "德昌县",
						"value": "615500"
					},
					{
						"text": "会理县",
						"value": "615100"
					},
					{
						"text": "会东县",
						"value": "615200"
					},
					{
						"text": "宁南县",
						"value": "615400"
					},
					{
						"text": "普格县",
						"value": "615300"
					},
					{
						"text": "布拖县",
						"value": "616350"
					},
					{
						"text": "金阳县",
						"value": "616250"
					},
					{
						"text": "昭觉县",
						"value": "616150"
					},
					{
						"text": "喜德县",
						"value": "616750"
					},
					{
						"text": "冕宁县",
						"value": "615600"
					},
					{
						"text": "越西县",
						"value": "616650"
					},
					{
						"text": "甘洛县",
						"value": "616850"
					},
					{
						"text": "美姑县",
						"value": "616450"
					},
					{
						"text": "雷波县",
						"value": "616550"
					}
				]
			}
		]
	},
	{
		"text": "贵州省",
		"value": "550000",
		"children": [
			{
				"text": "贵阳市",
				"value": "550001",
				"children": [
					{
						"text": "南明区",
						"value": "550001"
					},
					{
						"text": "云岩区",
						"value": "550001"
					},
					{
						"text": "花溪区",
						"value": "550025"
					},
					{
						"text": "乌当区",
						"value": "550018"
					},
					{
						"text": "白云区",
						"value": "550014"
					},
					{
						"text": "观山湖区",
						"value": "550009"
					},
					{
						"text": "开阳县",
						"value": "550300"
					},
					{
						"text": "息烽县",
						"value": "551100"
					},
					{
						"text": "修文县",
						"value": "550200"
					},
					{
						"text": "清镇市",
						"value": "551400"
					}
				]
			},
			{
				"text": "六盘水市",
				"value": "553400",
				"children": [
					{
						"text": "钟山区",
						"value": "553000"
					},
					{
						"text": "六枝特区",
						"value": "553400"
					},
					{
						"text": "水城县",
						"value": "553000"
					},
					{
						"text": "盘县",
						"value": "561601"
					}
				]
			},
			{
				"text": "遵义市",
				"value": "563000",
				"children": [
					{
						"text": "红花岗区",
						"value": "563000"
					},
					{
						"text": "汇川区",
						"value": "563000"
					},
					{
						"text": "遵义县",
						"value": "563100"
					},
					{
						"text": "桐梓县",
						"value": "563200"
					},
					{
						"text": "绥阳县",
						"value": "563300"
					},
					{
						"text": "正安县",
						"value": "563400"
					},
					{
						"text": "道真仡佬族苗族自治县",
						"value": "563500"
					},
					{
						"text": "务川仡佬族苗族自治县",
						"value": "564300"
					},
					{
						"text": "凤冈县",
						"value": "564200"
					},
					{
						"text": "湄潭县",
						"value": "564100"
					},
					{
						"text": "余庆县",
						"value": "564400"
					},
					{
						"text": "习水县",
						"value": "564600"
					},
					{
						"text": "赤水市",
						"value": "564700"
					},
					{
						"text": "仁怀市",
						"value": "564500"
					}
				]
			},
			{
				"text": "安顺市",
				"value": "561000",
				"children": [
					{
						"text": "西秀区",
						"value": "561000"
					},
					{
						"text": "平坝区",
						"value": "561100"
					},
					{
						"text": "普定县",
						"value": "562100"
					},
					{
						"text": "镇宁布依族苗族自治县",
						"value": "561200"
					},
					{
						"text": "关岭布依族苗族自治县",
						"value": "561300"
					},
					{
						"text": "紫云苗族布依族自治县",
						"value": "550800"
					}
				]
			},
			{
				"text": "毕节市",
				"value": "551700",
				"children": [
					{
						"text": "七星关区",
						"value": "551700"
					},
					{
						"text": "大方县",
						"value": "551600"
					},
					{
						"text": "黔西县",
						"value": "551500"
					},
					{
						"text": "金沙县",
						"value": "551800"
					},
					{
						"text": "织金县",
						"value": "552100"
					},
					{
						"text": "纳雍县",
						"value": "553300"
					},
					{
						"text": "威宁彝族回族苗族自治县",
						"value": "553100"
					},
					{
						"text": "赫章县",
						"value": "553200"
					}
				]
			},
			{
				"text": "铜仁市",
				"value": "554300",
				"children": [
					{
						"text": "碧江区",
						"value": "554300"
					},
					{
						"text": "万山区",
						"value": "554200"
					},
					{
						"text": "江口县",
						"value": "554400"
					},
					{
						"text": "玉屏侗族自治县",
						"value": "554004"
					},
					{
						"text": "石阡县",
						"value": "555100"
					},
					{
						"text": "思南县",
						"value": "565100"
					},
					{
						"text": "印江土家族苗族自治县",
						"value": "555200"
					},
					{
						"text": "德江县",
						"value": "565200"
					},
					{
						"text": "沿河土家族自治县",
						"value": "565300"
					},
					{
						"text": "松桃苗族自治县",
						"value": "554100"
					}
				]
			},
			{
				"text": "黔西南布依族苗族自治州",
				"value": "562400",
				"children": [
					{
						"text": "兴义市 ",
						"value": "562400"
					},
					{
						"text": "兴仁县",
						"value": "562300"
					},
					{
						"text": "普安县",
						"value": "561500"
					},
					{
						"text": "晴隆县",
						"value": "561400"
					},
					{
						"text": "贞丰县",
						"value": "562200"
					},
					{
						"text": "望谟县",
						"value": "552300"
					},
					{
						"text": "册亨县",
						"value": "552200"
					},
					{
						"text": "安龙县",
						"value": "552400"
					}
				]
			},
			{
				"text": "黔东南苗族侗族自治州",
				"value": "556000",
				"children": [
					{
						"text": "凯里市",
						"value": "556000"
					},
					{
						"text": "黄平县",
						"value": "556100"
					},
					{
						"text": "施秉县",
						"value": "556200"
					},
					{
						"text": "三穗县",
						"value": "556500"
					},
					{
						"text": "镇远县",
						"value": "557700"
					},
					{
						"text": "岑巩县",
						"value": "557800"
					},
					{
						"text": "天柱县",
						"value": "556600"
					},
					{
						"text": "锦屏县",
						"value": "556700"
					},
					{
						"text": "剑河县",
						"value": "556400"
					},
					{
						"text": "台江县",
						"value": "556300"
					},
					{
						"text": "黎平县",
						"value": "557300"
					},
					{
						"text": "榕江县",
						"value": "557200"
					},
					{
						"text": "从江县",
						"value": "557400"
					},
					{
						"text": "雷山县",
						"value": "557100"
					},
					{
						"text": "麻江县",
						"value": "557600"
					},
					{
						"text": "丹寨县",
						"value": "557500"
					}
				]
			},
			{
				"text": "黔南布依族苗族自治州",
				"value": "558000",
				"children": [
					{
						"text": "都匀市",
						"value": "558000"
					},
					{
						"text": "福泉市",
						"value": "550500"
					},
					{
						"text": "荔波县",
						"value": "558400"
					},
					{
						"text": "贵定县",
						"value": "551300"
					},
					{
						"text": "瓮安县",
						"value": "550400"
					},
					{
						"text": "独山县",
						"value": "558200"
					},
					{
						"text": "平塘县",
						"value": "558300"
					},
					{
						"text": "罗甸县",
						"value": "550100"
					},
					{
						"text": "长顺县",
						"value": "550700"
					},
					{
						"text": "龙里县",
						"value": "551200"
					},
					{
						"text": "惠水县",
						"value": "550600"
					},
					{
						"text": "三都水族自治县",
						"value": "558100"
					}
				]
			}
		]
	},
	{
		"text": "云南省",
		"value": "650000",
		"children": [
			{
				"text": "昆明市",
				"value": "650500",
				"children": [
					{
						"text": "五华区",
						"value": "650021"
					},
					{
						"text": "盘龙区",
						"value": "650051"
					},
					{
						"text": "官渡区",
						"value": "650200"
					},
					{
						"text": "西山区",
						"value": "650118"
					},
					{
						"text": "东川区",
						"value": "654100"
					},
					{
						"text": "呈贡区",
						"value": "650500"
					},
					{
						"text": "晋宁县",
						"value": "650600"
					},
					{
						"text": "富民县",
						"value": "650400"
					},
					{
						"text": "宜良县",
						"value": "652100"
					},
					{
						"text": "石林彝族自治县",
						"value": "652200"
					},
					{
						"text": "嵩明县",
						"value": "651700"
					},
					{
						"text": "禄劝彝族苗族自治县",
						"value": "651500"
					},
					{
						"text": "寻甸回族彝族自治县 ",
						"value": "655200"
					},
					{
						"text": "安宁市",
						"value": "650300"
					}
				]
			},
			{
				"text": "曲靖市",
				"value": "655000",
				"children": [
					{
						"text": "麒麟区",
						"value": "655000"
					},
					{
						"text": "马龙县",
						"value": "655100"
					},
					{
						"text": "陆良县",
						"value": "655600"
					},
					{
						"text": "师宗县",
						"value": "655700"
					},
					{
						"text": "罗平县",
						"value": "655800"
					},
					{
						"text": "富源县",
						"value": "655500"
					},
					{
						"text": "会泽县",
						"value": "654200"
					},
					{
						"text": "沾益县",
						"value": "655331"
					},
					{
						"text": "宣威市",
						"value": "655400"
					}
				]
			},
			{
				"text": "玉溪市",
				"value": "653100",
				"children": [
					{
						"text": "红塔区",
						"value": "653100"
					},
					{
						"text": "江川县",
						"value": "652600"
					},
					{
						"text": "澄江县",
						"value": "652500"
					},
					{
						"text": "通海县",
						"value": "652700"
					},
					{
						"text": "华宁县",
						"value": "652800"
					},
					{
						"text": "易门县",
						"value": "651100"
					},
					{
						"text": "峨山彝族自治县",
						"value": "653200"
					},
					{
						"text": "新平彝族傣族自治县",
						"value": "653400"
					},
					{
						"text": "元江哈尼族彝族傣族自治县",
						"value": "653300"
					}
				]
			},
			{
				"text": "保山市",
				"value": "678000",
				"children": [
					{
						"text": "隆阳区",
						"value": "678000"
					},
					{
						"text": "施甸县",
						"value": "678200"
					},
					{
						"text": "腾冲县",
						"value": "679100"
					},
					{
						"text": "龙陵县",
						"value": "678300"
					},
					{
						"text": "昌宁县",
						"value": "678100"
					}
				]
			},
			{
				"text": "昭通市",
				"value": "657000",
				"children": [
					{
						"text": "昭阳区",
						"value": "657000"
					},
					{
						"text": "鲁甸县",
						"value": "657100"
					},
					{
						"text": "巧家县",
						"value": "654600"
					},
					{
						"text": "盐津县",
						"value": "657500"
					},
					{
						"text": "大关县",
						"value": "657400"
					},
					{
						"text": "永善县",
						"value": "657300"
					},
					{
						"text": "绥江县",
						"value": "657700"
					},
					{
						"text": "镇雄县",
						"value": "657200"
					},
					{
						"text": "彝良县",
						"value": "657600"
					},
					{
						"text": "威信县",
						"value": "657900"
					},
					{
						"text": "水富县",
						"value": "657800"
					}
				]
			},
			{
				"text": "丽江市",
				"value": "674100",
				"children": [
					{
						"text": "古城区",
						"value": "674100"
					},
					{
						"text": "玉龙纳西族自治县",
						"value": "674100"
					},
					{
						"text": "永胜县",
						"value": "674200"
					},
					{
						"text": "华坪县",
						"value": "674800"
					},
					{
						"text": "宁蒗彝族自治县",
						"value": "674300"
					}
				]
			},
			{
				"text": "普洱市",
				"value": "665000",
				"children": [
					{
						"text": "思茅区",
						"value": "665000"
					},
					{
						"text": "宁洱哈尼族彝族自治县",
						"value": "665100"
					},
					{
						"text": "墨江哈尼族自治县",
						"value": "654800"
					},
					{
						"text": "景东彝族自治县",
						"value": "676200"
					},
					{
						"text": "景谷傣族彝族自治县",
						"value": "666400"
					},
					{
						"text": "镇沅彝族哈尼族拉祜族自治县",
						"value": "666500"
					},
					{
						"text": "江城哈尼族彝族自治县",
						"value": "665900"
					},
					{
						"text": "孟连傣族拉祜族佤族自治县",
						"value": "665800"
					},
					{
						"text": "澜沧拉祜族自治县",
						"value": "665600"
					},
					{
						"text": "西盟佤族自治县",
						"value": "665700"
					}
				]
			},
			{
				"text": "临沧市",
				"value": "677000",
				"children": [
					{
						"text": "临翔区",
						"value": "677000"
					},
					{
						"text": "凤庆县",
						"value": "675900"
					},
					{
						"text": "云县",
						"value": "675800"
					},
					{
						"text": "永德县",
						"value": "677600"
					},
					{
						"text": "镇康县",
						"value": "677704"
					},
					{
						"text": "双江拉祜族佤族布朗族傣族自治县",
						"value": "677300"
					},
					{
						"text": "耿马傣族佤族自治县",
						"value": "677500"
					},
					{
						"text": "沧源佤族自治县",
						"value": "677400"
					}
				]
			},
			{
				"text": "楚雄彝族自治州",
				"value": "675000",
				"children": [
					{
						"text": "楚雄市",
						"value": "675000"
					},
					{
						"text": "双柏县",
						"value": "675100"
					},
					{
						"text": "牟定县",
						"value": "675500"
					},
					{
						"text": "南华县",
						"value": "675200"
					},
					{
						"text": "姚安县",
						"value": "675300"
					},
					{
						"text": "大姚县",
						"value": "675400"
					},
					{
						"text": "永仁县",
						"value": "651400"
					},
					{
						"text": "元谋县",
						"value": "651300"
					},
					{
						"text": "武定县",
						"value": "651600"
					},
					{
						"text": "禄丰县",
						"value": "651200"
					}
				]
			},
			{
				"text": "红河哈尼族彝族自治州",
				"value": "661400",
				"children": [
					{
						"text": "个旧市",
						"value": "661000"
					},
					{
						"text": "开远市",
						"value": "661600"
					},
					{
						"text": "蒙自市",
						"value": "661101"
					},
					{
						"text": "弥勒市",
						"value": "652300"
					},
					{
						"text": "屏边苗族自治县",
						"value": "661200"
					},
					{
						"text": "建水县",
						"value": "654300"
					},
					{
						"text": "石屏县",
						"value": "662200"
					},
					{
						"text": "泸西县",
						"value": "652400"
					},
					{
						"text": "元阳县",
						"value": "662400"
					},
					{
						"text": "红河县",
						"value": "654400"
					},
					{
						"text": "金平苗族瑶族傣族自治县",
						"value": "661500"
					},
					{
						"text": "绿春县",
						"value": "662500"
					},
					{
						"text": "河口瑶族自治县",
						"value": "661300"
					}
				]
			},
			{
				"text": "文山壮族苗族自治州",
				"value": "663000",
				"children": [
					{
						"text": "文山市",
						"value": "663000"
					},
					{
						"text": "砚山县",
						"value": "663100"
					},
					{
						"text": "西畴县",
						"value": "663500"
					},
					{
						"text": "麻栗坡县",
						"value": "663600"
					},
					{
						"text": "马关县",
						"value": "663700"
					},
					{
						"text": "丘北县",
						"value": "663200"
					},
					{
						"text": "广南县",
						"value": "663300"
					},
					{
						"text": "富宁县",
						"value": "663400"
					}
				]
			},
			{
				"text": "西双版纳傣族自治州",
				"value": "666100",
				"children": [
					{
						"text": "景洪市",
						"value": "666100"
					},
					{
						"text": "勐海县",
						"value": "666200"
					},
					{
						"text": "勐腊县",
						"value": "666300"
					}
				]
			},
			{
				"text": "大理白族自治州",
				"value": "671000",
				"children": [
					{
						"text": "大理市",
						"value": "671000"
					},
					{
						"text": "漾濞彝族自治县",
						"value": "672500"
					},
					{
						"text": "祥云县",
						"value": "672100"
					},
					{
						"text": "宾川县",
						"value": "671600"
					},
					{
						"text": "弥渡县",
						"value": "675600"
					},
					{
						"text": "南涧彝族自治县",
						"value": "675700"
					},
					{
						"text": "巍山彝族回族自治县",
						"value": "672400"
					},
					{
						"text": "永平县",
						"value": "672600"
					},
					{
						"text": "云龙县",
						"value": "672700"
					},
					{
						"text": "洱源县",
						"value": "671200"
					},
					{
						"text": "剑川县",
						"value": "671300"
					},
					{
						"text": "鹤庆县",
						"value": "671500"
					}
				]
			},
			{
				"text": "德宏傣族景颇族自治州",
				"value": "678400",
				"children": [
					{
						"text": "瑞丽市",
						"value": "678600"
					},
					{
						"text": "芒市",
						"value": "678400"
					},
					{
						"text": "梁河县",
						"value": "679200"
					},
					{
						"text": "盈江县",
						"value": "679300"
					},
					{
						"text": "陇川县",
						"value": "678700"
					}
				]
			},
			{
				"text": "怒江傈僳族自治州",
				"value": "673100",
				"children": [
					{
						"text": "泸水县",
						"value": "673100"
					},
					{
						"text": "福贡县",
						"value": "673400"
					},
					{
						"text": "贡山独龙族怒族自治县",
						"value": "673500"
					},
					{
						"text": "兰坪白族普米族自治县",
						"value": "671400"
					}
				]
			},
			{
				"text": "迪庆藏族自治州",
				"value": "674400",
				"children": [
					{
						"text": "香格里拉市",
						"value": "674400"
					},
					{
						"text": "德钦县",
						"value": "674500"
					},
					{
						"text": "维西傈僳族自治县",
						"value": "674600"
					}
				]
			}
		]
	},
	{
		"text": "西藏自治区",
		"value": "850000",
		"children": [
			{
				"text": "拉萨市",
				"value": "850000",
				"children": [
					{
						"text": "城关区",
						"value": "850000"
					},
					{
						"text": "林周县",
						"value": "851600"
					},
					{
						"text": "当雄县",
						"value": "851500"
					},
					{
						"text": "尼木县",
						"value": "851300"
					},
					{
						"text": "曲水县",
						"value": "850600"
					},
					{
						"text": "堆龙德庆县",
						"value": "851400"
					},
					{
						"text": "达孜县",
						"value": "850100"
					},
					{
						"text": "墨竹工卡县",
						"value": "850200"
					}
				]
			},
			{
				"text": "日喀则市",
				"value": "857000",
				"children": [
					{
						"text": "桑珠孜区",
						"value": "857000"
					},
					{
						"text": "南木林县",
						"value": "857100"
					},
					{
						"text": "江孜县",
						"value": "857400"
					},
					{
						"text": "定日县",
						"value": "858200"
					},
					{
						"text": "萨迦县",
						"value": "857800"
					},
					{
						"text": "拉孜县",
						"value": "858100"
					},
					{
						"text": "昂仁县",
						"value": "858500"
					},
					{
						"text": "谢通门县",
						"value": "858900"
					},
					{
						"text": "白朗县",
						"value": "857300"
					},
					{
						"text": "仁布县",
						"value": "857200"
					},
					{
						"text": "康马县",
						"value": "857500"
					},
					{
						"text": "定结县",
						"value": "857900"
					},
					{
						"text": "仲巴县",
						"value": "858800"
					},
					{
						"text": "亚东县",
						"value": "857600"
					},
					{
						"text": "吉隆县",
						"value": "858700"
					},
					{
						"text": "聂拉木县",
						"value": "858300"
					},
					{
						"text": "萨嘎县",
						"value": "857800"
					},
					{
						"text": "岗巴县",
						"value": "857700"
					}
				]
			},
			{
				"text": "昌都市",
				"value": "854000",
				"children": [
					{
						"text": "卡若区",
						"value": "854000"
					},
					{
						"text": "江达县",
						"value": "854100"
					},
					{
						"text": "贡觉县",
						"value": "854200"
					},
					{
						"text": "类乌齐县",
						"value": "855600"
					},
					{
						"text": "丁青县",
						"value": "855700"
					},
					{
						"text": "察雅县",
						"value": "854300"
					},
					{
						"text": "八宿县",
						"value": "854600"
					},
					{
						"text": "左贡县",
						"value": "854400"
					},
					{
						"text": "芒康县",
						"value": "854500"
					},
					{
						"text": "洛隆县",
						"value": "855400"
					},
					{
						"text": "边坝县",
						"value": "855500"
					}
				]
			},
			{
				"text": "山南地区",
				"value": "856000",
				"children": [
					{
						"text": "乃东县",
						"value": "856100"
					},
					{
						"text": "扎囊县",
						"value": "850800"
					},
					{
						"text": "贡嘎县",
						"value": "850700"
					},
					{
						"text": "桑日县",
						"value": "856200"
					},
					{
						"text": "琼结县",
						"value": "856800"
					},
					{
						"text": "曲松县",
						"value": "856300"
					},
					{
						"text": "措美县",
						"value": "856900"
					},
					{
						"text": "洛扎县",
						"value": "856600"
					},
					{
						"text": "加查县",
						"value": "856400"
					},
					{
						"text": "隆子县",
						"value": "856600"
					},
					{
						"text": "错那县",
						"value": "856700"
					},
					{
						"text": "浪卡子县",
						"value": "851100"
					}
				]
			},
			{
				"text": "那曲地区",
				"value": "852000",
				"children": [
					{
						"text": "那曲县",
						"value": "852000"
					},
					{
						"text": "嘉黎县",
						"value": "852400"
					},
					{
						"text": "比如县",
						"value": "852300"
					},
					{
						"text": "聂荣县",
						"value": "853500"
					},
					{
						"text": "安多县",
						"value": "853400"
					},
					{
						"text": "申扎县",
						"value": "853100"
					},
					{
						"text": "索县",
						"value": "852200"
					},
					{
						"text": "班戈县",
						"value": "852500"
					},
					{
						"text": "巴青县",
						"value": "852100"
					},
					{
						"text": "尼玛县",
						"value": "852600"
					},
					{
						"text": "双湖县",
						"value": "852600"
					}
				]
			},
			{
				"text": "阿里地区",
				"value": "859000",
				"children": [
					{
						"text": "普兰县",
						"value": "859500"
					},
					{
						"text": "札达县",
						"value": "859600"
					},
					{
						"text": "噶尔县",
						"value": "859400"
					},
					{
						"text": "日土县",
						"value": "859700"
					},
					{
						"text": "革吉县",
						"value": "859100"
					},
					{
						"text": "改则县",
						"value": "859200"
					},
					{
						"text": "措勤县",
						"value": "859300"
					}
				]
			},
			{
				"text": "林芝地区",
				"value": "850400",
				"children": [
					{
						"text": "林芝县",
						"value": "850400"
					},
					{
						"text": "工布江达县",
						"value": "850300"
					},
					{
						"text": "米林县",
						"value": "850500"
					},
					{
						"text": "墨脱县",
						"value": "855300"
					},
					{
						"text": "波密县",
						"value": "855200"
					},
					{
						"text": "察隅县",
						"value": "855100"
					},
					{
						"text": "朗县",
						"value": "856500"
					}
				]
			}
		]
	},
	{
		"text": "陕西省",
		"value": "710000",
		"children": [
			{
				"text": "西安市",
				"value": "710003",
				"children": [
					{
						"text": "新城区",
						"value": "710004"
					},
					{
						"text": "碑林区",
						"value": "710001"
					},
					{
						"text": "莲湖区",
						"value": "710003"
					},
					{
						"text": "灞桥区",
						"value": "710038"
					},
					{
						"text": "未央区",
						"value": "710014"
					},
					{
						"text": "雁塔区",
						"value": "710061"
					},
					{
						"text": "阎良区",
						"value": "710087"
					},
					{
						"text": "临潼区",
						"value": "710600"
					},
					{
						"text": "长安区",
						"value": "710100"
					},
					{
						"text": "蓝田县",
						"value": "710500"
					},
					{
						"text": "周至县",
						"value": "710400"
					},
					{
						"text": "户县",
						"value": "710300"
					},
					{
						"text": "高陵区",
						"value": "710200"
					}
				]
			},
			{
				"text": "铜川市",
				"value": "727100",
				"children": [
					{
						"text": "王益区",
						"value": "727000"
					},
					{
						"text": "印台区",
						"value": "727007"
					},
					{
						"text": "耀州区",
						"value": "727100"
					},
					{
						"text": "宜君县",
						"value": "727200"
					}
				]
			},
			{
				"text": "宝鸡市",
				"value": "721000",
				"children": [
					{
						"text": "渭滨区",
						"value": "721000"
					},
					{
						"text": "金台区",
						"value": "721000"
					},
					{
						"text": "陈仓区",
						"value": "721300"
					},
					{
						"text": "凤翔县",
						"value": "721400"
					},
					{
						"text": "岐山县",
						"value": "722400"
					},
					{
						"text": "扶风县",
						"value": "722200"
					},
					{
						"text": "眉县",
						"value": "722300"
					},
					{
						"text": "陇县",
						"value": "721200"
					},
					{
						"text": "千阳县",
						"value": "721100"
					},
					{
						"text": "麟游县",
						"value": "721500"
					},
					{
						"text": "凤县",
						"value": "721700"
					},
					{
						"text": "太白县",
						"value": "721600"
					}
				]
			},
			{
				"text": "咸阳市",
				"value": "712000",
				"children": [
					{
						"text": "秦都区",
						"value": "712000"
					},
					{
						"text": "杨陵区",
						"value": "712100"
					},
					{
						"text": "渭城区",
						"value": "712000"
					},
					{
						"text": "三原县",
						"value": "713800"
					},
					{
						"text": "泾阳县",
						"value": "713700"
					},
					{
						"text": "乾县",
						"value": "713300"
					},
					{
						"text": "礼泉县",
						"value": "713200"
					},
					{
						"text": "永寿县",
						"value": "713400"
					},
					{
						"text": "彬县",
						"value": "713500"
					},
					{
						"text": "长武县",
						"value": "713600"
					},
					{
						"text": "旬邑县",
						"value": "711300"
					},
					{
						"text": "淳化县",
						"value": "711200"
					},
					{
						"text": "武功县",
						"value": "712200"
					},
					{
						"text": "兴平市",
						"value": "713100"
					}
				]
			},
			{
				"text": "渭南市",
				"value": "714000",
				"children": [
					{
						"text": "临渭区",
						"value": "714000"
					},
					{
						"text": "华县",
						"value": "714100"
					},
					{
						"text": "潼关县",
						"value": "714300"
					},
					{
						"text": "大荔县",
						"value": "715100"
					},
					{
						"text": "合阳县",
						"value": "715300"
					},
					{
						"text": "澄城县",
						"value": "715200"
					},
					{
						"text": "蒲城县",
						"value": "715500"
					},
					{
						"text": "白水县",
						"value": "715600"
					},
					{
						"text": "富平县",
						"value": "711700"
					},
					{
						"text": "韩城市",
						"value": "715400"
					},
					{
						"text": "华阴市",
						"value": "714200"
					}
				]
			},
			{
				"text": "延安市",
				"value": "716000",
				"children": [
					{
						"text": "宝塔区",
						"value": "716000"
					},
					{
						"text": "延长县",
						"value": "717100"
					},
					{
						"text": "延川县",
						"value": "717200"
					},
					{
						"text": "子长县",
						"value": "717300"
					},
					{
						"text": "安塞县",
						"value": "717400"
					},
					{
						"text": "志丹县",
						"value": "717500"
					},
					{
						"text": "吴起县",
						"value": "717600"
					},
					{
						"text": "甘泉县",
						"value": "716100"
					},
					{
						"text": "富县",
						"value": "727500"
					},
					{
						"text": "洛川县",
						"value": "727400"
					},
					{
						"text": "宜川县",
						"value": "716200"
					},
					{
						"text": "黄龙县",
						"value": "715700"
					},
					{
						"text": "黄陵县",
						"value": "727300"
					}
				]
			},
			{
				"text": "汉中市",
				"value": "723000",
				"children": [
					{
						"text": "汉台区",
						"value": "723000"
					},
					{
						"text": "南郑县",
						"value": "723100"
					},
					{
						"text": "城固县",
						"value": "723200"
					},
					{
						"text": "洋县",
						"value": "723300"
					},
					{
						"text": "西乡县",
						"value": "723500"
					},
					{
						"text": "勉县",
						"value": "724200"
					},
					{
						"text": "宁强县",
						"value": "724400"
					},
					{
						"text": "略阳县",
						"value": "724300"
					},
					{
						"text": "镇巴县",
						"value": "723600"
					},
					{
						"text": "留坝县",
						"value": "724100"
					},
					{
						"text": "佛坪县",
						"value": "723400"
					}
				]
			},
			{
				"text": "榆林市",
				"value": "719000",
				"children": [
					{
						"text": "榆阳区",
						"value": "719000"
					},
					{
						"text": "神木县",
						"value": "719300"
					},
					{
						"text": "府谷县",
						"value": "719400"
					},
					{
						"text": "横山县",
						"value": "719100"
					},
					{
						"text": "靖边县",
						"value": "718500"
					},
					{
						"text": "定边县",
						"value": "718600"
					},
					{
						"text": "绥德县",
						"value": "718000"
					},
					{
						"text": "米脂县",
						"value": "718100"
					},
					{
						"text": "佳县",
						"value": "719200"
					},
					{
						"text": "吴堡县",
						"value": "718200"
					},
					{
						"text": "清涧县",
						"value": "718300"
					},
					{
						"text": "子洲县",
						"value": "718400"
					}
				]
			},
			{
				"text": "安康市",
				"value": "725000",
				"children": [
					{
						"text": "汉滨区",
						"value": "725000"
					},
					{
						"text": "汉阴县",
						"value": "725100"
					},
					{
						"text": "石泉县",
						"value": "725200"
					},
					{
						"text": "宁陕县",
						"value": "711600"
					},
					{
						"text": "紫阳县",
						"value": "725300"
					},
					{
						"text": "岚皋县",
						"value": "725400"
					},
					{
						"text": "平利县",
						"value": "725500"
					},
					{
						"text": "镇坪县",
						"value": "725600"
					},
					{
						"text": "旬阳县",
						"value": "725700"
					},
					{
						"text": "白河县",
						"value": "725800"
					}
				]
			},
			{
				"text": "商洛市",
				"value": "726000",
				"children": [
					{
						"text": "商州区",
						"value": "726000"
					},
					{
						"text": "洛南县",
						"value": "726100"
					},
					{
						"text": "丹凤县",
						"value": "726200"
					},
					{
						"text": "商南县",
						"value": "726300"
					},
					{
						"text": "山阳县",
						"value": "726400"
					},
					{
						"text": "镇安县",
						"value": "711500"
					},
					{
						"text": "柞水县",
						"value": "711400"
					}
				]
			},
			{
				"text": "西咸新区",
				"value": "712000",
				"children": [
					{
						"text": "空港新城",
						"value": "461000"
					},
					{
						"text": "沣东新城",
						"value": "710000"
					},
					{
						"text": "秦汉新城",
						"value": "712000"
					},
					{
						"text": "沣西新城",
						"value": "710000"
					},
					{
						"text": "泾河新城",
						"value": "713700"
					}
				]
			}
		]
	},
	{
		"text": "甘肃省",
		"value": "730000",
		"children": [
			{
				"text": "兰州市",
				"value": "730030",
				"children": [
					{
						"text": "城关区",
						"value": "730030"
					},
					{
						"text": "七里河区",
						"value": "730050"
					},
					{
						"text": "西固区",
						"value": "730060"
					},
					{
						"text": "安宁区",
						"value": "730070"
					},
					{
						"text": "红古区",
						"value": "730084"
					},
					{
						"text": "永登县",
						"value": "730300"
					},
					{
						"text": "皋兰县",
						"value": "730200"
					},
					{
						"text": "榆中县",
						"value": "730100"
					}
				]
			},
			{
				"text": "嘉峪关市",
				"value": "735100",
				"children": [
					{
						"text": "雄关区",
						"value": "735100"
					},
					{
						"text": "长城区",
						"value": "735106"
					},
					{
						"text": "镜铁区",
						"value": "735100"
					}
				]
			},
			{
				"text": "金昌市",
				"value": "737100",
				"children": [
					{
						"text": "金川区",
						"value": "737100"
					},
					{
						"text": "永昌县",
						"value": "737200"
					}
				]
			},
			{
				"text": "白银市",
				"value": "730900",
				"children": [
					{
						"text": "白银区",
						"value": "730900"
					},
					{
						"text": "平川区",
						"value": "730913"
					},
					{
						"text": "靖远县",
						"value": "730600"
					},
					{
						"text": "会宁县",
						"value": "730700"
					},
					{
						"text": "景泰县",
						"value": "730400"
					}
				]
			},
			{
				"text": "天水市",
				"value": "741000",
				"children": [
					{
						"text": "秦州区",
						"value": "741000"
					},
					{
						"text": "麦积区",
						"value": "741020"
					},
					{
						"text": "清水县",
						"value": "741400"
					},
					{
						"text": "秦安县",
						"value": "741600"
					},
					{
						"text": "甘谷县",
						"value": "741200"
					},
					{
						"text": "武山县",
						"value": "741300"
					},
					{
						"text": "张家川回族自治县",
						"value": "741500"
					}
				]
			},
			{
				"text": "武威市",
				"value": "733000",
				"children": [
					{
						"text": "凉州区",
						"value": "733000"
					},
					{
						"text": "民勤县",
						"value": "733300"
					},
					{
						"text": "古浪县",
						"value": "733100"
					},
					{
						"text": "天祝藏族自治县",
						"value": "733200"
					}
				]
			},
			{
				"text": "张掖市",
				"value": "734000",
				"children": [
					{
						"text": "甘州区",
						"value": "734000"
					},
					{
						"text": "肃南裕固族自治县",
						"value": "734400"
					},
					{
						"text": "民乐县",
						"value": "734500"
					},
					{
						"text": "临泽县",
						"value": "734200"
					},
					{
						"text": "高台县",
						"value": "734300"
					},
					{
						"text": "山丹县",
						"value": "734100"
					}
				]
			},
			{
				"text": "平凉市",
				"value": "744000",
				"children": [
					{
						"text": "崆峒区",
						"value": "744000"
					},
					{
						"text": "泾川县",
						"value": "744300"
					},
					{
						"text": "灵台县",
						"value": "744400"
					},
					{
						"text": "崇信县",
						"value": "744200"
					},
					{
						"text": "华亭县",
						"value": "744100"
					},
					{
						"text": "庄浪县",
						"value": "744600"
					},
					{
						"text": "静宁县",
						"value": "743400"
					}
				]
			},
			{
				"text": "酒泉市",
				"value": "735000",
				"children": [
					{
						"text": "肃州区",
						"value": "735000"
					},
					{
						"text": "金塔县",
						"value": "735300"
					},
					{
						"text": "瓜州县",
						"value": "736100"
					},
					{
						"text": "肃北蒙古族自治县",
						"value": "736300"
					},
					{
						"text": "阿克塞哈萨克族自治县",
						"value": "736400"
					},
					{
						"text": "玉门市",
						"value": "735200"
					},
					{
						"text": "敦煌市",
						"value": "736200"
					}
				]
			},
			{
				"text": "庆阳市",
				"value": "745000",
				"children": [
					{
						"text": "西峰区",
						"value": "745000"
					},
					{
						"text": "庆城县",
						"value": "745100"
					},
					{
						"text": "环县",
						"value": "745700"
					},
					{
						"text": "华池县",
						"value": "745600"
					},
					{
						"text": "合水县",
						"value": "745400"
					},
					{
						"text": "正宁县",
						"value": "745300"
					},
					{
						"text": "宁县",
						"value": "745200"
					},
					{
						"text": "镇原县",
						"value": "744500"
					}
				]
			},
			{
				"text": "定西市",
				"value": "743000",
				"children": [
					{
						"text": "安定区",
						"value": "743000"
					},
					{
						"text": "通渭县",
						"value": "743300"
					},
					{
						"text": "陇西县",
						"value": "748100"
					},
					{
						"text": "渭源县",
						"value": "748200"
					},
					{
						"text": "临洮县",
						"value": "730500"
					},
					{
						"text": "漳县",
						"value": "748300"
					},
					{
						"text": "岷县",
						"value": "748400"
					}
				]
			},
			{
				"text": "陇南市",
				"value": "746000",
				"children": [
					{
						"text": "武都区",
						"value": "746000"
					},
					{
						"text": "成县",
						"value": "742500"
					},
					{
						"text": "文县",
						"value": "746400"
					},
					{
						"text": "宕昌县",
						"value": "748500"
					},
					{
						"text": "康县",
						"value": "746500"
					},
					{
						"text": "西和县",
						"value": "742100"
					},
					{
						"text": "礼县",
						"value": "742200"
					},
					{
						"text": "徽县",
						"value": "742300"
					},
					{
						"text": "两当县",
						"value": "742400"
					}
				]
			},
			{
				"text": "临夏回族自治州",
				"value": "731100",
				"children": [
					{
						"text": "临夏市",
						"value": "731100"
					},
					{
						"text": "临夏县",
						"value": "731800"
					},
					{
						"text": "康乐县",
						"value": "731500"
					},
					{
						"text": "永靖县",
						"value": "731600"
					},
					{
						"text": "广河县",
						"value": "731300"
					},
					{
						"text": "和政县",
						"value": "731200"
					},
					{
						"text": "东乡族自治县",
						"value": "731400"
					},
					{
						"text": "积石山保安族东乡族撒拉族自治县",
						"value": "731700"
					}
				]
			},
			{
				"text": "甘南藏族自治州",
				"value": "747000",
				"children": [
					{
						"text": "合作市",
						"value": "747000"
					},
					{
						"text": "临潭县",
						"value": "747500"
					},
					{
						"text": "卓尼县",
						"value": "747600"
					},
					{
						"text": "舟曲县",
						"value": "746300"
					},
					{
						"text": "迭部县",
						"value": "747400"
					},
					{
						"text": "玛曲县",
						"value": "747300"
					},
					{
						"text": "碌曲县",
						"value": "747200"
					},
					{
						"text": "夏河县",
						"value": "747100"
					}
				]
			}
		]
	},
	{
		"text": "青海省",
		"value": "810000",
		"children": [
			{
				"text": "西宁市",
				"value": "810000",
				"children": [
					{
						"text": "城东区",
						"value": "810007"
					},
					{
						"text": "城中区",
						"value": "810000"
					},
					{
						"text": "城西区",
						"value": "810001"
					},
					{
						"text": "城北区",
						"value": "810003"
					},
					{
						"text": "大通回族土族自治县",
						"value": "810100"
					},
					{
						"text": "湟中县",
						"value": "811600"
					},
					{
						"text": "湟源县",
						"value": "812100"
					}
				]
			},
			{
				"text": "海东市",
				"value": "810700",
				"children": [
					{
						"text": "乐都区",
						"value": "810700"
					},
					{
						"text": "平安县",
						"value": "810600"
					},
					{
						"text": "民和回族土族自治县",
						"value": "810800"
					},
					{
						"text": "互助土族自治县",
						"value": "810500"
					},
					{
						"text": "化隆回族自治县",
						"value": "810900"
					},
					{
						"text": "循化撒拉族自治县",
						"value": "811100"
					}
				]
			},
			{
				"text": "海北藏族自治州",
				"value": "812200",
				"children": [
					{
						"text": "门源回族自治县",
						"value": "810300"
					},
					{
						"text": "祁连县",
						"value": "810400"
					},
					{
						"text": "海晏县",
						"value": "812200"
					},
					{
						"text": "刚察县",
						"value": "812300"
					}
				]
			},
			{
				"text": "黄南藏族自治州",
				"value": "811300",
				"children": [
					{
						"text": "同仁县",
						"value": "811300"
					},
					{
						"text": "尖扎县",
						"value": "811200"
					},
					{
						"text": "泽库县",
						"value": "811400"
					},
					{
						"text": "河南蒙古族自治县",
						"value": "811500"
					}
				]
			},
			{
				"text": "海南藏族自治州",
				"value": "813000",
				"children": [
					{
						"text": "共和县",
						"value": "813000"
					},
					{
						"text": "同德县",
						"value": "813200"
					},
					{
						"text": "贵德县",
						"value": "811700"
					},
					{
						"text": "兴海县",
						"value": "813300"
					},
					{
						"text": "贵南县",
						"value": "813100"
					}
				]
			},
			{
				"text": "果洛藏族自治州",
				"value": "814000",
				"children": [
					{
						"text": "玛沁县",
						"value": "814000"
					},
					{
						"text": "班玛县",
						"value": "814300"
					},
					{
						"text": "甘德县",
						"value": "814100"
					},
					{
						"text": "达日县",
						"value": "814200"
					},
					{
						"text": "久治县",
						"value": "624700"
					},
					{
						"text": "玛多县",
						"value": "813500"
					}
				]
			},
			{
				"text": "玉树藏族自治州",
				"value": "815000",
				"children": [
					{
						"text": "玉树市",
						"value": "815000"
					},
					{
						"text": "杂多县",
						"value": "815300"
					},
					{
						"text": "称多县",
						"value": "815100"
					},
					{
						"text": "治多县",
						"value": "815400"
					},
					{
						"text": "囊谦县",
						"value": "815200"
					},
					{
						"text": "曲麻莱县",
						"value": "815500"
					}
				]
			},
			{
				"text": "海西蒙古族藏族自治州",
				"value": "817000",
				"children": [
					{
						"text": "格尔木市",
						"value": "816000"
					},
					{
						"text": "德令哈市",
						"value": "817000"
					},
					{
						"text": "乌兰县",
						"value": "817100"
					},
					{
						"text": "都兰县",
						"value": "816100"
					},
					{
						"text": "天峻县",
						"value": "817200"
					}
				]
			}
		]
	},
	{
		"text": "宁夏回族自治区",
		"value": "750000",
		"children": [
			{
				"text": "银川市",
				"value": "750004",
				"children": [
					{
						"text": "兴庆区",
						"value": "750001"
					},
					{
						"text": "西夏区",
						"value": "750021"
					},
					{
						"text": "金凤区",
						"value": "750011"
					},
					{
						"text": "永宁县",
						"value": "750100"
					},
					{
						"text": "贺兰县",
						"value": "750200"
					},
					{
						"text": "灵武市",
						"value": "750004"
					}
				]
			},
			{
				"text": "石嘴山市",
				"value": "753000",
				"children": [
					{
						"text": "大武口区",
						"value": "753000"
					},
					{
						"text": "惠农区",
						"value": "753600"
					},
					{
						"text": "平罗县",
						"value": "753400"
					}
				]
			},
			{
				"text": "吴忠市",
				"value": "751100",
				"children": [
					{
						"text": "利通区",
						"value": "751100"
					},
					{
						"text": "红寺堡区",
						"value": "751900"
					},
					{
						"text": "盐池县",
						"value": "751500"
					},
					{
						"text": "同心县",
						"value": "751300"
					},
					{
						"text": "青铜峡市",
						"value": "751600"
					}
				]
			},
			{
				"text": "固原市",
				"value": "756000",
				"children": [
					{
						"text": "原州区",
						"value": "756000"
					},
					{
						"text": "西吉县",
						"value": "756200"
					},
					{
						"text": "隆德县",
						"value": "756300"
					},
					{
						"text": "泾源县",
						"value": "756400"
					},
					{
						"text": "彭阳县",
						"value": "756500"
					}
				]
			},
			{
				"text": "中卫市",
				"value": "751700",
				"children": [
					{
						"text": "沙坡头区",
						"value": "755000"
					},
					{
						"text": "中宁县",
						"value": "751200"
					},
					{
						"text": "海原县",
						"value": "751800"
					}
				]
			}
		]
	},
	{
		"text": "新疆维吾尔自治区",
		"value": "848000",
		"children": [
			{
				"text": "乌鲁木齐市",
				"value": "830002",
				"children": [
					{
						"text": "天山区",
						"value": "830002"
					},
					{
						"text": "沙依巴克区",
						"value": "830000"
					},
					{
						"text": "新市区",
						"value": "830011"
					},
					{
						"text": "水磨沟区",
						"value": "830017"
					},
					{
						"text": "头屯河区",
						"value": "830022"
					},
					{
						"text": "达坂城区",
						"value": "830039"
					},
					{
						"text": "米东区",
						"value": "830019"
					},
					{
						"text": "乌鲁木齐县",
						"value": "830063"
					}
				]
			},
			{
				"text": "克拉玛依市",
				"value": "834000",
				"children": [
					{
						"text": "独山子区",
						"value": "834021"
					},
					{
						"text": "克拉玛依区",
						"value": "834000"
					},
					{
						"text": "白碱滩区",
						"value": "834008"
					},
					{
						"text": "乌尔禾区",
						"value": "834012"
					}
				]
			},
			{
				"text": "吐鲁番地区",
				"value": "838000",
				"children": [
					{
						"text": "吐鲁番市",
						"value": "838000"
					},
					{
						"text": "鄯善县",
						"value": "838200"
					},
					{
						"text": "托克逊县",
						"value": "838100"
					}
				]
			},
			{
				"text": "哈密地区",
				"value": "839000",
				"children": [
					{
						"text": "哈密市",
						"value": "839000"
					},
					{
						"text": "巴里坤哈萨克自治县",
						"value": "839200"
					},
					{
						"text": "伊吾县",
						"value": "839300"
					}
				]
			},
			{
				"text": "昌吉回族自治州",
				"value": "831100",
				"children": [
					{
						"text": "昌吉市",
						"value": "831100"
					},
					{
						"text": "阜康市",
						"value": "831500"
					},
					{
						"text": "呼图壁县",
						"value": "831200"
					},
					{
						"text": "玛纳斯县",
						"value": "832200"
					},
					{
						"text": "奇台县",
						"value": "831800"
					},
					{
						"text": "吉木萨尔县",
						"value": "831700"
					},
					{
						"text": "木垒哈萨克自治县",
						"value": "831900"
					}
				]
			},
			{
				"text": "博尔塔拉蒙古自治州",
				"value": "833400",
				"children": [
					{
						"text": "博乐市",
						"value": "833400"
					},
					{
						"text": "阿拉山口市",
						"value": "833400"
					},
					{
						"text": "精河县",
						"value": "833300"
					},
					{
						"text": "温泉县",
						"value": "833500"
					}
				]
			},
			{
				"text": "巴音郭楞蒙古自治州",
				"value": "841000",
				"children": [
					{
						"text": "库尔勒市",
						"value": "841000"
					},
					{
						"text": "轮台县",
						"value": "841600"
					},
					{
						"text": "尉犁县",
						"value": "841500"
					},
					{
						"text": "若羌县",
						"value": "841800"
					},
					{
						"text": "且末县",
						"value": "841900"
					},
					{
						"text": "焉耆回族自治县",
						"value": "841100"
					},
					{
						"text": "和静县",
						"value": "841300"
					},
					{
						"text": "和硕县",
						"value": "841200"
					},
					{
						"text": "博湖县",
						"value": "841400"
					}
				]
			},
			{
				"text": "阿克苏地区",
				"value": "843000",
				"children": [
					{
						"text": "阿克苏市",
						"value": "843000"
					},
					{
						"text": "温宿县",
						"value": "843100"
					},
					{
						"text": "库车县",
						"value": "842000"
					},
					{
						"text": "沙雅县",
						"value": "842200"
					},
					{
						"text": "新和县",
						"value": "842100"
					},
					{
						"text": "拜城县",
						"value": "842300"
					},
					{
						"text": "乌什县",
						"value": "843400"
					},
					{
						"text": "阿瓦提县",
						"value": "843200"
					},
					{
						"text": "柯坪县",
						"value": "843600"
					}
				]
			},
			{
				"text": "克孜勒苏柯尔克孜自治州",
				"value": "845350",
				"children": [
					{
						"text": "阿图什市",
						"value": "845350"
					},
					{
						"text": "阿克陶县",
						"value": "845550"
					},
					{
						"text": "阿合奇县",
						"value": "843500"
					},
					{
						"text": "乌恰县",
						"value": "845450"
					}
				]
			},
			{
				"text": "喀什地区",
				"value": "844000",
				"children": [
					{
						"text": "喀什市",
						"value": "844000"
					},
					{
						"text": "疏附县",
						"value": "844100"
					},
					{
						"text": "疏勒县",
						"value": "844200"
					},
					{
						"text": "英吉沙县",
						"value": "844500"
					},
					{
						"text": "泽普县",
						"value": "844800"
					},
					{
						"text": "莎车县",
						"value": "844700"
					},
					{
						"text": "叶城县",
						"value": "844900"
					},
					{
						"text": "麦盖提县",
						"value": "844600"
					},
					{
						"text": "岳普湖县",
						"value": "844400"
					},
					{
						"text": "伽师县",
						"value": "844300"
					},
					{
						"text": "巴楚县",
						"value": "843800"
					},
					{
						"text": "塔什库尔干塔吉克自治县",
						"value": "845250"
					}
				]
			},
			{
				"text": "和田地区",
				"value": "848000",
				"children": [
					{
						"text": "和田市",
						"value": "848000"
					},
					{
						"text": "和田县",
						"value": "848000"
					},
					{
						"text": "墨玉县",
						"value": "848100"
					},
					{
						"text": "皮山县",
						"value": "845150"
					},
					{
						"text": "洛浦县",
						"value": "848200"
					},
					{
						"text": "策勒县",
						"value": "848300"
					},
					{
						"text": "于田县",
						"value": "848400"
					},
					{
						"text": "民丰县",
						"value": "848500"
					}
				]
			},
			{
				"text": "伊犁哈萨克自治州",
				"value": "835100",
				"children": [
					{
						"text": "伊宁市",
						"value": "835000"
					},
					{
						"text": "奎屯市",
						"value": "833200"
					},
					{
						"text": "霍尔果斯市",
						"value": "835221"
					},
					{
						"text": "伊宁县",
						"value": "835100"
					},
					{
						"text": "察布查尔锡伯自治县",
						"value": "835300"
					},
					{
						"text": "霍城县",
						"value": "835200"
					},
					{
						"text": "巩留县",
						"value": "835400"
					},
					{
						"text": "新源县",
						"value": "835800"
					},
					{
						"text": "昭苏县",
						"value": "835600"
					},
					{
						"text": "特克斯县",
						"value": "835500"
					},
					{
						"text": "尼勒克县",
						"value": "835700"
					}
				]
			},
			{
				"text": "塔城地区",
				"value": "834700",
				"children": [
					{
						"text": "塔城市",
						"value": "834700"
					},
					{
						"text": "乌苏市",
						"value": "833000"
					},
					{
						"text": "额敏县",
						"value": "834600"
					},
					{
						"text": "沙湾县",
						"value": "832100"
					},
					{
						"text": "托里县",
						"value": "834500"
					},
					{
						"text": "裕民县",
						"value": "834800"
					},
					{
						"text": "和布克赛尔蒙古自治县",
						"value": "834400"
					}
				]
			},
			{
				"text": "阿勒泰地区",
				"value": "836500",
				"children": [
					{
						"text": "阿勒泰市",
						"value": "836500"
					},
					{
						"text": "布尔津县",
						"value": "836600"
					},
					{
						"text": "富蕴县",
						"value": "836100"
					},
					{
						"text": "福海县",
						"value": "836400"
					},
					{
						"text": "哈巴河县",
						"value": "836700"
					},
					{
						"text": "青河县",
						"value": "836200"
					},
					{
						"text": "吉木乃县",
						"value": "836800"
					}
				]
			},
			{
				"text": "直辖县级",
				"value": "",
				"children": [
					{
						"text": "石河子市",
						"value": "832000"
					},
					{
						"text": "阿拉尔市",
						"value": "843300"
					},
					{
						"text": "图木舒克市",
						"value": "843806"
					},
					{
						"text": "五家渠市",
						"value": "831300"
					},
					{
						"text": "北屯市",
						"value": "836000"
					},
					{
						"text": "铁门关市",
						"value": "836000"
					},
					{
						"text": "双河市",
						"value": "833408"
					}
				]
			}
		]
	},
	{
		"text": "台湾",
		"value": "200",
		"children": [
			{
				"text": "台北市",
				"value": "1",
				"children": [
					{
						"text": "松山区",
						"value": "105"
					},
					{
						"text": "信义区",
						"value": "110"
					},
					{
						"text": "大安区",
						"value": "106"
					},
					{
						"text": "中山区",
						"value": "104"
					},
					{
						"text": "中正区",
						"value": "100"
					},
					{
						"text": "大同区",
						"value": "103"
					},
					{
						"text": "万华区",
						"value": "108"
					},
					{
						"text": "文山区",
						"value": "116"
					},
					{
						"text": "南港区",
						"value": "115"
					},
					{
						"text": "内湖区",
						"value": "114"
					},
					{
						"text": "士林区",
						"value": "111"
					},
					{
						"text": "北投区",
						"value": "112"
					}
				]
			},
			{
				"text": "高雄市",
				"value": "8",
				"children": [
					{
						"text": "盐埕区",
						"value": "803"
					},
					{
						"text": "鼓山区",
						"value": "804"
					},
					{
						"text": "左营区",
						"value": "813"
					},
					{
						"text": "楠梓区",
						"value": "811"
					},
					{
						"text": "三民区",
						"value": "807"
					},
					{
						"text": "新兴区",
						"value": "800"
					},
					{
						"text": "前金区",
						"value": "801"
					},
					{
						"text": "苓雅区",
						"value": "802"
					},
					{
						"text": "前镇区",
						"value": "806"
					},
					{
						"text": "旗津区",
						"value": "805"
					},
					{
						"text": "小港区",
						"value": "812"
					},
					{
						"text": "凤山区",
						"value": "830"
					},
					{
						"text": "林园区",
						"value": "832"
					},
					{
						"text": "大寮区",
						"value": "831"
					},
					{
						"text": "大树区",
						"value": "840"
					},
					{
						"text": "大社区",
						"value": "815"
					},
					{
						"text": "仁武区",
						"value": "814"
					},
					{
						"text": "鸟松区",
						"value": "833"
					},
					{
						"text": "冈山区",
						"value": "820"
					},
					{
						"text": "桥头区",
						"value": "825"
					},
					{
						"text": "燕巢区",
						"value": "824"
					},
					{
						"text": "田寮区",
						"value": "823"
					},
					{
						"text": "阿莲区",
						"value": "822"
					},
					{
						"text": "路竹区",
						"value": "821"
					},
					{
						"text": "湖内区",
						"value": "829"
					},
					{
						"text": "茄萣区",
						"value": "852"
					},
					{
						"text": "永安区",
						"value": "828"
					},
					{
						"text": "弥陀区",
						"value": "827"
					},
					{
						"text": "梓官区",
						"value": "826"
					},
					{
						"text": "旗山区",
						"value": "842"
					},
					{
						"text": "美浓区",
						"value": "843"
					},
					{
						"text": "六龟区",
						"value": "844"
					},
					{
						"text": "甲仙区",
						"value": "847"
					},
					{
						"text": "杉林区",
						"value": "846"
					},
					{
						"text": "内门区",
						"value": "845"
					},
					{
						"text": "茂林区",
						"value": "851"
					},
					{
						"text": "桃源区",
						"value": "848"
					},
					{
						"text": "那玛夏区",
						"value": "849"
					}
				]
			},
			{
				"text": "基隆市",
				"value": "2",
				"children": [
					{
						"text": "中正区",
						"value": "202"
					},
					{
						"text": "七堵区",
						"value": "206"
					},
					{
						"text": "暖暖区",
						"value": "205"
					},
					{
						"text": "仁爱区",
						"value": "200"
					},
					{
						"text": "中山区",
						"value": "203"
					},
					{
						"text": "安乐区",
						"value": "204"
					},
					{
						"text": "信义区",
						"value": "201"
					}
				]
			},
			{
				"text": "台中市",
				"value": "4",
				"children": [
					{
						"text": "中区",
						"value": "400"
					},
					{
						"text": "东区",
						"value": "401"
					},
					{
						"text": "南区",
						"value": "402"
					},
					{
						"text": "西区",
						"value": "403"
					},
					{
						"text": "北区",
						"value": "404"
					},
					{
						"text": "西屯区",
						"value": "407"
					},
					{
						"text": "南屯区",
						"value": "408"
					},
					{
						"text": "北屯区",
						"value": "406"
					},
					{
						"text": "丰原区",
						"value": "420"
					},
					{
						"text": "东势区",
						"value": "423"
					},
					{
						"text": "大甲区",
						"value": "437"
					},
					{
						"text": "清水区",
						"value": "436"
					},
					{
						"text": "沙鹿区",
						"value": "433"
					},
					{
						"text": "梧栖区",
						"value": "435"
					},
					{
						"text": "后里区",
						"value": "421"
					},
					{
						"text": "神冈区",
						"value": "429"
					},
					{
						"text": "潭子区",
						"value": "427"
					},
					{
						"text": "大雅区",
						"value": "428"
					},
					{
						"text": "新社区",
						"value": "426"
					},
					{
						"text": "石冈区",
						"value": "422"
					},
					{
						"text": "外埔区",
						"value": "438"
					},
					{
						"text": "大安区",
						"value": "439"
					},
					{
						"text": "乌日区",
						"value": "414"
					},
					{
						"text": "大肚区",
						"value": "432"
					},
					{
						"text": "龙井区",
						"value": "434"
					},
					{
						"text": "雾峰区",
						"value": "413"
					},
					{
						"text": "太平区",
						"value": "411"
					},
					{
						"text": "大里区",
						"value": "412"
					},
					{
						"text": "和平区",
						"value": "424"
					}
				]
			},
			{
				"text": "台南市",
				"value": "7",
				"children": [
					{
						"text": "东区",
						"value": "701"
					},
					{
						"text": "南区",
						"value": "702"
					},
					{
						"text": "北区",
						"value": "704"
					},
					{
						"text": "安南区",
						"value": "709"
					},
					{
						"text": "安平区",
						"value": "708"
					},
					{
						"text": "中西区",
						"value": "700"
					},
					{
						"text": "新营区",
						"value": "730"
					},
					{
						"text": "盐水区",
						"value": "737"
					},
					{
						"text": "白河区",
						"value": "732"
					},
					{
						"text": "柳营区",
						"value": "736"
					},
					{
						"text": "后壁区",
						"value": "731"
					},
					{
						"text": "东山区",
						"value": "733"
					},
					{
						"text": "麻豆区",
						"value": "721"
					},
					{
						"text": "下营区",
						"value": "735"
					},
					{
						"text": "六甲区",
						"value": "734"
					},
					{
						"text": "官田区",
						"value": "720"
					},
					{
						"text": "大内区",
						"value": "742"
					},
					{
						"text": "佳里区",
						"value": "722"
					},
					{
						"text": "学甲区",
						"value": "726"
					},
					{
						"text": "西港区",
						"value": "723"
					},
					{
						"text": "七股区",
						"value": "724"
					},
					{
						"text": "将军区",
						"value": "725"
					},
					{
						"text": "北门区",
						"value": "727"
					},
					{
						"text": "新化区",
						"value": "712"
					},
					{
						"text": "善化区",
						"value": "741"
					},
					{
						"text": "新市区",
						"value": "744"
					},
					{
						"text": "安定区",
						"value": "745"
					},
					{
						"text": "山上区",
						"value": "743"
					},
					{
						"text": "玉井区",
						"value": "714"
					},
					{
						"text": "楠西区",
						"value": "715"
					},
					{
						"text": "南化区",
						"value": "716"
					},
					{
						"text": "左镇区",
						"value": "713"
					},
					{
						"text": "仁德区",
						"value": "717"
					},
					{
						"text": "归仁区",
						"value": "711"
					},
					{
						"text": "关庙区",
						"value": "718"
					},
					{
						"text": "龙崎区",
						"value": "719"
					},
					{
						"text": "永康区",
						"value": "710"
					}
				]
			},
			{
				"text": "新竹市",
				"value": "3",
				"children": [
					{
						"text": "东区",
						"value": "300"
					},
					{
						"text": "北区",
						"value": ""
					},
					{
						"text": "香山区",
						"value": ""
					}
				]
			},
			{
				"text": "嘉义市",
				"value": "6",
				"children": [
					{
						"text": "东区",
						"value": "600"
					},
					{
						"text": "西区",
						"value": "600"
					}
				]
			},
			{
				"text": "新北市",
				"value": "2",
				"children": [
					{
						"text": "板桥区",
						"value": "220"
					},
					{
						"text": "三重区",
						"value": "241"
					},
					{
						"text": "中和区",
						"value": "235"
					},
					{
						"text": "永和区",
						"value": "234"
					},
					{
						"text": "新庄区",
						"value": "242"
					},
					{
						"text": "新店区",
						"value": "231"
					},
					{
						"text": "树林区",
						"value": "238"
					},
					{
						"text": "莺歌区",
						"value": "239"
					},
					{
						"text": "三峡区",
						"value": "237"
					},
					{
						"text": "淡水区",
						"value": "251"
					},
					{
						"text": "汐止区",
						"value": "221"
					},
					{
						"text": "瑞芳区",
						"value": "224"
					},
					{
						"text": "土城区",
						"value": "236"
					},
					{
						"text": "芦洲区",
						"value": "247"
					},
					{
						"text": "五股区",
						"value": "248"
					},
					{
						"text": "泰山区",
						"value": "243"
					},
					{
						"text": "林口区",
						"value": "244"
					},
					{
						"text": "深坑区",
						"value": "222"
					},
					{
						"text": "石碇区",
						"value": "223"
					},
					{
						"text": "坪林区",
						"value": "232"
					},
					{
						"text": "三芝区",
						"value": "252"
					},
					{
						"text": "石门区",
						"value": "253"
					},
					{
						"text": "八里区",
						"value": "249"
					},
					{
						"text": "平溪区",
						"value": "226"
					},
					{
						"text": "双溪区",
						"value": "227"
					},
					{
						"text": "贡寮区",
						"value": "228"
					},
					{
						"text": "金山区",
						"value": "208"
					},
					{
						"text": "万里区",
						"value": "207"
					},
					{
						"text": "乌来区",
						"value": "233"
					}
				]
			},
			{
				"text": "宜兰县",
				"value": "2",
				"children": [
					{
						"text": "宜兰市",
						"value": "260"
					},
					{
						"text": "罗东镇",
						"value": "265"
					},
					{
						"text": "苏澳镇",
						"value": "270"
					},
					{
						"text": "头城镇",
						"value": "261"
					},
					{
						"text": "礁溪乡",
						"value": "262"
					},
					{
						"text": "壮围乡",
						"value": "263"
					},
					{
						"text": "员山乡",
						"value": "264"
					},
					{
						"text": "冬山乡",
						"value": "269"
					},
					{
						"text": "五结乡",
						"value": "268"
					},
					{
						"text": "三星乡",
						"value": "266"
					},
					{
						"text": "大同乡",
						"value": "267"
					},
					{
						"text": "南澳乡",
						"value": "272"
					}
				]
			},
			{
				"text": "桃园县",
				"value": "3",
				"children": [
					{
						"text": "桃园市",
						"value": "330"
					},
					{
						"text": "中坜市",
						"value": "320"
					},
					{
						"text": "平镇市",
						"value": "324"
					},
					{
						"text": "八德市",
						"value": "334"
					},
					{
						"text": "杨梅市",
						"value": "326"
					},
					{
						"text": "芦竹市",
						"value": "338"
					},
					{
						"text": "大溪镇",
						"value": "335"
					},
					{
						"text": "大园乡",
						"value": "337"
					},
					{
						"text": "龟山乡",
						"value": "333"
					},
					{
						"text": "龙潭乡",
						"value": "325"
					},
					{
						"text": "新屋乡",
						"value": "327"
					},
					{
						"text": "观音乡",
						"value": "328"
					},
					{
						"text": "复兴乡",
						"value": "336"
					}
				]
			},
			{
				"text": "新竹县",
				"value": "3",
				"children": [
					{
						"text": "竹北市",
						"value": "302"
					},
					{
						"text": "竹东镇",
						"value": "310"
					},
					{
						"text": "新埔镇",
						"value": "305"
					},
					{
						"text": "关西镇",
						"value": "306"
					},
					{
						"text": "湖口乡",
						"value": "303"
					},
					{
						"text": "新丰乡",
						"value": "304"
					},
					{
						"text": "芎林乡",
						"value": "307"
					},
					{
						"text": "横山乡",
						"value": "312"
					},
					{
						"text": "北埔乡",
						"value": "314"
					},
					{
						"text": "宝山乡",
						"value": "308"
					},
					{
						"text": "峨眉乡",
						"value": "315"
					},
					{
						"text": "尖石乡",
						"value": "313"
					},
					{
						"text": "五峰乡",
						"value": "311"
					}
				]
			},
			{
				"text": "苗栗县",
				"value": "3",
				"children": [
					{
						"text": "苗栗市",
						"value": "360"
					},
					{
						"text": "苑里镇",
						"value": "358"
					},
					{
						"text": "通霄镇",
						"value": "357"
					},
					{
						"text": "竹南镇",
						"value": "350"
					},
					{
						"text": "头份镇",
						"value": "351"
					},
					{
						"text": "后龙镇",
						"value": "356"
					},
					{
						"text": "卓兰镇",
						"value": "369"
					},
					{
						"text": "大湖乡",
						"value": "364"
					},
					{
						"text": "公馆乡",
						"value": "363"
					},
					{
						"text": "铜锣乡",
						"value": "366"
					},
					{
						"text": "南庄乡",
						"value": "353"
					},
					{
						"text": "头屋乡",
						"value": "362"
					},
					{
						"text": "三义乡",
						"value": "367"
					},
					{
						"text": "西湖乡",
						"value": "368"
					},
					{
						"text": "造桥乡",
						"value": "361"
					},
					{
						"text": "三湾乡",
						"value": "352"
					},
					{
						"text": "狮潭乡",
						"value": "354"
					},
					{
						"text": "泰安乡",
						"value": "365"
					}
				]
			},
			{
				"text": "彰化县",
				"value": "5",
				"children": [
					{
						"text": "彰化市",
						"value": "500"
					},
					{
						"text": "鹿港镇",
						"value": "505"
					},
					{
						"text": "和美镇",
						"value": "508"
					},
					{
						"text": "线西乡",
						"value": "507"
					},
					{
						"text": "伸港乡",
						"value": "509"
					},
					{
						"text": "福兴乡",
						"value": "506"
					},
					{
						"text": "秀水乡",
						"value": "504"
					},
					{
						"text": "花坛乡",
						"value": "503"
					},
					{
						"text": "芬园乡",
						"value": "502"
					},
					{
						"text": "员林镇",
						"value": "510"
					},
					{
						"text": "溪湖镇",
						"value": "514"
					},
					{
						"text": "田中镇",
						"value": "520"
					},
					{
						"text": "大村乡",
						"value": "515"
					},
					{
						"text": "埔盐乡",
						"value": "516"
					},
					{
						"text": "埔心乡",
						"value": "513"
					},
					{
						"text": "永靖乡",
						"value": "512"
					},
					{
						"text": "社头乡",
						"value": "511"
					},
					{
						"text": "二水乡",
						"value": "530"
					},
					{
						"text": "北斗镇",
						"value": "521"
					},
					{
						"text": "二林镇",
						"value": "526"
					},
					{
						"text": "田尾乡",
						"value": "522"
					},
					{
						"text": "埤头乡",
						"value": "523"
					},
					{
						"text": "芳苑乡",
						"value": "528"
					},
					{
						"text": "大城乡",
						"value": "527"
					},
					{
						"text": "竹塘乡",
						"value": "525"
					},
					{
						"text": "溪州乡",
						"value": "524"
					}
				]
			},
			{
				"text": "南投县",
				"value": "5",
				"children": [
					{
						"text": "南投市",
						"value": "540"
					},
					{
						"text": "埔里镇",
						"value": "545"
					},
					{
						"text": "草屯镇",
						"value": "542"
					},
					{
						"text": "竹山镇",
						"value": "557"
					},
					{
						"text": "集集镇",
						"value": "552"
					},
					{
						"text": "名间乡",
						"value": "551"
					},
					{
						"text": "鹿谷乡",
						"value": "558"
					},
					{
						"text": "中寮乡",
						"value": "541"
					},
					{
						"text": "鱼池乡",
						"value": "555"
					},
					{
						"text": "国姓乡",
						"value": "544"
					},
					{
						"text": "水里乡",
						"value": "553"
					},
					{
						"text": "信义乡",
						"value": "556"
					},
					{
						"text": "仁爱乡",
						"value": "546"
					}
				]
			},
			{
				"text": "云林县",
				"value": "6",
				"children": [
					{
						"text": "斗六市",
						"value": "640"
					},
					{
						"text": "斗南镇",
						"value": "630"
					},
					{
						"text": "虎尾镇",
						"value": "632"
					},
					{
						"text": "西螺镇",
						"value": "648"
					},
					{
						"text": "土库镇",
						"value": "633"
					},
					{
						"text": "北港镇",
						"value": "651"
					},
					{
						"text": "古坑乡",
						"value": "646"
					},
					{
						"text": "大埤乡",
						"value": "631"
					},
					{
						"text": "莿桐乡",
						"value": "647"
					},
					{
						"text": "林内乡",
						"value": "643"
					},
					{
						"text": "二仑乡",
						"value": "649"
					},
					{
						"text": "仑背乡",
						"value": "637"
					},
					{
						"text": "麦寮乡",
						"value": "638"
					},
					{
						"text": "东势乡",
						"value": "635"
					},
					{
						"text": "褒忠乡",
						"value": "634"
					},
					{
						"text": "台西乡",
						"value": "636"
					},
					{
						"text": "元长乡",
						"value": "655"
					},
					{
						"text": "四湖乡",
						"value": "654"
					},
					{
						"text": "口湖乡",
						"value": "653"
					},
					{
						"text": "水林乡",
						"value": "652"
					}
				]
			},
			{
				"text": "嘉义县",
				"value": "6",
				"children": [
					{
						"text": "太保市",
						"value": "612"
					},
					{
						"text": "朴子市",
						"value": "613"
					},
					{
						"text": "布袋镇",
						"value": "625"
					},
					{
						"text": "大林镇",
						"value": "622"
					},
					{
						"text": "民雄乡",
						"value": "621"
					},
					{
						"text": "溪口乡",
						"value": "623"
					},
					{
						"text": "新港乡",
						"value": "616"
					},
					{
						"text": "六脚乡",
						"value": "615"
					},
					{
						"text": "东石乡",
						"value": "614"
					},
					{
						"text": "义竹乡",
						"value": "624"
					},
					{
						"text": "鹿草乡",
						"value": "611"
					},
					{
						"text": "水上乡",
						"value": "608"
					},
					{
						"text": "中埔乡",
						"value": "606"
					},
					{
						"text": "竹崎乡",
						"value": "604"
					},
					{
						"text": "梅山乡",
						"value": "603"
					},
					{
						"text": "番路乡",
						"value": "602"
					},
					{
						"text": "大埔乡",
						"value": "607"
					},
					{
						"text": "阿里山乡",
						"value": "605"
					}
				]
			},
			{
				"text": "屏东县",
				"value": "9",
				"children": [
					{
						"text": "屏东市",
						"value": "900"
					},
					{
						"text": "潮州镇",
						"value": "920"
					},
					{
						"text": "东港镇",
						"value": "928"
					},
					{
						"text": "恒春镇",
						"value": "946"
					},
					{
						"text": "万丹乡",
						"value": "913"
					},
					{
						"text": "长治乡",
						"value": "908"
					},
					{
						"text": "麟洛乡",
						"value": "909"
					},
					{
						"text": "九如乡",
						"value": "904"
					},
					{
						"text": "里港乡",
						"value": "905"
					},
					{
						"text": "盐埔乡",
						"value": "907"
					},
					{
						"text": "高树乡",
						"value": "906"
					},
					{
						"text": "万峦乡",
						"value": "923"
					},
					{
						"text": "内埔乡",
						"value": "912"
					},
					{
						"text": "竹田乡",
						"value": "911"
					},
					{
						"text": "新埤乡",
						"value": "925"
					},
					{
						"text": "枋寮乡",
						"value": "940"
					},
					{
						"text": "新园乡",
						"value": "932"
					},
					{
						"text": "崁顶乡",
						"value": "924"
					},
					{
						"text": "林边乡",
						"value": "927"
					},
					{
						"text": "南州乡",
						"value": "926"
					},
					{
						"text": "佳冬乡",
						"value": "931"
					},
					{
						"text": "琉球乡",
						"value": "929"
					},
					{
						"text": "车城乡",
						"value": "944"
					},
					{
						"text": "满州乡",
						"value": "947"
					},
					{
						"text": "枋山乡",
						"value": "941"
					},
					{
						"text": "三地门乡",
						"value": "901"
					},
					{
						"text": "雾台乡",
						"value": "902"
					},
					{
						"text": "玛家乡",
						"value": "903"
					},
					{
						"text": "泰武乡",
						"value": "921"
					},
					{
						"text": "来义乡",
						"value": "922"
					},
					{
						"text": "春日乡",
						"value": "942"
					},
					{
						"text": "狮子乡",
						"value": "943"
					},
					{
						"text": "牡丹乡",
						"value": "945"
					}
				]
			},
			{
				"text": "台东县",
				"value": "9",
				"children": [
					{
						"text": "台东市",
						"value": "950"
					},
					{
						"text": "成功镇",
						"value": "961"
					},
					{
						"text": "关山镇",
						"value": "956"
					},
					{
						"text": "卑南乡",
						"value": "954"
					},
					{
						"text": "鹿野乡",
						"value": "955"
					},
					{
						"text": "池上乡",
						"value": "958"
					},
					{
						"text": "东河乡",
						"value": "959"
					},
					{
						"text": "长滨乡",
						"value": "962"
					},
					{
						"text": "太麻里乡",
						"value": "963"
					},
					{
						"text": "大武乡",
						"value": "965"
					},
					{
						"text": "绿岛乡",
						"value": "951"
					},
					{
						"text": "海端乡",
						"value": "957"
					},
					{
						"text": "延平乡",
						"value": "953"
					},
					{
						"text": "金峰乡",
						"value": "964"
					},
					{
						"text": "达仁乡",
						"value": "966"
					},
					{
						"text": "兰屿乡",
						"value": "952"
					}
				]
			},
			{
				"text": "花莲县",
				"value": "9",
				"children": [
					{
						"text": "花莲市",
						"value": "970"
					},
					{
						"text": "凤林镇",
						"value": "975"
					},
					{
						"text": "玉里镇",
						"value": "981"
					},
					{
						"text": "新城乡",
						"value": "971"
					},
					{
						"text": "吉安乡",
						"value": "973"
					},
					{
						"text": "寿丰乡",
						"value": "974"
					},
					{
						"text": "光复乡",
						"value": "976"
					},
					{
						"text": "丰滨乡",
						"value": "977"
					},
					{
						"text": "瑞穗乡",
						"value": "978"
					},
					{
						"text": "富里乡",
						"value": "983"
					},
					{
						"text": "秀林乡",
						"value": "972"
					},
					{
						"text": "万荣乡",
						"value": "979"
					},
					{
						"text": "卓溪乡",
						"value": "982"
					}
				]
			},
			{
				"text": "澎湖县",
				"value": "8",
				"children": [
					{
						"text": "马公市",
						"value": "880"
					},
					{
						"text": "湖西乡",
						"value": "885"
					},
					{
						"text": "白沙乡",
						"value": "884"
					},
					{
						"text": "西屿乡",
						"value": "881"
					},
					{
						"text": "望安乡",
						"value": "882"
					},
					{
						"text": "七美乡",
						"value": "883"
					}
				]
			},
			{
				"text": "金门县",
				"value": "8",
				"children": [
					{
						"text": "金城镇",
						"value": "893"
					},
					{
						"text": "金湖镇",
						"value": "891"
					},
					{
						"text": "金沙镇",
						"value": "890"
					},
					{
						"text": "金宁乡",
						"value": "892"
					},
					{
						"text": "烈屿乡",
						"value": "894"
					},
					{
						"text": "乌丘乡",
						"value": "896"
					}
				]
			},
			{
				"text": "连江县",
				"value": "2",
				"children": [
					{
						"text": "南竿乡",
						"value": "209"
					},
					{
						"text": "北竿乡",
						"value": "210"
					},
					{
						"text": "莒光乡",
						"value": "211"
					},
					{
						"text": "东引乡",
						"value": "212"
					}
				]
			}
		]
	},
	{
		"text": "香港特别行政区",
		"value": "999077",
		"children": [
			{
				"text": "香港岛",
				"value": "999077",
				"children": [
					{
						"text": "中西区",
						"value": "999077"
					},
					{
						"text": "湾仔区",
						"value": "999077"
					},
					{
						"text": "东区",
						"value": "999077"
					},
					{
						"text": "南区",
						"value": "999077"
					}
				]
			},
			{
				"text": "九龙",
				"value": "999077",
				"children": [
					{
						"text": "油尖旺区",
						"value": "999077"
					},
					{
						"text": "深水埗区",
						"value": "999077"
					},
					{
						"text": "九龙城区",
						"value": "999077"
					},
					{
						"text": "黄大仙区",
						"value": "999077"
					},
					{
						"text": "观塘区",
						"value": "999077"
					}
				]
			},
			{
				"text": "新界",
				"value": "999077",
				"children": [
					{
						"text": "荃湾区",
						"value": "999077"
					},
					{
						"text": "屯门区",
						"value": "999077"
					},
					{
						"text": "元朗区",
						"value": "999077"
					},
					{
						"text": "北区",
						"value": "999077"
					},
					{
						"text": "大埔区",
						"value": "999077"
					},
					{
						"text": "西贡区",
						"value": "999077"
					},
					{
						"text": "沙田区",
						"value": "999077"
					},
					{
						"text": "葵青区",
						"value": "999077"
					},
					{
						"text": "离岛区",
						"value": "999077"
					}
				]
			}
		]
	},
	{
		"text": "澳门特别行政区",
		"value": "999078",
		"children": [
			{
				"text": "澳门半岛",
				"value": "999078",
				"children": [
					{
						"text": "花地玛堂区",
						"value": "999078"
					},
					{
						"text": "圣安多尼堂区",
						"value": "999078"
					},
					{
						"text": "大堂区",
						"value": "999078"
					},
					{
						"text": "望德堂区",
						"value": "999078"
					},
					{
						"text": "风顺堂区",
						"value": "999078"
					}
				]
			},
			{
				"text": "氹仔岛",
				"value": "999078",
				"children": [
					{
						"text": "嘉模堂区",
						"value": "999078"
					}
				]
			},
			{
				"text": "路环岛",
				"value": "999078",
				"children": [
					{
						"text": "圣方济各堂区",
						"value": "999078"
					}
				]
			}
		]
	}
]
export {
	citylist
}